<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Создание детального отчёта со всеми полями, типами и направлениями',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'Всё во всём',
                'fields' => '[]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '2',
                        2 => '3',
                        3 => '5',
                        4 => '6',
                        5 => '4',
                        6 => '10',
                        7 => '9',
                        8 => '8',
                        9 => '7',
                        10 => '11',
                        11 => '12',
                        12 => '13',
                        13 => '14',
                        14 => '15',
                    ],
                    'team_direction' => [
                        0 => '1',
                        1 => '2',
                        2 => '3',
                        3 => '4',
                        4 => '6',
                        5 => '5',
                    ],
                ],
                'type' => 0,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    2 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    3 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    4 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    5 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    6 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    7 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    8 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    9 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    10 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    11 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    12 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    13 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    14 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    15 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    16 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    17 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    18 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    19 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    20 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    21 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    22 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    23 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    24 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    25 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    26 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    27 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    28 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    29 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    30 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    31 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    32 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    33 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    34 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    35 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    36 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                    37 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    38 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    39 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    40 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    41 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    42 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    43 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    44 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    45 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    46 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    47 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    48 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    49 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    50 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    52 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    53 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    54 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    55 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    56 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    57 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    58 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    59 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    60 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    61 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    62 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    63 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    64 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    65 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    66 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    67 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    68 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    69 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    70 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    71 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    72 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    73 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    74 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    75 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    76 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    77 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    78 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    79 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    80 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    81 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    82 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    83 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    84 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    85 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    86 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    87 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    88 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    89 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    90 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    91 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    92 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    93 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    94 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    95 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    96 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    97 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    98 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    99 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    102 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    103 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    104 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    105 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    106 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    107 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    108 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    109 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    110 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    111 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    112 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    113 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    114 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    115 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    116 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    117 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    118 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    119 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    120 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    121 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    122 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    123 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    124 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    125 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    126 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    127 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    128 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    129 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    130 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    131 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    132 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    133 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    134 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    135 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    136 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    137 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    138 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    139 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    140 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    141 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    142 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    143 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    144 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    145 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    146 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    147 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    148 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    149 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    150 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    151 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    152 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    153 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    154 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    155 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    156 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    157 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    158 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    159 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    160 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    161 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    162 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    163 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    164 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    165 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    166 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    167 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    168 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    169 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    170 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    171 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    172 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    173 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    174 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    175 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    176 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    177 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    178 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    179 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    180 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    181 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    182 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    183 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    184 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    185 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    186 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    187 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    188 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    189 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    190 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    191 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    192 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    193 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    194 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    195 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    196 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    197 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    198 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    199 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    200 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    201 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    202 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    203 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    204 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    205 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                    206 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    207 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    208 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    209 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    210 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    211 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    212 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                ],
                'unSelectedFields' => [
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => NULL,
                    'title' => 'Всё во всём',
                    'fields' => '[]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '2',
                            2 => '3',
                            3 => '5',
                            4 => '6',
                            5 => '4',
                            6 => '10',
                            7 => '9',
                            8 => '8',
                            9 => '7',
                            10 => '11',
                            11 => '12',
                            12 => '13',
                            13 => '14',
                            14 => '15',
                        ],
                        'team_direction' => [
                            0 => '1',
                            1 => '2',
                            2 => '3',
                            3 => '4',
                            4 => '6',
                            5 => '5',
                        ],
                    ],
                    'type' => 0,
                    'selectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        2 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        3 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        4 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        5 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        6 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        7 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        8 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        9 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        10 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        11 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        12 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        13 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        14 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        15 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        16 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        17 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        18 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        19 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        20 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        21 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        22 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        23 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        24 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        25 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        26 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        27 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        28 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        29 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        30 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        31 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        32 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        33 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        34 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        35 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        36 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                        37 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        38 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        39 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        40 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        41 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        42 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        43 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        44 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        45 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        46 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        47 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        48 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        49 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        50 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        51 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        52 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        53 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        54 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        55 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        56 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        57 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        58 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        59 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        60 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        61 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        62 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        63 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        64 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        65 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        66 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        67 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        68 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        69 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        70 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        71 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        72 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        73 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        74 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        75 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        76 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        77 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        78 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        79 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        80 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        81 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        82 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        83 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        84 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        85 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        86 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        87 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        88 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        89 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        90 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        91 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        92 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        93 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        94 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        95 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        96 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        97 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        98 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        99 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        100 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        101 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        102 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        103 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        104 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        105 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        106 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        107 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        108 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        109 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        110 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        111 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        112 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        113 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        114 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        115 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        116 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        117 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        118 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        119 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        120 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        121 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        122 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        123 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        124 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        125 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        126 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        127 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        128 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        129 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        130 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        131 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        132 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        133 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        134 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        135 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        136 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        137 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        138 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        139 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        140 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        141 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        142 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        143 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        144 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        145 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        146 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        147 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        148 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        149 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        150 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        151 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        152 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        153 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        154 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        155 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        156 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        157 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        158 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        159 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        160 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        161 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        162 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        163 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        164 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        165 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        166 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        167 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        168 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        169 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        170 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        171 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        172 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        173 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        174 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        175 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        176 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        177 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        178 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        179 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        180 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        181 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        182 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        183 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        184 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        185 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        186 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        187 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        188 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        189 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        190 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        191 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        192 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        193 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        194 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        195 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        196 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        197 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        198 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        199 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        200 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        201 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        202 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        203 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        204 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        205 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                        206 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        207 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        208 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        209 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        210 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        211 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        212 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                    ],
                    'unSelectedFields' => [
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => [
                        [
                            'id' => 1,
                            'title' => 'Всё во всём',
                            'fields' => '["id", "type_id", "author_id", "supervisor_id", "manager_id", "status", "previous_status", "awaiting_correction", "created_at", "subject", "description", "direction", "category_id", "seller_id", "amount_to_work", "recommendations", "reason", "parent_id", "planned_start_date", "planned_finish_date", "actual_start_date", "actual_finish_date", "supervisor_process_date", "supervisor_check_date", "result_comment", "supervisor_comment", "correction_comment", "team_direction", "last_change_status_date", "priority", "report_period_id", "sv_report_periods", "cross_check_status", "cross_check_manager_id", "employee_code_1c", "child_count", "photo_load_status", "supervisor_drfo", "manager_drfo", "supervisor_team", "manager_team", "173", "172", "171", "170", "169", "168", "167", "166", "165", "164", "162", "163", "161", "160", "89", "158", "159", "157", "156", "155", "154", "153", "150", "152", "151", "148", "147", "145", "146", "144", "143", "142", "141", "140", "139", "138", "137", "135", "136", "134", "133", "132", "131", "130", "129", "128", "127", "5", "121", "126", "125", "124", "123", "122", "101", "120", "118", "117", "116", "115", "114", "113", "112", "111", "110", "109", "108", "107", "106", "105", "104", "103", "102", "100", "99", "98", "97", "96", "95", "94", "92", "91", "90", "88", "87", "86", "85", "84", "83", "82", "81", "80", "79", "78", "77", "76", "74", "75", "73", "72", "71", "70", "69", "68", "67", "66", "65", "64", "63", "61", "60", "59", "58", "57", "56", "55", "54", "53", "52", "51", "50", "49", "48", "47", "46", "45", "44", "43", "42", "41", "39", "40", "38", "37", "36", "35", "34", "33", "32", "31", "30", "29", "28", "27", "26", "25", "24", "23", "22", "21", "20", "18", "14", "19", "17", "16", "15", "13", "12", "11", "10", "9", "7", "8", "1", "6", "2", "3", "4", "62", "93", "149"]',
                            'conditions' => '{"type_id": ["1", "2", "3", "5", "6", "4", "10", "9", "8", "7", "11", "12", "13", "14", "15"], "team_direction": ["1", "2", "3", "4", "6", "5"]}',
                            'type' => 0
                        ]
                    ],
                ],
            ]
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Создание детального отчёта с несколькими полями, типами и направлениями',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case2.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create',
                'fields' => '[]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                        2 => '7',
                        3 => '13',
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '6',
                    ],
                ],
                'type' => 0,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => NULL,
                    'title' => 'http://gomer.local/lisa/#/report/create?mode=create',
                    'fields' => '[]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '4',
                            2 => '7',
                            3 => '13',
                        ],
                        'team_direction' => [
                            0 => '2',
                            1 => '4',
                            2 => '6',
                        ],
                    ],
                    'type' => 0,
                    'selectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        2 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        3 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        4 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        5 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        6 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        7 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        8 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        9 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        10 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        11 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        12 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        13 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        14 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        15 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        16 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        17 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        18 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        19 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        20 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        21 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        22 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        23 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        24 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        25 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        26 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        27 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        28 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        29 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        30 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                    ],
                    'unSelectedFields' => [
                        0 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        1 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        2 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        3 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        4 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        5 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        6 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        7 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        8 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        9 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        10 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        11 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        12 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        13 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        14 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        15 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        16 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        17 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        18 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        19 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        20 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        21 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        22 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        23 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        24 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        25 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        26 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        27 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        28 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        29 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        30 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        31 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        32 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        33 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        34 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        35 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        36 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        37 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        38 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        39 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        40 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        41 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        42 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        43 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        44 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        45 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        46 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        47 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        48 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        49 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        50 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        51 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        52 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        53 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        54 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        55 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        56 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        57 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        58 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        59 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        60 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        61 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        62 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        63 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        64 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        65 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        66 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        67 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        68 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        69 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        70 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        71 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        72 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        73 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        74 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        75 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        76 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        77 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        78 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        79 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        80 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        81 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        82 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        83 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        84 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        85 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        86 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        87 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        88 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        89 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        90 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        91 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        92 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        93 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        94 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        95 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        96 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        97 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        98 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        99 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        100 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        101 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        102 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        103 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        104 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        105 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        106 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        107 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        108 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        109 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        110 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        111 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        112 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        113 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        114 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        115 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        116 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        117 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        118 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        119 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        120 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        121 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        122 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        123 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        124 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        125 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        126 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        127 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        128 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        129 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        130 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        131 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        132 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        133 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                        134 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        135 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        136 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        137 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        138 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        139 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        140 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        141 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        142 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        143 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        144 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        145 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        146 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        147 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        148 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        149 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        150 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        151 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        152 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        153 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        154 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        155 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        156 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        157 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        158 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        159 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        160 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        161 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        162 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        163 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        164 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        165 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        166 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        167 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        168 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        169 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        170 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        171 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        172 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        173 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        174 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        175 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        176 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        177 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        178 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        179 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        180 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        181 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => array_merge_recursive(
                        (include __DIR__ . '/fixture/case2.php')['lisa_fixtures']['reports'],
                        [
                            [
                                'id' => 2,
                                'title' => 'http://gomer.local/lisa/#/report/create?mode=create',
                                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                                'conditions' => '{"type_id": ["1", "4", "7", "13"], "team_direction": ["2", "4", "6"]}',
                                'type' => 0
                            ]
                        ]
                    )
                ],
            ]
        ]
    ],

    'case3' => [
        'setting' => [
            'description' => 'Создание сводного отчёта со всеми полями, типами и направлениями',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case3.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'Всё во всём (сводный)',
                'fields' => '["id", "type_id", "author_id", "supervisor_id", "manager_id", "status", "previous_status", "awaiting_correction", "created_at", "subject", "description", "direction", "category_id", "seller_id", "amount_to_work", "recommendations", "reason", "parent_id", "planned_start_date", "planned_finish_date", "actual_start_date", "actual_finish_date", "supervisor_process_date", "supervisor_check_date", "result_comment", "supervisor_comment", "correction_comment", "team_direction", "last_change_status_date", "priority", "report_period_id", "sv_report_periods", "cross_check_status", "cross_check_manager_id", "employee_code_1c", "child_count", "photo_load_status", "supervisor_drfo", "manager_drfo", "supervisor_team", "manager_team", "173", "172", "171", "170", "169", "168", "167", "166", "165", "164", "162", "163", "161", "160", "89", "158", "159", "157", "156", "155", "154", "153", "150", "152", "151", "148", "147", "145", "146", "144", "143", "142", "141", "140", "139", "138", "137", "135", "136", "134", "133", "132", "131", "130", "129", "128", "127", "5", "121", "126", "125", "124", "123", "122", "101", "120", "118", "117", "116", "115", "114", "113", "112", "111", "110", "109", "108", "107", "106", "105", "104", "103", "102", "100", "99", "98", "97", "96", "95", "94", "92", "91", "90", "88", "87", "86", "85", "84", "83", "82", "81", "80", "79", "78", "77", "76", "74", "75", "73", "72", "71", "70", "69", "68", "67", "66", "65", "64", "63", "61", "60", "59", "58", "57", "56", "55", "54", "53", "52", "51", "50", "49", "48", "47", "46", "45", "44", "43", "42", "41", "39", "40", "38", "37", "36", "35", "34", "33", "32", "31", "30", "29", "28", "27", "26", "25", "24", "23", "22", "21", "20", "18", "14", "19", "17", "16", "15", "13", "12", "11", "10", "9", "7", "8", "1", "6", "2", "3", "4", "62", "93", "149"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '2',
                        2 => '3',
                        3 => '5',
                        4 => '6',
                        5 => '4',
                        6 => '10',
                        7 => '9',
                        8 => '8',
                        9 => '7',
                        10 => '11',
                        11 => '12',
                        12 => '13',
                        13 => '14',
                        14 => '15',
                    ],
                    'team_direction' => [
                        0 => '1',
                        1 => '2',
                        2 => '3',
                        3 => '4',
                        4 => '6',
                        5 => '5',
                    ],
                ],
                'type' => 1,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    2 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    3 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    4 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    5 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    6 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    7 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    8 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    9 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    10 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    11 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    12 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    13 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    14 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    15 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    16 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    17 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    18 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    19 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    20 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    21 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    22 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    23 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    24 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    25 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    26 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    27 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    28 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    29 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    30 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    31 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    32 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    33 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    34 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    35 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    36 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                    37 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    38 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    39 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    40 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    41 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    42 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    43 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    44 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    45 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    46 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    47 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    48 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    49 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    50 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    52 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    53 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    54 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    55 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    56 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    57 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    58 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    59 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    60 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    61 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    62 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    63 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    64 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    65 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    66 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    67 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    68 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    69 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    70 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    71 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    72 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    73 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    74 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    75 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    76 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    77 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    78 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    79 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    80 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    81 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    82 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    83 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    84 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    85 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    86 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    87 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    88 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    89 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    90 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    91 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    92 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    93 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    94 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    95 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    96 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    97 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    98 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    99 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    102 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    103 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    104 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    105 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    106 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    107 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    108 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    109 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    110 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    111 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    112 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    113 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    114 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    115 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    116 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    117 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    118 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    119 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    120 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    121 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    122 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    123 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    124 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    125 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    126 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    127 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    128 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    129 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    130 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    131 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    132 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    133 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    134 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    135 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    136 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    137 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    138 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    139 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    140 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    141 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    142 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    143 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    144 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    145 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    146 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    147 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    148 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    149 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    150 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    151 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    152 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    153 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    154 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    155 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    156 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    157 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    158 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    159 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    160 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    161 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    162 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    163 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    164 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    165 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    166 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    167 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    168 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    169 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    170 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    171 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    172 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    173 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    174 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    175 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    176 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    177 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    178 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    179 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    180 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    181 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    182 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    183 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    184 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    185 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    186 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    187 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    188 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    189 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    190 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    191 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    192 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    193 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    194 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    195 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    196 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    197 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    198 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    199 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    200 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    201 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    202 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    203 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    204 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    205 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                    206 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    207 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    208 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    209 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    210 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    211 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    212 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                ],
                'unSelectedFields' => [
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => NULL,
                    'title' => 'Всё во всём (сводный)',
                    'fields' => '["id", "type_id", "author_id", "supervisor_id", "manager_id", "status", "previous_status", "awaiting_correction", "created_at", "subject", "description", "direction", "category_id", "seller_id", "amount_to_work", "recommendations", "reason", "parent_id", "planned_start_date", "planned_finish_date", "actual_start_date", "actual_finish_date", "supervisor_process_date", "supervisor_check_date", "result_comment", "supervisor_comment", "correction_comment", "team_direction", "last_change_status_date", "priority", "report_period_id", "sv_report_periods", "cross_check_status", "cross_check_manager_id", "employee_code_1c", "child_count", "photo_load_status", "supervisor_drfo", "manager_drfo", "supervisor_team", "manager_team", "173", "172", "171", "170", "169", "168", "167", "166", "165", "164", "162", "163", "161", "160", "89", "158", "159", "157", "156", "155", "154", "153", "150", "152", "151", "148", "147", "145", "146", "144", "143", "142", "141", "140", "139", "138", "137", "135", "136", "134", "133", "132", "131", "130", "129", "128", "127", "5", "121", "126", "125", "124", "123", "122", "101", "120", "118", "117", "116", "115", "114", "113", "112", "111", "110", "109", "108", "107", "106", "105", "104", "103", "102", "100", "99", "98", "97", "96", "95", "94", "92", "91", "90", "88", "87", "86", "85", "84", "83", "82", "81", "80", "79", "78", "77", "76", "74", "75", "73", "72", "71", "70", "69", "68", "67", "66", "65", "64", "63", "61", "60", "59", "58", "57", "56", "55", "54", "53", "52", "51", "50", "49", "48", "47", "46", "45", "44", "43", "42", "41", "39", "40", "38", "37", "36", "35", "34", "33", "32", "31", "30", "29", "28", "27", "26", "25", "24", "23", "22", "21", "20", "18", "14", "19", "17", "16", "15", "13", "12", "11", "10", "9", "7", "8", "1", "6", "2", "3", "4", "62", "93", "149"]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '2',
                            2 => '3',
                            3 => '5',
                            4 => '6',
                            5 => '4',
                            6 => '10',
                            7 => '9',
                            8 => '8',
                            9 => '7',
                            10 => '11',
                            11 => '12',
                            12 => '13',
                            13 => '14',
                            14 => '15',
                        ],
                        'team_direction' => [
                            0 => '1',
                            1 => '2',
                            2 => '3',
                            3 => '4',
                            4 => '6',
                            5 => '5',
                        ],
                    ],
                    'type' => '1',
                    'selectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        2 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        3 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        4 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        5 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        6 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        7 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        8 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        9 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        10 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        11 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        12 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        13 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        14 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        15 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        16 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        17 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        18 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        19 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        20 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        21 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        22 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        23 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        24 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        25 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        26 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        27 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        28 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        29 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        30 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        31 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        32 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        33 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        34 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        35 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        36 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                        37 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        38 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        39 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        40 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        41 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        42 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        43 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        44 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        45 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        46 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        47 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        48 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        49 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        50 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        51 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        52 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        53 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        54 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        55 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        56 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        57 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        58 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        59 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        60 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        61 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        62 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        63 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        64 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        65 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        66 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        67 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        68 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        69 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        70 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        71 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        72 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        73 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        74 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        75 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        76 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        77 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        78 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        79 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        80 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        81 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        82 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        83 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        84 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        85 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        86 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        87 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        88 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        89 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        90 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        91 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        92 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        93 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        94 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        95 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        96 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        97 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        98 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        99 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        100 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        101 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        102 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        103 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        104 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        105 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        106 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        107 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        108 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        109 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        110 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        111 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        112 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        113 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        114 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        115 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        116 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        117 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        118 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        119 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        120 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        121 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        122 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        123 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        124 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        125 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        126 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        127 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        128 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        129 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        130 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        131 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        132 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        133 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        134 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        135 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        136 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        137 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        138 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        139 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        140 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        141 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        142 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        143 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        144 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        145 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        146 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        147 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        148 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        149 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        150 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        151 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        152 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        153 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        154 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        155 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        156 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        157 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        158 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        159 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        160 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        161 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        162 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        163 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        164 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        165 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        166 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        167 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        168 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        169 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        170 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        171 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        172 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        173 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        174 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        175 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        176 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        177 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        178 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        179 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        180 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        181 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        182 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        183 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        184 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        185 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        186 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        187 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        188 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        189 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        190 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        191 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        192 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        193 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        194 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        195 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        196 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        197 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        198 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        199 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        200 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        201 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        202 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        203 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        204 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        205 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                        206 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        207 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        208 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        209 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        210 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        211 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        212 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                    ],
                    'unSelectedFields' => [
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => array_merge_recursive(
                        (include __DIR__ . '/fixture/case3.php')['lisa_fixtures']['reports'],
                        [
                            [
                                'id' => 3,
                                'title' => 'Всё во всём (сводный)',
                                'fields' => '["id", "type_id", "author_id", "supervisor_id", "manager_id", "status", "previous_status", "awaiting_correction", "created_at", "subject", "description", "direction", "category_id", "seller_id", "amount_to_work", "recommendations", "reason", "parent_id", "planned_start_date", "planned_finish_date", "actual_start_date", "actual_finish_date", "supervisor_process_date", "supervisor_check_date", "result_comment", "supervisor_comment", "correction_comment", "team_direction", "last_change_status_date", "priority", "report_period_id", "sv_report_periods", "cross_check_status", "cross_check_manager_id", "employee_code_1c", "child_count", "photo_load_status", "supervisor_drfo", "manager_drfo", "supervisor_team", "manager_team", "173", "172", "171", "170", "169", "168", "167", "166", "165", "164", "162", "163", "161", "160", "89", "158", "159", "157", "156", "155", "154", "153", "150", "152", "151", "148", "147", "145", "146", "144", "143", "142", "141", "140", "139", "138", "137", "135", "136", "134", "133", "132", "131", "130", "129", "128", "127", "5", "121", "126", "125", "124", "123", "122", "101", "120", "118", "117", "116", "115", "114", "113", "112", "111", "110", "109", "108", "107", "106", "105", "104", "103", "102", "100", "99", "98", "97", "96", "95", "94", "92", "91", "90", "88", "87", "86", "85", "84", "83", "82", "81", "80", "79", "78", "77", "76", "74", "75", "73", "72", "71", "70", "69", "68", "67", "66", "65", "64", "63", "61", "60", "59", "58", "57", "56", "55", "54", "53", "52", "51", "50", "49", "48", "47", "46", "45", "44", "43", "42", "41", "39", "40", "38", "37", "36", "35", "34", "33", "32", "31", "30", "29", "28", "27", "26", "25", "24", "23", "22", "21", "20", "18", "14", "19", "17", "16", "15", "13", "12", "11", "10", "9", "7", "8", "1", "6", "2", "3", "4", "62", "93", "149"]',
                                'conditions' => '{"type_id": ["1", "2", "3", "5", "6", "4", "10", "9", "8", "7", "11", "12", "13", "14", "15"], "team_direction": ["1", "2", "3", "4", "6", "5"]}',
                                'type' => 1
                            ]
                        ]
                    )
                ],
            ]
        ]
    ],

    'case4' => [
        'setting' => [
            'description' => 'Создание сводного отчёта с несколькими полями, типами и направлениями',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case4.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                        2 => '7',
                        3 => '13',
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '6',
                    ],
                ],
                'type' => 1,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => NULL,
                    'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                    'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '4',
                            2 => '7',
                            3 => '13',
                        ],
                        'team_direction' => [
                            0 => '2',
                            1 => '4',
                            2 => '6',
                        ],
                    ],
                    'type' => '1',
                    'selectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        2 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        3 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        4 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        5 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        6 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        7 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        8 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        9 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        10 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        11 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        12 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        13 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        14 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        15 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        16 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        17 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        18 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        19 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        20 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        21 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        22 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        23 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        24 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        25 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        26 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        27 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        28 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        29 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        30 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                    ],
                    'unSelectedFields' => [
                        0 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        1 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        2 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        3 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        4 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        5 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        6 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        7 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        8 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        9 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        10 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        11 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        12 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        13 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        14 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        15 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        16 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        17 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        18 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        19 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        20 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        21 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        22 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        23 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        24 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        25 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        26 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        27 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        28 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        29 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        30 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        31 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        32 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        33 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        34 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        35 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        36 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        37 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        38 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        39 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        40 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        41 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        42 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        43 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        44 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        45 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        46 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        47 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        48 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        49 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        50 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        51 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        52 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        53 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        54 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        55 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        56 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        57 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        58 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        59 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        60 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        61 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        62 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        63 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        64 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        65 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        66 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        67 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        68 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        69 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        70 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        71 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        72 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        73 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        74 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        75 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        76 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        77 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        78 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        79 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        80 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        81 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        82 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        83 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        84 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        85 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        86 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        87 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        88 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        89 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        90 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        91 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        92 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        93 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        94 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        95 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        96 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        97 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        98 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        99 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        100 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        101 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        102 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        103 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        104 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        105 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        106 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        107 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        108 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        109 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        110 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        111 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        112 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        113 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        114 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        115 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        116 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        117 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        118 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        119 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        120 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        121 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        122 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        123 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        124 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        125 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        126 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        127 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        128 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        129 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        130 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        131 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        132 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        133 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                        134 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        135 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        136 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        137 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        138 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        139 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        140 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        141 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        142 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        143 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        144 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        145 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        146 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        147 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        148 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        149 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        150 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        151 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        152 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        153 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        154 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        155 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        156 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        157 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        158 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        159 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        160 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        161 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        162 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        163 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        164 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        165 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        166 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        167 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        168 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        169 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        170 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        171 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        172 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        173 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        174 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        175 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        176 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        177 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        178 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        179 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        180 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        181 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => array_merge_recursive(
                        (include __DIR__ . '/fixture/case4.php')['lisa_fixtures']['reports'],
                        [
                            [
                                'id' => 4,
                                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                                'conditions' => '{"type_id": ["1", "4", "7", "13"], "team_direction": ["2", "4", "6"]}',
                                'type' => 1
                            ]
                        ]
                    )
                ],
            ]
        ]
    ],

    'case5' => [
        'setting' => [
            'description' => 'Создание копии детального отчёта с изменением набора полей, типов и направлений',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (копия)',
                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '6',
                        3 => '3',
                        4 => '5',
                    ],
                ],
                'type' => 0,
                'selectedFields' => [
                    0 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    1 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    2 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    3 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    8 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    13 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    14 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    15 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    16 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    17 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    20 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    22 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    23 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    2 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    3 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    4 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    5 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    6 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    7 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                    8 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    9 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    10 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    11 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    12 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    13 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    14 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    15 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    16 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    17 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    18 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    19 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    20 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    21 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    22 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    23 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    24 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    25 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    26 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    27 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    28 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    29 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    30 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    31 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    32 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    33 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    34 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    35 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    36 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    37 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    38 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    39 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    40 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    41 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    42 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    43 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    44 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    45 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    46 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    47 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    48 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    49 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    50 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    51 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    52 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    53 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    54 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    55 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    56 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    57 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    58 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    59 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    60 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    61 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    62 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    63 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    64 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    65 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    66 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    67 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    68 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    69 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    70 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    71 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    72 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    73 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    74 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    75 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    76 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    77 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    78 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    79 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    80 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    81 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    82 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    83 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    84 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    85 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    86 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    87 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    88 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    89 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    90 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    91 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    92 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    93 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    94 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    95 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    96 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    97 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    98 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    99 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    100 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    101 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    102 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    103 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    104 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    105 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    106 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    107 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    108 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    109 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    110 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    111 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    112 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    113 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    114 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    115 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    116 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    131 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    133 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    144 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    145 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    146 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    147 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    148 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    149 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    150 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    151 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    152 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    153 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    154 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    155 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    156 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    157 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    158 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    159 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    160 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    161 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    162 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    163 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    164 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    165 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    166 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    167 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    168 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    169 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    170 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    171 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    172 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    173 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    174 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    175 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    176 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    177 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    178 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    179 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    180 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    181 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    182 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    183 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => NULL,
                    'title' => 'http://gomer.local/lisa/#/report/create?mode=create (копия)',
                    'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '4',
                        ],
                        'team_direction' => [
                            0 => '2',
                            1 => '4',
                            2 => '6',
                            3 => '3',
                            4 => '5',
                        ],
                    ],
                    'type' => 0,
                    'selectedFields' => [
                        0 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        1 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        2 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        3 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        4 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        5 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        6 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        7 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        8 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        9 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        10 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        11 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        12 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        13 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        14 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        15 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        16 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        17 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        18 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        19 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        20 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        21 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        22 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        23 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        24 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        25 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        26 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        27 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        28 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                    ],
                    'unSelectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        2 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        3 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        4 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        5 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        6 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        7 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                        8 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        9 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        10 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        11 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        12 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        13 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        14 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        15 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        16 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        17 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        18 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        19 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        20 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        21 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        22 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        23 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        24 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        25 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        26 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        27 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        28 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        29 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        30 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        31 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        32 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        33 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        34 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        35 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        36 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        37 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        38 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        39 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        40 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        41 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        42 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        43 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        44 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        45 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        46 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        47 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        48 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        49 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        50 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        51 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        52 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        53 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        54 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        55 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        56 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        57 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        58 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        59 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        60 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        61 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        62 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        63 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        64 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        65 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        66 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        67 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        68 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        69 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        70 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        71 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        72 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        73 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        74 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        75 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        76 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        77 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        78 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        79 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        80 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        81 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        82 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        83 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        84 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        85 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        86 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        87 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        88 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        89 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        90 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        91 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        92 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        93 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        94 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        95 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        96 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        97 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        98 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        99 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        100 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        101 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        102 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        103 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        104 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        105 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        106 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        107 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        108 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        109 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        110 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        111 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        112 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        113 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        114 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        115 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        116 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        117 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        118 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        119 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        120 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        121 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        122 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        123 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        124 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        125 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        126 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        127 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        128 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        129 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        130 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        131 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        132 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        133 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        134 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        135 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                        136 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        137 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        138 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        139 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        140 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        141 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        142 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        143 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        144 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        145 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        146 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        147 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        148 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        149 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        150 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        151 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        152 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        153 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        154 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        155 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        156 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        157 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        158 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        159 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        160 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        161 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        162 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        163 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        164 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        165 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        166 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        167 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        168 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        169 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        170 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        171 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        172 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        173 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        174 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        175 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        176 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        177 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        178 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        179 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        180 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        181 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        182 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        183 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => array_merge_recursive(
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'],
                        [
                            [
                                'id' => 5,
                                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (копия)',
                                'fields' => '["author_id", "supervisor_id", "type_id", "22", "status", "previous_status", "category_id", "34", "seller_id", "actual_finish_date", "89", "report_period_id", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "58", "146", "5", "131", "128", "64", "53", "50", "49", "47", "33", "21"]',
                                'conditions' => '{"type_id": ["1", "4"], "team_direction": ["2", "4", "6", "3", "5"]}',
                                'type' => 0
                            ]
                        ]
                    )
                ]
            ]
        ]
    ],

    'case6' => [
        'setting' => [
            'description' => 'Создание копии сводного отчёта с изменением набора полей, типов и направлений',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный) (копия)',
                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                'conditions' => [
                    'type_id' => [
                        0 => '15',
                    ],
                    'team_direction' => [
                        0 => '1',
                    ],
                ],
                'type' => 1,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    2 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    3 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    4 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    5 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    6 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    7 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    8 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    9 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    10 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    11 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    12 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    13 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    14 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    15 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    16 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    17 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    18 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    19 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    20 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    21 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    22 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    23 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    24 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    25 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    26 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    27 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    28 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    29 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    30 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    8 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    9 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                    10 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    11 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    12 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    13 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    14 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    15 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    16 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    17 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    18 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    19 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    20 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    21 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    22 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    23 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    24 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    25 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    26 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    27 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    28 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    29 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    30 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    31 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    32 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    33 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    34 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    35 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    36 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    37 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    38 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    39 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    40 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    41 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    42 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    43 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    44 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    45 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    46 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    47 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    48 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    49 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    50 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    51 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    52 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    53 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    54 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    55 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    56 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    57 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    58 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    59 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    60 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    61 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    62 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    63 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    64 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    65 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    66 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    67 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    68 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    69 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    70 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    71 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    72 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    73 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    74 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    75 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    76 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    77 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    78 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    79 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    80 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    81 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    82 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    83 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    84 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    85 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    86 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    87 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    88 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    89 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    90 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    91 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    92 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    93 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    94 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    95 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    96 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    97 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    98 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    99 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    100 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    101 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    102 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    103 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    104 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    105 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    106 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    107 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    108 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    109 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    110 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    111 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    112 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    113 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    114 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    115 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    116 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    117 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    118 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    131 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    135 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    144 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    145 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    146 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    147 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    148 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    149 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    150 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    151 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    152 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    153 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    154 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    155 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    156 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    157 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    158 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    159 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    160 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    161 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    162 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    163 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    164 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    165 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    166 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    167 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    168 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    169 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    170 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    172 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => NULL,
                    'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный) (копия)',
                    'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                    'conditions' => [
                        'type_id' => [
                            0 => '15',
                        ],
                        'team_direction' => [
                            0 => '1',
                        ],
                    ],
                    'type' => '1',
                    'selectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        2 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        3 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        4 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        5 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        6 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        7 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        8 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        9 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        10 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        11 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        12 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        13 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        14 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        15 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        16 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        17 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        18 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        19 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        20 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        21 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        22 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        23 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        24 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        25 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        26 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        27 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        28 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        29 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        30 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                    ],
                    'unSelectedFields' => [
                        0 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        1 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        2 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        3 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        4 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        5 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        6 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        7 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        8 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        9 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                        10 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        11 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        12 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        13 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        14 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        15 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        16 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        17 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        18 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        19 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        20 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        21 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        22 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        23 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        24 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        25 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        26 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        27 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        28 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        29 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        30 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        31 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        32 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        33 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        34 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        35 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        36 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        37 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        38 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        39 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        40 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        41 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        42 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        43 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        44 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        45 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        46 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        47 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        48 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        49 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        50 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        51 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        52 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        53 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        54 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        55 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        56 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        57 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        58 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        59 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        60 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        61 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        62 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        63 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        64 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        65 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        66 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        67 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        68 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        69 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        70 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        71 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        72 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        73 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        74 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        75 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        76 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        77 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        78 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        79 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        80 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        81 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        82 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        83 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        84 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        85 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        86 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        87 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        88 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        89 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        90 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        91 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        92 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        93 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        94 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        95 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        96 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        97 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        98 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        99 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        100 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        101 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        102 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        103 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        104 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        105 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        106 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        107 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        108 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        109 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        110 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        111 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        112 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        113 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        114 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        115 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        116 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        117 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        118 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        119 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        120 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        121 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        122 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        123 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        124 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        125 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        126 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        127 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        128 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        129 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        130 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        131 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        132 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        133 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        134 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        135 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        136 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        137 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                        138 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        139 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        140 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        141 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        142 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        143 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        144 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        145 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        146 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        147 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        148 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        149 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        150 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        151 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        152 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        153 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        154 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        155 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        156 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        157 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        158 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        159 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        160 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        161 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        162 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        163 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        164 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        165 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        166 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        167 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        168 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        169 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        170 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        171 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        172 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        173 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        174 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        175 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        176 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        177 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        178 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        179 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        180 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        181 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => array_merge_recursive(
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'],
                        [
                            [
                                'id' => 5,
                                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный) (копия)',
                                'fields' => '["id", "168", "reason", "170", "supervisor_comment", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47"]',
                                'conditions' => '{"type_id": ["15"], "team_direction": ["1"]}',
                                'type' => 1
                            ]
                        ]
                    )
                ]
            ]
        ]
    ],

    'case7' => [
        'setting' => [
            'description' => 'Невозможность создания детального отчёта с дублированием названия',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create',
                'fields' => '[]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                        2 => '7',
                        3 => '13',
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '6',
                    ],
                ],
                'type' => 0,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 400,
                'errors' => [
                    'title' => [
                        0 => 'Значение «http://gomer.local/lisa/#/report/create?mode=create» для «Название отчета» уже занято.',
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'],
                ],
            ]
        ]
    ],

    'case8' => [
        'setting' => [
            'description' => 'Невозможность создания сводного отчёта с дублированием названия',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                        2 => '7',
                        3 => '13',
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '6',
                    ],
                ],
                'type' => 1,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 400,
                'errors' => [
                    'title' => [
                        0 => 'Значение «http://gomer.local/lisa/#/report/create?mode=create (сводный)» для «Название отчета» уже занято.',
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'],
                ],
            ]
        ]
    ],
    
    'case9' => [
        'setting' => [
            'description' => 'Невозможность создания детального отчёта без типов',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create',
                'fields' => '[]',
                'conditions' => [
                    'type_id' => [
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '6',
                    ],
                ],
                'type' => 0,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 400,
                'errors' => [
                    'type_id' => 'Не выбрано ни одного типа заявок!',
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'],
                ],
            ]
        ]
    ],

    'case10' => [
        'setting' => [
            'description' => 'Невозможность создания сводного отчёта без направления и имени',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => NULL,
                'title' => '',
                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                        2 => '7',
                        3 => '13',
                    ],
                    'team_direction' => [
                    ],
                ],
                'type' => 1,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 400,
                'errors' => [
                    'title' => 'Необходимо заполнить название отчета!',
                    'team_direction' => 'Не выбрано ни одного направления команды!',
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'],
                ],
            ]
        ]
    ],

    'case11' => [
        'setting' => [
            'description' => 'Изменение только полей в шаблоне детального отчёта',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => 1,
                'title' => 'Всё во всём',
                'fields' => '["id", "17", "3", "manager_drfo", "supervisor_process_date", "subject", "category_id", "amount_to_work", "98", "cross_check_manager_id", "cross_check_status", "direction", "125", "sv_report_periods", "46", "130", "reason", "157", "status", "supervisor_id", "type_id", "actual_finish_date"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '2',
                        2 => '3',
                        3 => '4',
                        4 => '5',
                        5 => '6',
                        6 => '7',
                        7 => '8',
                        8 => '9',
                        9 => '10',
                        10 => '11',
                        11 => '12',
                        12 => '13',
                        13 => '14',
                        14 => '15',
                    ],
                    'team_direction' => [
                        0 => '1',
                        1 => '2',
                        2 => '3',
                        3 => '4',
                        4 => '5',
                        5 => '6',
                    ],
                ],
                'type' => 0,
                'selectedFields' => [
                    0 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                    1 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    2 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    3 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    4 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    5 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    6 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    7 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    8 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    9 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    10 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    11 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    14 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    15 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    16 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    17 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    18 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    1 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    2 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    3 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    4 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    5 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    6 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    7 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    8 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    9 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    10 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    11 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    12 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    13 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    14 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    15 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    16 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    17 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    18 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    19 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    20 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    21 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    22 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    23 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    24 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    25 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    26 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    27 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    28 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    29 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    30 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    31 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    32 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    33 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    34 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    35 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    36 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    37 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    38 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    39 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    40 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    41 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    42 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    43 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    44 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    45 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    46 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    47 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    48 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    49 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    50 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    51 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    52 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    53 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    54 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    55 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    56 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    57 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    58 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    59 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    60 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    61 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    62 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    63 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    64 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    65 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    66 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    67 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    68 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    69 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    70 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    71 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    72 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    73 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    74 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    75 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    76 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    77 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    78 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    79 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    80 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    81 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    82 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    83 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    84 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    85 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    86 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    87 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    88 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    89 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    90 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    91 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    92 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    93 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    94 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    95 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    96 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    97 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    98 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    99 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    100 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    101 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    102 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    103 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    104 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    105 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    106 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    107 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    108 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    109 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    110 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    111 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    112 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    113 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    114 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    115 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    116 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    117 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    118 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    119 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    120 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    121 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    131 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    140 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    144 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    145 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    146 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    147 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    148 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    149 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    150 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    151 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    152 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    153 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    154 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    156 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    157 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    158 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    159 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    160 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    161 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    162 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    163 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    164 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    165 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    166 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    167 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    168 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    169 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    170 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    171 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    172 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    173 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    174 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    175 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    176 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    177 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    178 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    179 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    180 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    181 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    182 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    183 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    184 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    185 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    186 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    187 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    188 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    189 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                    190 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    191 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    192 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => '1',
                    'title' => 'Всё во всём',
                    'fields' => '["id", "17", "3", "manager_drfo", "supervisor_process_date", "subject", "category_id", "amount_to_work", "98", "cross_check_manager_id", "cross_check_status", "direction", "125", "sv_report_periods", "46", "130", "reason", "157", "status", "supervisor_id", "type_id", "actual_finish_date"]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '2',
                            2 => '3',
                            3 => '4',
                            4 => '5',
                            5 => '6',
                            6 => '7',
                            7 => '8',
                            8 => '9',
                            9 => '10',
                            10 => '11',
                            11 => '12',
                            12 => '13',
                            13 => '14',
                            14 => '15',
                        ],
                        'team_direction' => [
                            0 => '1',
                            1 => '2',
                            2 => '3',
                            3 => '4',
                            4 => '5',
                            5 => '6',
                        ],
                    ],
                    'type' => 0,
                    'selectedFields' => [
                        0 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                        1 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        2 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        3 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        4 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        5 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        6 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        7 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        8 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        9 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        10 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        11 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        12 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        13 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        14 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        15 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        16 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        17 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        18 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        19 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                    ],
                    'unSelectedFields' => [
                        0 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        1 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        2 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        3 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        4 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        5 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        6 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        7 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        8 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        9 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        10 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        11 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        12 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        13 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        14 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        15 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        16 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        17 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        18 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        19 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        20 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        21 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        22 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        23 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        24 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        25 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        26 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        27 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        28 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        29 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        30 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        31 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        32 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        33 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        34 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        35 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        36 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        37 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        38 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        39 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        40 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        41 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        42 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        43 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        44 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        45 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        46 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        47 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        48 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        49 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        50 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        51 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        52 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        53 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        54 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        55 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        56 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        57 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        58 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        59 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        60 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        61 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        62 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        63 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        64 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        65 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        66 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        67 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        68 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        69 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        70 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        71 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        72 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        73 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        74 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        75 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        76 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        77 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        78 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        79 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        80 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        81 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        82 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        83 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        84 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        85 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        86 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        87 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        88 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        89 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        90 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        91 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        92 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        93 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        94 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        95 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        96 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        97 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        98 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        99 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        100 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        101 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        102 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        103 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        104 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        105 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        106 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        107 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        108 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        109 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        110 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        111 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        112 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        113 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        114 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        115 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        116 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        117 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        118 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        119 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        120 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        121 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        122 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        123 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        124 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        125 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        126 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        127 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        128 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        129 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        130 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        131 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        132 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        133 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        134 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        135 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        136 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        137 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        138 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        139 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        140 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        141 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        142 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                        143 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        144 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        145 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        146 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        147 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        148 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        149 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        150 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        151 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        152 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        153 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        154 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        155 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        156 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        157 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        158 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        159 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        160 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        161 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        162 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        163 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        164 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        165 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        166 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        167 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        168 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        169 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        170 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        171 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        172 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        173 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        174 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        175 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        176 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        177 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        178 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        179 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        180 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        181 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        182 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        183 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        184 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        185 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        186 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        187 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        188 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        189 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                        190 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        191 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        192 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => [
                        [
                            'id' => 1,
                            'title' => 'Всё во всём',
                            'fields' => '["1", "2", "manager_drfo", "supervisor_process_date", "subject", "category_id", "amount_to_work", "98", "cross_check_manager_id", "cross_check_status", "direction", "125", "sv_report_periods", "69", "72", "46", "130", "reason", "157", "status"]',
                            'conditions' => '{"type_id": ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], "team_direction": ["1", "2", "3", "4", "5", "6"]}',
                            'type' => 0
                        ],
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][1],
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][2],
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][3],
                    ],
                ],
            ]
        ]
    ],

    'case12' => [
        'setting' => [
            'description' => 'Изменение типов и направлений в шаблоне сводного отчёта',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => 4,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                        2 => '12',
                        3 => '8',
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '3',
                    ],
                ],
                'type' => 1,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => '4',
                    'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                    'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '4',
                            2 => '12',
                            3 => '8',
                        ],
                        'team_direction' => [
                            0 => '2',
                            1 => '4',
                            2 => '3',
                        ],
                    ],
                    'type' => '1',
                    'selectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        2 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        3 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        4 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        5 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        6 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        7 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        8 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        9 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        10 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        11 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        12 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        13 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        14 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        15 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        16 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        17 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        18 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        19 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        20 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        21 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        22 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        23 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        24 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        25 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        26 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        27 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        28 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        29 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        30 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                    ],
                    'unSelectedFields' => [
                        0 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        1 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        2 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        3 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        4 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        5 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        6 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        7 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        8 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        9 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        10 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        11 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        12 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        13 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        14 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        15 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        16 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        17 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        18 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        19 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        20 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        21 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        22 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        23 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        24 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        25 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        26 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        27 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        28 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        29 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        30 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        31 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        32 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        33 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        34 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        35 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        36 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        37 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        38 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        39 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        40 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        41 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        42 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        43 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        44 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        45 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        46 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        47 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        48 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        49 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        50 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        51 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        52 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        53 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        54 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        55 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        56 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        57 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        58 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        59 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        60 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        61 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        62 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        63 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        64 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        65 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        66 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        67 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        68 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        69 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        70 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        71 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        72 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        73 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        74 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        75 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        76 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        77 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        78 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        79 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        80 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        81 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        82 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        83 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        84 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        85 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        86 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        87 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        88 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        89 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        90 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        91 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        92 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        93 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        94 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        95 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        96 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        97 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        98 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        99 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        100 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        101 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        102 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        103 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        104 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        105 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        106 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        107 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        108 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        109 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        110 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        111 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        112 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        113 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        114 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        115 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        116 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        117 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        118 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        119 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        120 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        121 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        122 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        123 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        124 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        125 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        126 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        127 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        128 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        129 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        130 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        131 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        132 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        133 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                        134 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        135 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        136 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        137 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        138 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        139 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        140 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        141 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        142 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        143 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        144 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        145 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        146 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        147 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        148 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        149 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        150 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        151 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        152 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        153 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        154 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        155 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        156 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        157 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        158 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        159 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        160 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        161 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        162 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        163 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        164 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        165 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        166 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        167 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        168 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        169 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        170 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        171 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        172 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        173 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        174 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        175 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        176 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        177 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        178 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        179 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        180 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        181 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => [
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][0],
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][1],
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][2],
                        [
                            'id' => 4,
                            'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                            'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                            'conditions' => '{"type_id": ["1", "4", "12", "8"], "team_direction": ["2", "4", "3"]}',
                            'type' => 1
                        ],
                    ],
                ],
            ]
        ]
    ],

    'case13' => [
        'setting' => [
            'description' => 'Изменение типов, направлений, полей и названия в шаблоне детального отчёта',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case5.php',
        'provider_data' => [
            'requestBody' => [
                'id' => 4,
                'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                'conditions' => [
                    'type_id' => [
                        0 => '1',
                        1 => '4',
                        2 => '12',
                        3 => '8',
                    ],
                    'team_direction' => [
                        0 => '2',
                        1 => '4',
                        2 => '3',
                    ],
                ],
                'type' => 1,
                'selectedFields' => [
                    0 => [
                        'column' => 'id',
                        'label' => 'Номер задачи',
                    ],
                    1 => [
                        'column' => 'author_id',
                        'label' => 'Автор',
                    ],
                    2 => [
                        'column' => 'supervisor_id',
                        'label' => 'Супервайзер',
                    ],
                    3 => [
                        'column' => 'type_id',
                        'label' => 'Тип',
                    ],
                    4 => [
                        'column' => 'status',
                        'label' => 'Статус',
                    ],
                    5 => [
                        'column' => 'previous_status',
                        'label' => 'Предыдущий статус',
                    ],
                    6 => [
                        'column' => 'category_id',
                        'label' => 'Категория товаров',
                    ],
                    7 => [
                        'column' => 'seller_id',
                        'label' => 'Продавец',
                    ],
                    8 => [
                        'column' => 'actual_start_date',
                        'label' => 'Фактическая дата начала работ',
                    ],
                    9 => [
                        'column' => 'actual_finish_date',
                        'label' => 'Фактическая дата завершения',
                    ],
                    10 => [
                        'column' => 89,
                        'label' => 'Фактические затраты КМ, мин',
                    ],
                    11 => [
                        'column' => 'report_period_id',
                        'label' => 'Отчетный период КМ',
                    ],
                    12 => [
                        'column' => 'sv_report_periods',
                        'label' => 'Отчетные периоды СВ',
                    ],
                    13 => [
                        'column' => 'manager_drfo',
                        'label' => 'ДРФО исполнителя',
                    ],
                    14 => [
                        'column' => 'manager_team',
                        'label' => 'Команда исполнителя',
                    ],
                    15 => [
                        'column' => 'supervisor_drfo',
                        'label' => 'ДРФО супервайзера',
                    ],
                    16 => [
                        'column' => 'supervisor_team',
                        'label' => 'Команда супервайзера',
                    ],
                    17 => [
                        'column' => 160,
                        'label' => 'Укр. поля',
                    ],
                    18 => [
                        'column' => 146,
                        'label' => 'Общее количество ошибок (Кросс-чек)',
                    ],
                    19 => [
                        'column' => 131,
                        'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                    ],
                    20 => [
                        'column' => 128,
                        'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                    ],
                    21 => [
                        'column' => 64,
                        'label' => 'Общее рассчитанное количество показателей',
                    ],
                    22 => [
                        'column' => 53,
                        'label' => 'Коэффициент типа задачи',
                    ],
                    23 => [
                        'column' => 52,
                        'label' => 'Коэффициент сложности категории',
                    ],
                    24 => [
                        'column' => 50,
                        'label' => 'Рассчитанное количество измененных товаров',
                    ],
                    25 => [
                        'column' => 49,
                        'label' => 'Рассчитанное количество добавленных товаров',
                    ],
                    26 => [
                        'column' => 47,
                        'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                    ],
                    27 => [
                        'column' => 33,
                        'label' => 'Ошибки в оформлении товаров',
                    ],
                    28 => [
                        'column' => 21,
                        'label' => 'Наличие характеристик к товарам',
                    ],
                    29 => [
                        'column' => 20,
                        'label' => 'Уровень сложности задачи',
                    ],
                    30 => [
                        'column' => 1,
                        'label' => 'Ручная загрузка',
                    ],
                ],
                'unSelectedFields' => [
                    0 => [
                        'column' => 2,
                        'label' => 'Пакетная загрузка',
                    ],
                    1 => [
                        'column' => 3,
                        'label' => 'Виза супервайзера',
                    ],
                    2 => [
                        'column' => 4,
                        'label' => 'С фотосъемкой',
                    ],
                    3 => [
                        'column' => 6,
                        'label' => 'Точки входа',
                    ],
                    4 => [
                        'column' => 7,
                        'label' => 'Добавление графики',
                    ],
                    5 => [
                        'column' => 8,
                        'label' => 'С размерной сеткой',
                    ],
                    6 => [
                        'column' => 9,
                        'label' => 'С тегами к товарам',
                    ],
                    7 => [
                        'column' => 10,
                        'label' => 'Уценка',
                    ],
                    8 => [
                        'column' => 11,
                        'label' => 'Уценка 2',
                    ],
                    9 => [
                        'column' => 12,
                        'label' => 'На основе отзыва клиента на сайте',
                    ],
                    10 => [
                        'column' => 13,
                        'label' => 'Жалоба на товар продавца маркета',
                    ],
                    11 => [
                        'column' => 14,
                        'label' => 'Промо-описание',
                    ],
                    12 => [
                        'column' => 15,
                        'label' => 'С видео',
                    ],
                    13 => [
                        'column' => 16,
                        'label' => 'Лоты',
                    ],
                    14 => [
                        'column' => 17,
                        'label' => 'БУ, REF',
                    ],
                    15 => [
                        'column' => 18,
                        'label' => 'Добавление товаров в новую категорию',
                    ],
                    16 => [
                        'column' => 19,
                        'label' => 'С палитрой',
                    ],
                    17 => [
                        'column' => 22,
                        'label' => 'Наличие фото к товарам',
                    ],
                    18 => [
                        'column' => 23,
                        'label' => 'Наличие описаний к товарам',
                    ],
                    19 => [
                        'column' => 24,
                        'label' => 'Обработка фото',
                    ],
                    20 => [
                        'column' => 25,
                        'label' => 'Уточнения. Количество уточнений у автора.',
                    ],
                    21 => [
                        'column' => 26,
                        'label' => 'Язык информации',
                    ],
                    22 => [
                        'column' => 27,
                        'label' => 'Видео к товарам',
                    ],
                    23 => [
                        'column' => 28,
                        'label' => 'Перенос информации при изменении структуры категории',
                    ],
                    24 => [
                        'column' => 29,
                        'label' => 'Вид структуры',
                    ],
                    25 => [
                        'column' => 30,
                        'label' => 'Сложность структуры',
                    ],
                    26 => [
                        'column' => 31,
                        'label' => 'Группировка товаров (наличие варьируемых параметров)',
                    ],
                    27 => [
                        'column' => 32,
                        'label' => 'Сложность группировки в заявках',
                    ],
                    28 => [
                        'column' => 34,
                        'label' => 'Ошибки в общих характеристиках товаров',
                    ],
                    29 => [
                        'column' => 35,
                        'label' => 'Ошибки в характеристиках и описаниях товаров',
                    ],
                    30 => [
                        'column' => 36,
                        'label' => 'Ошибки в группировке товаров',
                    ],
                    31 => [
                        'column' => 37,
                        'label' => 'Ошибки в размещении товаров',
                    ],
                    32 => [
                        'column' => 38,
                        'label' => 'Ошибки в особых правилах',
                    ],
                    33 => [
                        'column' => 39,
                        'label' => 'Ошибки в стоп-брендах',
                    ],
                    34 => [
                        'column' => 40,
                        'label' => 'Ошибки в редиректах',
                    ],
                    35 => [
                        'column' => 41,
                        'label' => 'Ошибки в структурах категорий',
                    ],
                    36 => [
                        'column' => 42,
                        'label' => 'Ошибки в портальных страницах',
                    ],
                    37 => [
                        'column' => 43,
                        'label' => 'Ошибки в размерных сетках',
                    ],
                    38 => [
                        'column' => 44,
                        'label' => 'Ошибки в тегах',
                    ],
                    39 => [
                        'column' => 45,
                        'label' => 'Ошибки в значениях параметров и в производителях',
                    ],
                    40 => [
                        'column' => 46,
                        'label' => 'Ошибки в видео к товарам',
                    ],
                    41 => [
                        'column' => 48,
                        'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                    ],
                    42 => [
                        'column' => 51,
                        'label' => 'Рассчитанное количество проверенных товаров',
                    ],
                    43 => [
                        'column' => 54,
                        'label' => 'Коэффициент уровня сложности задачи',
                    ],
                    44 => [
                        'column' => 55,
                        'label' => 'Рассчитанное количество выполненных работ',
                    ],
                    45 => [
                        'column' => 56,
                        'label' => 'Рассчитанное количество добавленных видео',
                    ],
                    46 => [
                        'column' => 57,
                        'label' => 'Рассчитанное количество добавленных размерных сеток',
                    ],
                    47 => [
                        'column' => 58,
                        'label' => 'Рассчитанное количество добавленных тегов',
                    ],
                    48 => [
                        'column' => 59,
                        'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                    ],
                    49 => [
                        'column' => 60,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                    ],
                    50 => [
                        'column' => 61,
                        'label' => 'Рассчитанное количество сгруппированных товаров',
                    ],
                    51 => [
                        'column' => 62,
                        'label' => 'Время на конвертацию видео в формат mp4, мин',
                    ],
                    52 => [
                        'column' => 63,
                        'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                    ],
                    53 => [
                        'column' => 65,
                        'label' => 'Количество проверенных товаров',
                    ],
                    54 => [
                        'column' => 66,
                        'label' => 'Количество добавленных товаров',
                    ],
                    55 => [
                        'column' => 67,
                        'label' => 'Количество изменённых товаров',
                    ],
                    56 => [
                        'column' => 68,
                        'label' => 'Среднее количество фото в товаре',
                    ],
                    57 => [
                        'column' => 69,
                        'label' => 'Общее количество обработанных фото',
                    ],
                    58 => [
                        'column' => 70,
                        'label' => 'Количество добавленных видеороликов',
                    ],
                    59 => [
                        'column' => 71,
                        'label' => 'Количество добавленных инструкций',
                    ],
                    60 => [
                        'column' => 72,
                        'label' => 'Количество скрытых товаров',
                    ],
                    61 => [
                        'column' => 73,
                        'label' => 'Количество связанных категорий',
                    ],
                    62 => [
                        'column' => 74,
                        'label' => 'Количество связанных параметров',
                    ],
                    63 => [
                        'column' => 75,
                        'label' => 'Количество связанных значений параметров',
                    ],
                    64 => [
                        'column' => 76,
                        'label' => 'Добавлено новых СЦ',
                    ],
                    65 => [
                        'column' => 77,
                        'label' => 'Изменено существующих СЦ',
                    ],
                    66 => [
                        'column' => 78,
                        'label' => 'Номер задачи 1С',
                    ],
                    67 => [
                        'column' => 79,
                        'label' => 'Количество добавленных/заблокированных параметров',
                    ],
                    68 => [
                        'column' => 80,
                        'label' => 'Количество добавленных значений к параметрам',
                    ],
                    69 => [
                        'column' => 81,
                        'label' => 'Количество добавленных иконок на портальную страницу',
                    ],
                    70 => [
                        'column' => 82,
                        'label' => 'Количество добавленных размерных сеток',
                    ],
                    71 => [
                        'column' => 83,
                        'label' => 'Количество добавленных тегов',
                    ],
                    72 => [
                        'column' => 84,
                        'label' => 'Количество настроенных редиректов',
                    ],
                    73 => [
                        'column' => 85,
                        'label' => 'Отправлено файлов продакту на заполнение',
                    ],
                    74 => [
                        'column' => 86,
                        'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                    ],
                    75 => [
                        'column' => 87,
                        'label' => 'Количество отредактированных видео',
                    ],
                    76 => [
                        'column' => 88,
                        'label' => 'Количество товаров, к которым добавлены видео',
                    ],
                    77 => [
                        'column' => 90,
                        'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                    ],
                    78 => [
                        'column' => 91,
                        'label' => 'Количество обработанных категорий',
                    ],
                    79 => [
                        'column' => 92,
                        'label' => 'Количество созданных связей для тегов',
                    ],
                    80 => [
                        'column' => 94,
                        'label' => 'Количество сгруппированых товаров',
                    ],
                    81 => [
                        'column' => 95,
                        'label' => 'Количество групп с ошибками',
                    ],
                    82 => [
                        'column' => 96,
                        'label' => 'Количество значений параметров/производителей с ошибками',
                    ],
                    83 => [
                        'column' => 97,
                        'label' => 'Количество измененных товаров (Splitter)',
                    ],
                    84 => [
                        'column' => 98,
                        'label' => 'Количество измененных товаров (пакетно в Owox)',
                    ],
                    85 => [
                        'column' => 99,
                        'label' => 'Количество измененных товаров (поштучно в Owox)',
                    ],
                    86 => [
                        'column' => 100,
                        'label' => 'Количество измененных/замененных видеороликов',
                    ],
                    87 => [
                        'column' => 102,
                        'label' => 'Количество проверенных видео',
                    ],
                    88 => [
                        'column' => 103,
                        'label' => 'Количество проверенных групп',
                    ],
                    89 => [
                        'column' => 104,
                        'label' => 'Количество проверенных значений параметров',
                    ],
                    90 => [
                        'column' => 105,
                        'label' => 'Количество проверенных категорий',
                    ],
                    91 => [
                        'column' => 106,
                        'label' => 'Количество проверенных параметров',
                    ],
                    92 => [
                        'column' => 107,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                    ],
                    93 => [
                        'column' => 108,
                        'label' => 'Количество проверенных размерных сеток',
                    ],
                    94 => [
                        'column' => 109,
                        'label' => 'Количество проверенных редиректов',
                    ],
                    95 => [
                        'column' => 110,
                        'label' => 'Количество товаров, к которым добавлены теги',
                    ],
                    96 => [
                        'column' => 111,
                        'label' => 'Количество товаров, которые уже есть в БД',
                    ],
                    97 => [
                        'column' => 112,
                        'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                    ],
                    98 => [
                        'column' => 113,
                        'label' => 'Перевязано опций',
                    ],
                    99 => [
                        'column' => 114,
                        'label' => 'Коэффициент группировки',
                    ],
                    100 => [
                        'column' => 115,
                        'label' => 'Количество добавленных категорий',
                    ],
                    101 => [
                        'column' => 116,
                        'label' => 'Количество отправленных писем',
                    ],
                    102 => [
                        'column' => 117,
                        'label' => 'Количество проверенных тегов',
                    ],
                    103 => [
                        'column' => 118,
                        'label' => 'Количество обработанных товаров',
                    ],
                    104 => [
                        'column' => 120,
                        'label' => 'Проверенные размерные сетки (ссылки)',
                    ],
                    105 => [
                        'column' => 101,
                        'label' => 'Общее количество ошибок',
                    ],
                    106 => [
                        'column' => 122,
                        'label' => 'Общее количество товаров с ошибками',
                    ],
                    107 => [
                        'column' => 123,
                        'label' => 'Обновление фото',
                    ],
                    108 => [
                        'column' => 124,
                        'label' => 'Обновление описания',
                    ],
                    109 => [
                        'column' => 125,
                        'label' => 'Обновление характеристик',
                    ],
                    110 => [
                        'column' => 126,
                        'label' => 'Добавление/обновление инструкций',
                    ],
                    111 => [
                        'column' => 121,
                        'label' => 'Проверенные ссылки',
                    ],
                    112 => [
                        'column' => 5,
                        'label' => 'Стоп-бренды',
                    ],
                    113 => [
                        'column' => 127,
                        'label' => 'Автомодерация',
                    ],
                    114 => [
                        'column' => 129,
                        'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                    ],
                    115 => [
                        'column' => 130,
                        'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                    ],
                    116 => [
                        'column' => 132,
                        'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                    ],
                    117 => [
                        'column' => 133,
                        'label' => 'Ошибки в особых правилах (Кросс-чек)',
                    ],
                    118 => [
                        'column' => 134,
                        'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                    ],
                    119 => [
                        'column' => 135,
                        'label' => 'Ошибки в редиректах (Кросс-чек)',
                    ],
                    120 => [
                        'column' => 136,
                        'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                    ],
                    121 => [
                        'column' => 137,
                        'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                    ],
                    122 => [
                        'column' => 138,
                        'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                    ],
                    123 => [
                        'column' => 139,
                        'label' => 'Ошибки в тегах (Кросс-чек)',
                    ],
                    124 => [
                        'column' => 140,
                        'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                    ],
                    125 => [
                        'column' => 141,
                        'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                    ],
                    126 => [
                        'column' => 142,
                        'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                    ],
                    127 => [
                        'column' => 143,
                        'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                    ],
                    128 => [
                        'column' => 144,
                        'label' => 'Количество проверенных товаров (Кросс-чек)',
                    ],
                    129 => [
                        'column' => 145,
                        'label' => 'Количество групп с ошибками (Кросс-чек)',
                    ],
                    130 => [
                        'column' => 93,
                        'label' => 'Количество обработанных групп',
                    ],
                    131 => [
                        'column' => 147,
                        'label' => 'Количество проверенных видео (Кросс-чек)',
                    ],
                    132 => [
                        'column' => 148,
                        'label' => 'Количество проверенных групп (Кросс-чек)',
                    ],
                    133 => [
                        'column' => 149,
                        'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                    ],
                    134 => [
                        'column' => 150,
                        'label' => 'Количество проверенных категорий (Кросс-чек)',
                    ],
                    135 => [
                        'column' => 151,
                        'label' => 'Количество проверенных параметров (Кросс-чек)',
                    ],
                    136 => [
                        'column' => 152,
                        'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                    ],
                    137 => [
                        'column' => 153,
                        'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                    ],
                    138 => [
                        'column' => 154,
                        'label' => 'Количество проверенных редиректов (Кросс-чек)',
                    ],
                    139 => [
                        'column' => 155,
                        'label' => 'Количество проверенных тегов (Кросс-чек)',
                    ],
                    140 => [
                        'column' => 156,
                        'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                    ],
                    141 => [
                        'column' => 157,
                        'label' => 'Проверенные ссылки (Кросс-чек)',
                    ],
                    142 => [
                        'column' => 158,
                        'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                    ],
                    143 => [
                        'column' => 159,
                        'label' => 'По заявке с MobileCourier',
                    ],
                    144 => [
                        'column' => 161,
                        'label' => 'Количество обработанных, но не сгруппированных товаров',
                    ],
                    145 => [
                        'column' => 162,
                        'label' => 'Количество настроек групп (управление группами)',
                    ],
                    146 => [
                        'column' => 163,
                        'label' => 'Количество слов в словарях',
                    ],
                    147 => [
                        'column' => 164,
                        'label' => 'Рассчитанное количество не сгруппированных товаров',
                    ],
                    148 => [
                        'column' => 165,
                        'label' => 'Рассчитанное количество отправленных писем',
                    ],
                    149 => [
                        'column' => 166,
                        'label' => 'Рассчитанное количество созданных подзадач',
                    ],
                    150 => [
                        'column' => 167,
                        'label' => 'Рассчитанное количество слов в словарях',
                    ],
                    151 => [
                        'column' => 168,
                        'label' => 'Среднее количество товаров в группе',
                    ],
                    152 => [
                        'column' => 169,
                        'label' => 'Алгоритм',
                    ],
                    153 => [
                        'column' => 170,
                        'label' => 'Коэффициент среднего количества товаров в группе',
                    ],
                    154 => [
                        'column' => 171,
                        'label' => 'Коэффициент не сгруппированных товаров',
                    ],
                    155 => [
                        'column' => 172,
                        'label' => 'Коэффициент писем/подзадач',
                    ],
                    156 => [
                        'column' => 173,
                        'label' => 'Коэффициент количества слов в словарях',
                    ],
                    157 => [
                        'column' => 'manager_id',
                        'label' => 'Контент-менеджер',
                    ],
                    158 => [
                        'column' => 'awaiting_correction',
                        'label' => 'На исправление',
                    ],
                    159 => [
                        'column' => 'created_at',
                        'label' => 'Дата регистрации задачи в системе',
                    ],
                    160 => [
                        'column' => 'subject',
                        'label' => 'Заголовок',
                    ],
                    161 => [
                        'column' => 'description',
                        'label' => 'Описание',
                    ],
                    162 => [
                        'column' => 'direction',
                        'label' => 'Направление задачи',
                    ],
                    163 => [
                        'column' => 'amount_to_work',
                        'label' => 'Количество в работу',
                    ],
                    164 => [
                        'column' => 'recommendations',
                        'label' => 'Рекомендации',
                    ],
                    165 => [
                        'column' => 'reason',
                        'label' => 'Причина отмены/доработки',
                    ],
                    166 => [
                        'column' => 'parent_id',
                        'label' => 'ID связанной задачи',
                    ],
                    167 => [
                        'column' => 'planned_start_date',
                        'label' => 'Плановая дата начала работ',
                    ],
                    168 => [
                        'column' => 'planned_finish_date',
                        'label' => 'Плановая дата завершения',
                    ],
                    169 => [
                        'column' => 'supervisor_process_date',
                        'label' => 'Дата обработки задачи супервайзером',
                    ],
                    170 => [
                        'column' => 'supervisor_check_date',
                        'label' => 'Дата проверки задачи супервайзером',
                    ],
                    171 => [
                        'column' => 'result_comment',
                        'label' => 'Комментарий к результату задачи',
                    ],
                    172 => [
                        'column' => 'supervisor_comment',
                        'label' => 'Комментарий супервайзера',
                    ],
                    173 => [
                        'column' => 'last_change_status_date',
                        'label' => 'Дата последнего изменения статуса',
                    ],
                    174 => [
                        'column' => 'team_direction',
                        'label' => 'Направление команды',
                    ],
                    175 => [
                        'column' => 'correction_comment',
                        'label' => 'Комментарий на исправление',
                    ],
                    176 => [
                        'column' => 'priority',
                        'label' => 'Приоритет',
                    ],
                    177 => [
                        'column' => 'cross_check_manager_id',
                        'label' => 'Кросс-чек менеджер',
                    ],
                    178 => [
                        'column' => 'cross_check_status',
                        'label' => 'Кросс-чек статус',
                    ],
                    179 => [
                        'column' => 'employee_code_1c',
                        'label' => 'Код работника 1С',
                    ],
                    180 => [
                        'column' => 'child_count',
                        'label' => 'Количество созданных подзадач',
                    ],
                    181 => [
                        'column' => 'photo_load_status',
                        'label' => 'Статус загрузки фото',
                    ],
                ],
            ],
            'responseBody' => [
                'status' => 200,
                'model' => [
                    'id' => '4',
                    'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                    'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                    'conditions' => [
                        'type_id' => [
                            0 => '1',
                            1 => '4',
                            2 => '12',
                            3 => '8',
                        ],
                        'team_direction' => [
                            0 => '2',
                            1 => '4',
                            2 => '3',
                        ],
                    ],
                    'type' => '1',
                    'selectedFields' => [
                        0 => [
                            'column' => 'id',
                            'label' => 'Номер задачи',
                        ],
                        1 => [
                            'column' => 'author_id',
                            'label' => 'Автор',
                        ],
                        2 => [
                            'column' => 'supervisor_id',
                            'label' => 'Супервайзер',
                        ],
                        3 => [
                            'column' => 'type_id',
                            'label' => 'Тип',
                        ],
                        4 => [
                            'column' => 'status',
                            'label' => 'Статус',
                        ],
                        5 => [
                            'column' => 'previous_status',
                            'label' => 'Предыдущий статус',
                        ],
                        6 => [
                            'column' => 'category_id',
                            'label' => 'Категория товаров',
                        ],
                        7 => [
                            'column' => 'seller_id',
                            'label' => 'Продавец',
                        ],
                        8 => [
                            'column' => 'actual_start_date',
                            'label' => 'Фактическая дата начала работ',
                        ],
                        9 => [
                            'column' => 'actual_finish_date',
                            'label' => 'Фактическая дата завершения',
                        ],
                        10 => [
                            'column' => '89',
                            'label' => 'Фактические затраты КМ, мин',
                        ],
                        11 => [
                            'column' => 'report_period_id',
                            'label' => 'Отчетный период КМ',
                        ],
                        12 => [
                            'column' => 'sv_report_periods',
                            'label' => 'Отчетные периоды СВ',
                        ],
                        13 => [
                            'column' => 'manager_drfo',
                            'label' => 'ДРФО исполнителя',
                        ],
                        14 => [
                            'column' => 'manager_team',
                            'label' => 'Команда исполнителя',
                        ],
                        15 => [
                            'column' => 'supervisor_drfo',
                            'label' => 'ДРФО супервайзера',
                        ],
                        16 => [
                            'column' => 'supervisor_team',
                            'label' => 'Команда супервайзера',
                        ],
                        17 => [
                            'column' => '160',
                            'label' => 'Укр. поля',
                        ],
                        18 => [
                            'column' => '146',
                            'label' => 'Общее количество ошибок (Кросс-чек)',
                        ],
                        19 => [
                            'column' => '131',
                            'label' => 'Ошибки в группировке товаров (Кросс-чек)',
                        ],
                        20 => [
                            'column' => '128',
                            'label' => 'Ошибки в оформлении товаров (Кросс-чек)',
                        ],
                        21 => [
                            'column' => '64',
                            'label' => 'Общее рассчитанное количество показателей',
                        ],
                        22 => [
                            'column' => '53',
                            'label' => 'Коэффициент типа задачи',
                        ],
                        23 => [
                            'column' => '52',
                            'label' => 'Коэффициент сложности категории',
                        ],
                        24 => [
                            'column' => '50',
                            'label' => 'Рассчитанное количество измененных товаров',
                        ],
                        25 => [
                            'column' => '49',
                            'label' => 'Рассчитанное количество добавленных товаров',
                        ],
                        26 => [
                            'column' => '47',
                            'label' => 'Суммарная длительность добавленных роликов/ролика, мин',
                        ],
                        27 => [
                            'column' => '33',
                            'label' => 'Ошибки в оформлении товаров',
                        ],
                        28 => [
                            'column' => '21',
                            'label' => 'Наличие характеристик к товарам',
                        ],
                        29 => [
                            'column' => '20',
                            'label' => 'Уровень сложности задачи',
                        ],
                        30 => [
                            'column' => '1',
                            'label' => 'Ручная загрузка',
                        ],
                    ],
                    'unSelectedFields' => [
                        0 => [
                            'column' => '2',
                            'label' => 'Пакетная загрузка',
                        ],
                        1 => [
                            'column' => '3',
                            'label' => 'Виза супервайзера',
                        ],
                        2 => [
                            'column' => '4',
                            'label' => 'С фотосъемкой',
                        ],
                        3 => [
                            'column' => '6',
                            'label' => 'Точки входа',
                        ],
                        4 => [
                            'column' => '7',
                            'label' => 'Добавление графики',
                        ],
                        5 => [
                            'column' => '8',
                            'label' => 'С размерной сеткой',
                        ],
                        6 => [
                            'column' => '9',
                            'label' => 'С тегами к товарам',
                        ],
                        7 => [
                            'column' => '10',
                            'label' => 'Уценка',
                        ],
                        8 => [
                            'column' => '11',
                            'label' => 'Уценка 2',
                        ],
                        9 => [
                            'column' => '12',
                            'label' => 'На основе отзыва клиента на сайте',
                        ],
                        10 => [
                            'column' => '13',
                            'label' => 'Жалоба на товар продавца маркета',
                        ],
                        11 => [
                            'column' => '14',
                            'label' => 'Промо-описание',
                        ],
                        12 => [
                            'column' => '15',
                            'label' => 'С видео',
                        ],
                        13 => [
                            'column' => '16',
                            'label' => 'Лоты',
                        ],
                        14 => [
                            'column' => '17',
                            'label' => 'БУ, REF',
                        ],
                        15 => [
                            'column' => '18',
                            'label' => 'Добавление товаров в новую категорию',
                        ],
                        16 => [
                            'column' => '19',
                            'label' => 'С палитрой',
                        ],
                        17 => [
                            'column' => '22',
                            'label' => 'Наличие фото к товарам',
                        ],
                        18 => [
                            'column' => '23',
                            'label' => 'Наличие описаний к товарам',
                        ],
                        19 => [
                            'column' => '24',
                            'label' => 'Обработка фото',
                        ],
                        20 => [
                            'column' => '25',
                            'label' => 'Уточнения. Количество уточнений у автора.',
                        ],
                        21 => [
                            'column' => '26',
                            'label' => 'Язык информации',
                        ],
                        22 => [
                            'column' => '27',
                            'label' => 'Видео к товарам',
                        ],
                        23 => [
                            'column' => '28',
                            'label' => 'Перенос информации при изменении структуры категории',
                        ],
                        24 => [
                            'column' => '29',
                            'label' => 'Вид структуры',
                        ],
                        25 => [
                            'column' => '30',
                            'label' => 'Сложность структуры',
                        ],
                        26 => [
                            'column' => '31',
                            'label' => 'Группировка товаров (наличие варьируемых параметров)',
                        ],
                        27 => [
                            'column' => '32',
                            'label' => 'Сложность группировки в заявках',
                        ],
                        28 => [
                            'column' => '34',
                            'label' => 'Ошибки в общих характеристиках товаров',
                        ],
                        29 => [
                            'column' => '35',
                            'label' => 'Ошибки в характеристиках и описаниях товаров',
                        ],
                        30 => [
                            'column' => '36',
                            'label' => 'Ошибки в группировке товаров',
                        ],
                        31 => [
                            'column' => '37',
                            'label' => 'Ошибки в размещении товаров',
                        ],
                        32 => [
                            'column' => '38',
                            'label' => 'Ошибки в особых правилах',
                        ],
                        33 => [
                            'column' => '39',
                            'label' => 'Ошибки в стоп-брендах',
                        ],
                        34 => [
                            'column' => '40',
                            'label' => 'Ошибки в редиректах',
                        ],
                        35 => [
                            'column' => '41',
                            'label' => 'Ошибки в структурах категорий',
                        ],
                        36 => [
                            'column' => '42',
                            'label' => 'Ошибки в портальных страницах',
                        ],
                        37 => [
                            'column' => '43',
                            'label' => 'Ошибки в размерных сетках',
                        ],
                        38 => [
                            'column' => '44',
                            'label' => 'Ошибки в тегах',
                        ],
                        39 => [
                            'column' => '45',
                            'label' => 'Ошибки в значениях параметров и в производителях',
                        ],
                        40 => [
                            'column' => '46',
                            'label' => 'Ошибки в видео к товарам',
                        ],
                        41 => [
                            'column' => '48',
                            'label' => 'Суммарная длительность измененных роликов/ролика, мин',
                        ],
                        42 => [
                            'column' => '51',
                            'label' => 'Рассчитанное количество проверенных товаров',
                        ],
                        43 => [
                            'column' => '54',
                            'label' => 'Коэффициент уровня сложности задачи',
                        ],
                        44 => [
                            'column' => '55',
                            'label' => 'Рассчитанное количество выполненных работ',
                        ],
                        45 => [
                            'column' => '56',
                            'label' => 'Рассчитанное количество добавленных видео',
                        ],
                        46 => [
                            'column' => '57',
                            'label' => 'Рассчитанное количество добавленных размерных сеток',
                        ],
                        47 => [
                            'column' => '58',
                            'label' => 'Рассчитанное количество добавленных тегов',
                        ],
                        48 => [
                            'column' => '59',
                            'label' => 'Рассчитанное количество обработанных категорий, параметров и значений параметров',
                        ],
                        49 => [
                            'column' => '60',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками',
                        ],
                        50 => [
                            'column' => '61',
                            'label' => 'Рассчитанное количество сгруппированных товаров',
                        ],
                        51 => [
                            'column' => '62',
                            'label' => 'Время на конвертацию видео в формат mp4, мин',
                        ],
                        52 => [
                            'column' => '63',
                            'label' => 'Количество видео, которые конвертировали в формат mp4, штук',
                        ],
                        53 => [
                            'column' => '65',
                            'label' => 'Количество проверенных товаров',
                        ],
                        54 => [
                            'column' => '66',
                            'label' => 'Количество добавленных товаров',
                        ],
                        55 => [
                            'column' => '67',
                            'label' => 'Количество изменённых товаров',
                        ],
                        56 => [
                            'column' => '68',
                            'label' => 'Среднее количество фото в товаре',
                        ],
                        57 => [
                            'column' => '69',
                            'label' => 'Общее количество обработанных фото',
                        ],
                        58 => [
                            'column' => '70',
                            'label' => 'Количество добавленных видеороликов',
                        ],
                        59 => [
                            'column' => '71',
                            'label' => 'Количество добавленных инструкций',
                        ],
                        60 => [
                            'column' => '72',
                            'label' => 'Количество скрытых товаров',
                        ],
                        61 => [
                            'column' => '73',
                            'label' => 'Количество связанных категорий',
                        ],
                        62 => [
                            'column' => '74',
                            'label' => 'Количество связанных параметров',
                        ],
                        63 => [
                            'column' => '75',
                            'label' => 'Количество связанных значений параметров',
                        ],
                        64 => [
                            'column' => '76',
                            'label' => 'Добавлено новых СЦ',
                        ],
                        65 => [
                            'column' => '77',
                            'label' => 'Изменено существующих СЦ',
                        ],
                        66 => [
                            'column' => '78',
                            'label' => 'Номер задачи 1С',
                        ],
                        67 => [
                            'column' => '79',
                            'label' => 'Количество добавленных/заблокированных параметров',
                        ],
                        68 => [
                            'column' => '80',
                            'label' => 'Количество добавленных значений к параметрам',
                        ],
                        69 => [
                            'column' => '81',
                            'label' => 'Количество добавленных иконок на портальную страницу',
                        ],
                        70 => [
                            'column' => '82',
                            'label' => 'Количество добавленных размерных сеток',
                        ],
                        71 => [
                            'column' => '83',
                            'label' => 'Количество добавленных тегов',
                        ],
                        72 => [
                            'column' => '84',
                            'label' => 'Количество настроенных редиректов',
                        ],
                        73 => [
                            'column' => '85',
                            'label' => 'Отправлено файлов продакту на заполнение',
                        ],
                        74 => [
                            'column' => '86',
                            'label' => 'Редактирование видео и обрезка видеоролика. Рендеринг, мин',
                        ],
                        75 => [
                            'column' => '87',
                            'label' => 'Количество отредактированных видео',
                        ],
                        76 => [
                            'column' => '88',
                            'label' => 'Количество товаров, к которым добавлены видео',
                        ],
                        77 => [
                            'column' => '90',
                            'label' => 'Количество заполненных параметров в товарах при изменении структуры категории',
                        ],
                        78 => [
                            'column' => '91',
                            'label' => 'Количество обработанных категорий',
                        ],
                        79 => [
                            'column' => '92',
                            'label' => 'Количество созданных связей для тегов',
                        ],
                        80 => [
                            'column' => '94',
                            'label' => 'Количество сгруппированых товаров',
                        ],
                        81 => [
                            'column' => '95',
                            'label' => 'Количество групп с ошибками',
                        ],
                        82 => [
                            'column' => '96',
                            'label' => 'Количество значений параметров/производителей с ошибками',
                        ],
                        83 => [
                            'column' => '97',
                            'label' => 'Количество измененных товаров (Splitter)',
                        ],
                        84 => [
                            'column' => '98',
                            'label' => 'Количество измененных товаров (пакетно в Owox)',
                        ],
                        85 => [
                            'column' => '99',
                            'label' => 'Количество измененных товаров (поштучно в Owox)',
                        ],
                        86 => [
                            'column' => '100',
                            'label' => 'Количество измененных/замененных видеороликов',
                        ],
                        87 => [
                            'column' => '102',
                            'label' => 'Количество проверенных видео',
                        ],
                        88 => [
                            'column' => '103',
                            'label' => 'Количество проверенных групп',
                        ],
                        89 => [
                            'column' => '104',
                            'label' => 'Количество проверенных значений параметров',
                        ],
                        90 => [
                            'column' => '105',
                            'label' => 'Количество проверенных категорий',
                        ],
                        91 => [
                            'column' => '106',
                            'label' => 'Количество проверенных параметров',
                        ],
                        92 => [
                            'column' => '107',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню',
                        ],
                        93 => [
                            'column' => '108',
                            'label' => 'Количество проверенных размерных сеток',
                        ],
                        94 => [
                            'column' => '109',
                            'label' => 'Количество проверенных редиректов',
                        ],
                        95 => [
                            'column' => '110',
                            'label' => 'Количество товаров, к которым добавлены теги',
                        ],
                        96 => [
                            'column' => '111',
                            'label' => 'Количество товаров, которые уже есть в БД',
                        ],
                        97 => [
                            'column' => '112',
                            'label' => 'Количество добавленных/измененных точек входа на портале/в фат-меню',
                        ],
                        98 => [
                            'column' => '113',
                            'label' => 'Перевязано опций',
                        ],
                        99 => [
                            'column' => '114',
                            'label' => 'Коэффициент группировки',
                        ],
                        100 => [
                            'column' => '115',
                            'label' => 'Количество добавленных категорий',
                        ],
                        101 => [
                            'column' => '116',
                            'label' => 'Количество отправленных писем',
                        ],
                        102 => [
                            'column' => '117',
                            'label' => 'Количество проверенных тегов',
                        ],
                        103 => [
                            'column' => '118',
                            'label' => 'Количество обработанных товаров',
                        ],
                        104 => [
                            'column' => '120',
                            'label' => 'Проверенные размерные сетки (ссылки)',
                        ],
                        105 => [
                            'column' => '101',
                            'label' => 'Общее количество ошибок',
                        ],
                        106 => [
                            'column' => '122',
                            'label' => 'Общее количество товаров с ошибками',
                        ],
                        107 => [
                            'column' => '123',
                            'label' => 'Обновление фото',
                        ],
                        108 => [
                            'column' => '124',
                            'label' => 'Обновление описания',
                        ],
                        109 => [
                            'column' => '125',
                            'label' => 'Обновление характеристик',
                        ],
                        110 => [
                            'column' => '126',
                            'label' => 'Добавление/обновление инструкций',
                        ],
                        111 => [
                            'column' => '121',
                            'label' => 'Проверенные ссылки',
                        ],
                        112 => [
                            'column' => '5',
                            'label' => 'Стоп-бренды',
                        ],
                        113 => [
                            'column' => '127',
                            'label' => 'Автомодерация',
                        ],
                        114 => [
                            'column' => '129',
                            'label' => 'Ошибки в общих характеристиках товаров (Кросс-чек)',
                        ],
                        115 => [
                            'column' => '130',
                            'label' => 'Ошибки в характеристиках и описаниях товаров (Кросс-чек)',
                        ],
                        116 => [
                            'column' => '132',
                            'label' => 'Ошибки в размещении товаров (Кросс-чек)',
                        ],
                        117 => [
                            'column' => '133',
                            'label' => 'Ошибки в особых правилах (Кросс-чек)',
                        ],
                        118 => [
                            'column' => '134',
                            'label' => 'Ошибки в стоп-брендах (Кросс-чек)',
                        ],
                        119 => [
                            'column' => '135',
                            'label' => 'Ошибки в редиректах (Кросс-чек)',
                        ],
                        120 => [
                            'column' => '136',
                            'label' => 'Ошибки в структурах категорий (Кросс-чек)',
                        ],
                        121 => [
                            'column' => '137',
                            'label' => 'Ошибки в портальных страницах (Кросс-чек)',
                        ],
                        122 => [
                            'column' => '138',
                            'label' => 'Ошибки в размерных сетках (Кросс-чек)',
                        ],
                        123 => [
                            'column' => '139',
                            'label' => 'Ошибки в тегах (Кросс-чек)',
                        ],
                        124 => [
                            'column' => '140',
                            'label' => 'Ошибки в значениях параметров и в производителях (Кросс-чек)',
                        ],
                        125 => [
                            'column' => '141',
                            'label' => 'Ошибки в видео к товарам (Кросс-чек)',
                        ],
                        126 => [
                            'column' => '142',
                            'label' => 'Рассчитанное количество проверенных товаров (Кросс-чек)',
                        ],
                        127 => [
                            'column' => '143',
                            'label' => 'Рассчитанное количество проверенных товаров с ошибками (Кросс-чек)',
                        ],
                        128 => [
                            'column' => '144',
                            'label' => 'Количество проверенных товаров (Кросс-чек)',
                        ],
                        129 => [
                            'column' => '145',
                            'label' => 'Количество групп с ошибками (Кросс-чек)',
                        ],
                        130 => [
                            'column' => '93',
                            'label' => 'Количество обработанных групп',
                        ],
                        131 => [
                            'column' => '147',
                            'label' => 'Количество проверенных видео (Кросс-чек)',
                        ],
                        132 => [
                            'column' => '148',
                            'label' => 'Количество проверенных групп (Кросс-чек)',
                        ],
                        133 => [
                            'column' => '149',
                            'label' => 'Количество проверенных значений параметров (Кросс-чек)',
                        ],
                        134 => [
                            'column' => '150',
                            'label' => 'Количество проверенных категорий (Кросс-чек)',
                        ],
                        135 => [
                            'column' => '151',
                            'label' => 'Количество проверенных параметров (Кросс-чек)',
                        ],
                        136 => [
                            'column' => '152',
                            'label' => 'Количество проверенных порталов/точек входа в фат-меню (Кросс-чек)',
                        ],
                        137 => [
                            'column' => '153',
                            'label' => 'Количество проверенных размерных сеток (Кросс-чек)',
                        ],
                        138 => [
                            'column' => '154',
                            'label' => 'Количество проверенных редиректов (Кросс-чек)',
                        ],
                        139 => [
                            'column' => '155',
                            'label' => 'Количество проверенных тегов (Кросс-чек)',
                        ],
                        140 => [
                            'column' => '156',
                            'label' => 'Проверенные размерные сетки (ссылки) (Кросс-чек)',
                        ],
                        141 => [
                            'column' => '157',
                            'label' => 'Проверенные ссылки (Кросс-чек)',
                        ],
                        142 => [
                            'column' => '158',
                            'label' => 'Общее количество товаров с ошибками (Кросс-чек)',
                        ],
                        143 => [
                            'column' => '159',
                            'label' => 'По заявке с MobileCourier',
                        ],
                        144 => [
                            'column' => '161',
                            'label' => 'Количество обработанных, но не сгруппированных товаров',
                        ],
                        145 => [
                            'column' => '162',
                            'label' => 'Количество настроек групп (управление группами)',
                        ],
                        146 => [
                            'column' => '163',
                            'label' => 'Количество слов в словарях',
                        ],
                        147 => [
                            'column' => '164',
                            'label' => 'Рассчитанное количество не сгруппированных товаров',
                        ],
                        148 => [
                            'column' => '165',
                            'label' => 'Рассчитанное количество отправленных писем',
                        ],
                        149 => [
                            'column' => '166',
                            'label' => 'Рассчитанное количество созданных подзадач',
                        ],
                        150 => [
                            'column' => '167',
                            'label' => 'Рассчитанное количество слов в словарях',
                        ],
                        151 => [
                            'column' => '168',
                            'label' => 'Среднее количество товаров в группе',
                        ],
                        152 => [
                            'column' => '169',
                            'label' => 'Алгоритм',
                        ],
                        153 => [
                            'column' => '170',
                            'label' => 'Коэффициент среднего количества товаров в группе',
                        ],
                        154 => [
                            'column' => '171',
                            'label' => 'Коэффициент не сгруппированных товаров',
                        ],
                        155 => [
                            'column' => '172',
                            'label' => 'Коэффициент писем/подзадач',
                        ],
                        156 => [
                            'column' => '173',
                            'label' => 'Коэффициент количества слов в словарях',
                        ],
                        157 => [
                            'column' => 'manager_id',
                            'label' => 'Контент-менеджер',
                        ],
                        158 => [
                            'column' => 'awaiting_correction',
                            'label' => 'На исправление',
                        ],
                        159 => [
                            'column' => 'created_at',
                            'label' => 'Дата регистрации задачи в системе',
                        ],
                        160 => [
                            'column' => 'subject',
                            'label' => 'Заголовок',
                        ],
                        161 => [
                            'column' => 'description',
                            'label' => 'Описание',
                        ],
                        162 => [
                            'column' => 'direction',
                            'label' => 'Направление задачи',
                        ],
                        163 => [
                            'column' => 'amount_to_work',
                            'label' => 'Количество в работу',
                        ],
                        164 => [
                            'column' => 'recommendations',
                            'label' => 'Рекомендации',
                        ],
                        165 => [
                            'column' => 'reason',
                            'label' => 'Причина отмены/доработки',
                        ],
                        166 => [
                            'column' => 'parent_id',
                            'label' => 'ID связанной задачи',
                        ],
                        167 => [
                            'column' => 'planned_start_date',
                            'label' => 'Плановая дата начала работ',
                        ],
                        168 => [
                            'column' => 'planned_finish_date',
                            'label' => 'Плановая дата завершения',
                        ],
                        169 => [
                            'column' => 'supervisor_process_date',
                            'label' => 'Дата обработки задачи супервайзером',
                        ],
                        170 => [
                            'column' => 'supervisor_check_date',
                            'label' => 'Дата проверки задачи супервайзером',
                        ],
                        171 => [
                            'column' => 'result_comment',
                            'label' => 'Комментарий к результату задачи',
                        ],
                        172 => [
                            'column' => 'supervisor_comment',
                            'label' => 'Комментарий супервайзера',
                        ],
                        173 => [
                            'column' => 'last_change_status_date',
                            'label' => 'Дата последнего изменения статуса',
                        ],
                        174 => [
                            'column' => 'team_direction',
                            'label' => 'Направление команды',
                        ],
                        175 => [
                            'column' => 'correction_comment',
                            'label' => 'Комментарий на исправление',
                        ],
                        176 => [
                            'column' => 'priority',
                            'label' => 'Приоритет',
                        ],
                        177 => [
                            'column' => 'cross_check_manager_id',
                            'label' => 'Кросс-чек менеджер',
                        ],
                        178 => [
                            'column' => 'cross_check_status',
                            'label' => 'Кросс-чек статус',
                        ],
                        179 => [
                            'column' => 'employee_code_1c',
                            'label' => 'Код работника 1С',
                        ],
                        180 => [
                            'column' => 'child_count',
                            'label' => 'Количество созданных подзадач',
                        ],
                        181 => [
                            'column' => 'photo_load_status',
                            'label' => 'Статус загрузки фото',
                        ],
                    ],
                ],
            ],
            'db' => [
                'lisa_fixtures' => [
                    'reports' => [
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][0],
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][1],
                        (include __DIR__ . '/fixture/case5.php')['lisa_fixtures']['reports'][2],
                        [
                            'id' => 4,
                            'title' => 'http://gomer.local/lisa/#/report/create?mode=create (сводный)',
                            'fields' => '["id", "author_id", "supervisor_id", "type_id", "status", "previous_status", "category_id", "seller_id", "actual_start_date", "actual_finish_date", "89", "report_period_id", "sv_report_periods", "manager_drfo", "manager_team", "supervisor_drfo", "supervisor_team", "160", "146", "131", "128", "64", "53", "52", "50", "49", "47", "33", "21", "20", "1"]',
                            'conditions' => '{"type_id": ["1", "4", "12", "8"], "team_direction": ["2", "4", "3"]}',
                            'type' => 1
                        ],
                    ],
                ],
            ]
        ]
    ],

];
