<?php
return [
    [
        "id" => 1,
        "field_id" => 21,
        "value" => "Предоставлены продактом",
        "status" => 1
    ],
    [
        "id" => 2,
        "field_id" => 21,
        "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
        "status" => 1
    ],
    [
        "id" => 3,
        "field_id" => 21,
        "value" => "Предоставлены продактом частично. С дополнительным поиском.",
        "status" => 1
    ],
    [
        "id" => 4,
        "field_id" => 21,
        "value" => "Не предоставлены продактом. Выполнен поиск.",
        "status" => 1
    ],
    [
        "id" => 5,
        "field_id" => 21,
        "value" => "Характеристики добавлены с обновлением фото/описания",
        "status" => 1
    ],
    [
        "id" => 6,
        "field_id" => 22,
        "value" => "Предоставлены продактом",
        "status" => 1
    ],
    [
        "id" => 7,
        "field_id" => 22,
        "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
        "status" => 1
    ],
    [
        "id" => 8,
        "field_id" => 22,
        "value" => "Предоставлены продактом частично. С дополнительным поиском.",
        "status" => 1
    ],
    [
        "id" => 9,
        "field_id" => 22,
        "value" => "Не предоставлены продактом. Выполнен поиск.",
        "status" => 1
    ],
    [
        "id" => 10,
        "field_id" => 22,
        "value" => "Фото предоставлены фотостудией",
        "status" => 1
    ],
    [
        "id" => 11,
        "field_id" => 23,
        "value" => "Предоставлены продактом",
        "status" => 1
    ],
    [
        "id" => 12,
        "field_id" => 23,
        "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
        "status" => 1
    ],
    [
        "id" => 13,
        "field_id" => 23,
        "value" => "Предоставлены продактом частично. С дополнительным поиском.",
        "status" => 1
    ],
    [
        "id" => 14,
        "field_id" => 23,
        "value" => "Не предоставлены продактом. Выполнен поиск.",
        "status" => 1
    ],
    [
        "id" => 15,
        "field_id" => 24,
        "value" => "Без обработки (только кадрирование)",
        "status" => 1
    ],
    [
        "id" => 16,
        "field_id" => 24,
        "value" => "Удаление теней/фона (простая обработка)",
        "status" => 1
    ],
    [
        "id" => 17,
        "field_id" => 24,
        "value" => "Удаление теней/фона/ватермарков/цветокорекция",
        "status" => 1
    ],
    [
        "id" => 18,
        "field_id" => 25,
        "value" => "Без уточнений",
        "status" => 1
    ],
    [
        "id" => 19,
        "field_id" => 25,
        "value" => "Менее 5 уточнений",
        "status" => 1
    ],
    [
        "id" => 20,
        "field_id" => 25,
        "value" => "Более 5 уточнений",
        "status" => 1
    ],
    [
        "id" => 21,
        "field_id" => 26,
        "value" => "Русский",
        "status" => 1
    ],
    [
        "id" => 22,
        "field_id" => 26,
        "value" => "Украинский",
        "status" => 1
    ],
    [
        "id" => 23,
        "field_id" => 26,
        "value" => "Английский",
        "status" => 1
    ],
    [
        "id" => 24,
        "field_id" => 27,
        "value" => "Предоставлено продактом",
        "status" => 1
    ],
    [
        "id" => 25,
        "field_id" => 27,
        "value" => "Добавлено по собственной инициативе",
        "status" => 1
    ],
    [
        "id" => 26,
        "field_id" => 27,
        "value" => "Предоставлено продактом, в плохом качестве (производился поиск)",
        "status" => 1
    ],
    [
        "id" => 27,
        "field_id" => 28,
        "value" => "Перенос из текстовых полей/блоков в выборы из списков",
        "status" => 1
    ],
    [
        "id" => 28,
        "field_id" => 28,
        "value" => "Перенос из текстовых полей/блоков в текстовые поля",
        "status" => 1
    ],
    [
        "id" => 29,
        "field_id" => 28,
        "value" => "Перенос из названий товаров в выборы из списков",
        "status" => 1
    ],
    [
        "id" => 30,
        "field_id" => 29,
        "value" => "Новые разделы (категории верхнего уровня, второго за верхним уровня)",
        "status" => 1
    ],
    [
        "id" => 31,
        "field_id" => 29,
        "value" => "Новые категории промежуточных уровней/автопорталы",
        "status" => 1
    ],
    [
        "id" => 32,
        "field_id" => 29,
        "value" => "Новые конечные категории",
        "status" => 1
    ],
    [
        "id" => 33,
        "field_id" => 29,
        "value" => "Существующие разделы (категории верхнего уровня, второго за верхним уровня)",
        "status" => 1
    ],
    [
        "id" => 34,
        "field_id" => 29,
        "value" => "Существующие категории промежуточных уровней/автопорталы",
        "status" => 1
    ],
    [
        "id" => 35,
        "field_id" => 29,
        "value" => "Существующие конечные категории",
        "status" => 1
    ],
    [
        "id" => 36,
        "field_id" => 29,
        "value" => "Существующие разделы (категории верхнего уровня, второго за верхним уровня) + перенос информации",
        "status" => 1
    ],
    [
        "id" => 37,
        "field_id" => 29,
        "value" => "Существующие категории промежуточных уровней/автопорталы + перенос информации",
        "status" => 1
    ],
    [
        "id" => 38,
        "field_id" => 29,
        "value" => "Существующие конечные категории + перенос информации",
        "status" => 1
    ],
    [
        "id" => 39,
        "field_id" => 30,
        "value" => "Простые (физические характеристики)",
        "status" => 1
    ],
    [
        "id" => 40,
        "field_id" => 30,
        "value" => "Простые (физические характеристики) 1 вид товара",
        "status" => 1
    ],
    [
        "id" => 41,
        "field_id" => 30,
        "value" => "Простые (физические характеристики) несколько видов товара",
        "status" => 1
    ],
    [
        "id" => 42,
        "field_id" => 30,
        "value" => "Средней сложности (физические + функциональные характеристики)",
        "status" => 1
    ],
    [
        "id" => 43,
        "field_id" => 30,
        "value" => "Средней сложности (физические + функциональные характеристики) 1 вид товара",
        "status" => 1
    ],
    [
        "id" => 44,
        "field_id" => 30,
        "value" => "Средней сложности (физические + функциональные характеристики) несколько видов товара",
        "status" => 1
    ],
    [
        "id" => 45,
        "field_id" => 30,
        "value" => "Сложные (физические + функциональные + технологические характеристики)",
        "status" => 1
    ],
    [
        "id" => 46,
        "field_id" => 30,
        "value" => "Сложные (физические + функциональные + технологические характеристики) 1 вид товара",
        "status" => 1
    ],
    [
        "id" => 47,
        "field_id" => 30,
        "value" => "Сложные (физические + функциональные + технологические характеристики) несколько видов товара",
        "status" => 1
    ],
    [
        "id" => 48,
        "field_id" => 31,
        "value" => "Без варьируемого параметра",
        "status" => 1
    ],
    [
        "id" => 49,
        "field_id" => 31,
        "value" => "Один варьируемый параметр",
        "status" => 1
    ],
    [
        "id" => 50,
        "field_id" => 31,
        "value" => "Два варьируемых параметра",
        "status" => 1
    ],
    [
        "id" => 51,
        "field_id" => 31,
        "value" => "Три варьируемых параметра",
        "status" => 1
    ],
    [
        "id" => 52,
        "field_id" => 32,
        "value" => "Готовый файл для группировки",
        "status" => 1
    ],
    [
        "id" => 53,
        "field_id" => 32,
        "value" => "Очевидные товары для группировки (до 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 54,
        "field_id" => 32,
        "value" => "Очевидные товары для группировки (больше 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 55,
        "field_id" => 32,
        "value" => "Сложные товары для группировки (до 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 56,
        "field_id" => 32,
        "value" => "Сложные товары для группировки (больше 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 57,
        "field_id" => 32,
        "value" => "Очевидные товары для группировки + Наличие товаров без необходимых варьируемых параметров (до 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 58,
        "field_id" => 32,
        "value" => "Очевидные товары для группировки + Наличие товаров без необходимых варьируемых параметров (больше 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 59,
        "field_id" => 32,
        "value" => "Сложные товары для группировки + Наличие товаров без необходимых варьируемых параметров (до 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 60,
        "field_id" => 32,
        "value" => "Сложные товары для группировки + Наличие товаров без необходимых варьируемых параметров (больше 3-х категорий)",
        "status" => 1
    ],
    [
        "id" => 61,
        "field_id" => 20,
        "value" => "1",
        "status" => 1
    ],
    [
        "id" => 62,
        "field_id" => 20,
        "value" => "2",
        "status" => 1
    ],
    [
        "id" => 63,
        "field_id" => 20,
        "value" => "3",
        "status" => 1
    ],
    [
        "id" => 64,
        "field_id" => 20,
        "value" => "4",
        "status" => 1
    ],
    [
        "id" => 65,
        "field_id" => 20,
        "value" => "5",
        "status" => 1
    ],
    [
        "id" => 66,
        "field_id" => 20,
        "value" => "6",
        "status" => 1
    ],
    [
        "id" => 67,
        "field_id" => 33,
        "value" => "Орфографические и грамматические ошибки, опечатки, отсутствие пробелов, в названии, текстовых параметрах, описании, отсутствие <br> в текстовых параметрах",
        "status" => 1
    ],
    [
        "id" => 68,
        "field_id" => 33,
        "value" => "Добавлено некачественное фото (плохое разрешение, плохой ракурс)",
        "status" => 1
    ],
    [
        "id" => 69,
        "field_id" => 33,
        "value" => "Некачественная обработка фото в Adobe Photoshop (фото хорошее, некачественно вырезан фон)",
        "status" => 1
    ],
    [
        "id" => 70,
        "field_id" => 33,
        "value" => "Отсутствует фото товара",
        "status" => 1
    ],
    [
        "id" => 71,
        "field_id" => 33,
        "value" => "Неправильное фото товара/комплекта поставки товара",
        "status" => 1
    ],
    [
        "id" => 72,
        "field_id" => 33,
        "value" => "Не заполнено краткое описание (в категориях, где оно заполняется вручную)",
        "status" => 1
    ],
    [
        "id" => 73,
        "field_id" => 33,
        "value" => "Фото не соответствует требованиям маркета",
        "status" => 1
    ],
    [
        "id" => 74,
        "field_id" => 33,
        "value" => "На заглавном фото ассортимента, а не конкретного товара",
        "status" => 1
    ],
    [
        "id" => 75,
        "field_id" => 33,
        "value" => "Выведен товар с урлом на другие источники",
        "status" => 1
    ],
    [
        "id" => 76,
        "field_id" => 34,
        "value" => "Неправильный артикул",
        "status" => 1
    ],
    [
        "id" => 77,
        "field_id" => 34,
        "value" => "Ошибки в логистических параметрах",
        "status" => 1
    ],
    [
        "id" => 78,
        "field_id" => 34,
        "value" => "Не заполнены ОП",
        "status" => 1
    ],
    [
        "id" => 79,
        "field_id" => 34,
        "value" => "Не заполнен производитель, неправильно заполнен производитель",
        "status" => 1
    ],
    [
        "id" => 80,
        "field_id" => 34,
        "value" => "Неправильно заполнен мерчант, SLA",
        "status" => 1
    ],
    [
        "id" => 81,
        "field_id" => 35,
        "value" => "Неправильно указан комплект поставки",
        "status" => 1
    ],
    [
        "id" => 82,
        "field_id" => 35,
        "value" => "Неправильно указан гарантийный срок",
        "status" => 1
    ],
    [
        "id" => 83,
        "field_id" => 35,
        "value" => "Неправильно заполнена техническая характеристика",
        "status" => 1
    ],
    [
        "id" => 84,
        "field_id" => 35,
        "value" => "Характеристики/описание заполнены частично (в заявке информация была), не заполнены фасеты",
        "status" => 1
    ],
    [
        "id" => 85,
        "field_id" => 35,
        "value" => "В характеристиках указана информация, которой нет в товаре (функции, которых нет)",
        "status" => 1
    ],
    [
        "id" => 86,
        "field_id" => 35,
        "value" => "Не удалена информация с товара, с которого сделана копия (видео, 3D-обзор, теги, инструкции)",
        "status" => 1
    ],
    [
        "id" => 87,
        "field_id" => 35,
        "value" => "Вместо добавления нового товара был изменен существующий на сайте",
        "status" => 1
    ],
    [
        "id" => 88,
        "field_id" => 35,
        "value" => "Ошибки в единицах измерения",
        "status" => 1
    ],
    [
        "id" => 89,
        "field_id" => 35,
        "value" => "Несоответствие характеристик описанию, названию",
        "status" => 1
    ],
    [
        "id" => 90,
        "field_id" => 37,
        "value" => "Неправильный фильтр, серия, производитель",
        "status" => 1
    ],
    [
        "id" => 91,
        "field_id" => 37,
        "value" => "Неправильная категория товаров",
        "status" => 1
    ],
    [
        "id" => 92,
        "field_id" => 38,
        "value" => "На сайт выведен товар политического характера",
        "status" => 1
    ],
    [
        "id" => 93,
        "field_id" => 38,
        "value" => "На сайт выведен товар эротического характера (с открытыми интимными зонами, БДСМ)",
        "status" => 1
    ],
    [
        "id" => 94,
        "field_id" => 38,
        "value" => "На сайт выведен товар с фото насильственного характера",
        "status" => 1
    ],
    [
        "id" => 95,
        "field_id" => 36,
        "value" => "Некорректно настроена группа",
        "status" => 1
    ],
    [
        "id" => 96,
        "field_id" => 36,
        "value" => "В группу добавлены некорректные товары",
        "status" => 1
    ],
    [
        "id" => 97,
        "field_id" => 36,
        "value" => "Товары не сгруппированы",
        "status" => 1
    ],
    [
        "id" => 98,
        "field_id" => 36,
        "value" => "Название группы сформировано некорректно",
        "status" => 1
    ],
    [
        "id" => 99,
        "field_id" => 40,
        "value" => "Редирект не добавлен",
        "status" => 1
    ],
    [
        "id" => 100,
        "field_id" => 40,
        "value" => "Редирект не работает",
        "status" => 1
    ],
    [
        "id" => 101,
        "field_id" => 40,
        "value" => "Редирект ведет по некорректной ссылке",
        "status" => 1
    ],
    [
        "id" => 102,
        "field_id" => 41,
        "value" => "Грамматические, орфографические ошибки, опечатки, неправильный перевод на украинский",
        "status" => 1
    ],
    [
        "id" => 103,
        "field_id" => 41,
        "value" => "Ошибки в реализованной структуре в админке, она не соответствует структуре от seo-отдела",
        "status" => 1
    ],
    [
        "id" => 104,
        "field_id" => 41,
        "value" => "Ошибки в урлах для новых категорий, параметров, значений",
        "status" => 1
    ],
    [
        "id" => 105,
        "field_id" => 41,
        "value" => "Некорректно настроены категории (настройки гарантии, условий обмена/возврата, возрастных ограничений)",
        "status" => 1
    ],
    [
        "id" => 106,
        "field_id" => 41,
        "value" => "Заблокированы не все старые параметры",
        "status" => 1
    ],
    [
        "id" => 107,
        "field_id" => 41,
        "value" => "Заблокированы не все старые/не нужные значения в параметре",
        "status" => 1
    ],
    [
        "id" => 108,
        "field_id" => 41,
        "value" => "Добавлен параметр, который дублирует уже существующий",
        "status" => 1
    ],
    [
        "id" => 109,
        "field_id" => 41,
        "value" => "Товары перенесены в заблокированную категорию, категорию активировать забыли",
        "status" => 1
    ],
    [
        "id" => 110,
        "field_id" => 41,
        "value" => "Не все товары отвязаны от заблокированного значения",
        "status" => 1
    ],
    [
        "id" => 111,
        "field_id" => 41,
        "value" => "Не отправлен файл категорийному менеджеру, а в товарах остались товары с параметрами, значений в которых не хватает",
        "status" => 1
    ],
    [
        "id" => 112,
        "field_id" => 42,
        "value" => "Не на всех портальных страницах изменены старые ссылки на новые",
        "status" => 1
    ],
    [
        "id" => 113,
        "field_id" => 42,
        "value" => "Не заблокированы не нужные точки входа",
        "status" => 1
    ],
    [
        "id" => 114,
        "field_id" => 42,
        "value" => "Не добавлены точки входа",
        "status" => 1
    ],
    [
        "id" => 115,
        "field_id" => 42,
        "value" => "Остались \"битые\" ссылки на портальной странице",
        "status" => 1
    ],
    [
        "id" => 116,
        "field_id" => 42,
        "value" => "Точка входа ведет по некорректной ссылке",
        "status" => 1
    ],
    [
        "id" => 117,
        "field_id" => 43,
        "value" => "Ошибки в разметке размерной сетки, заголовках и стилях",
        "status" => 1
    ],
    [
        "id" => 118,
        "field_id" => 43,
        "value" => "Грамматические, орфографические ошибки в тексте",
        "status" => 1
    ],
    [
        "id" => 119,
        "field_id" => 43,
        "value" => "Не добавлена размерная сетка в одну из языковых версий сайта",
        "status" => 1
    ],
    [
        "id" => 120,
        "field_id" => 43,
        "value" => "Некорректно размещена размерная сетка в алфавитном указателе",
        "status" => 1
    ],
    [
        "id" => 121,
        "field_id" => 43,
        "value" => "Не добавлено значение созданной размерной сетки в параметр “Информация о размерах”",
        "status" => 1
    ],
    [
        "id" => 122,
        "field_id" => 44,
        "value" => "Добавлен дубль тега",
        "status" => 1
    ],
    [
        "id" => 123,
        "field_id" => 44,
        "value" => "Грамматические, орфографические ошибки в названиях, описаниях тегов",
        "status" => 1
    ],
    [
        "id" => 124,
        "field_id" => 44,
        "value" => "К тегу добавлена некорректная графика (иконка)",
        "status" => 1
    ],
    [
        "id" => 125,
        "field_id" => 44,
        "value" => "Некорректно настроены условия добавления тега",
        "status" => 1
    ],
    [
        "id" => 126,
        "field_id" => 45,
        "value" => "Грамматические, орфографические ошибки, опечатки, неправильный перевод на украинский",
        "status" => 1
    ],
    [
        "id" => 127,
        "field_id" => 45,
        "value" => "Смысловые",
        "status" => 1
    ],
    [
        "id" => 128,
        "field_id" => 45,
        "value" => "Некорректный формат записи",
        "status" => 1
    ],
    [
        "id" => 129,
        "field_id" => 45,
        "value" => "Частично заполненное значение (не заполнен маркер цвета, не заполнено украинское название)",
        "status" => 1
    ],
    [
        "id" => 130,
        "field_id" => 45,
        "value" => "Дубли значений в рамках одного параметра",
        "status" => 1
    ],
    [
        "id" => 131,
        "field_id" => 45,
        "value" => "Дубли значений в рамках разных параметров",
        "status" => 1
    ],
    [
        "id" => 132,
        "field_id" => 45,
        "value" => "Вместо латинских букв указаны русские (или наоборот)",
        "status" => 1
    ],
    [
        "id" => 133,
        "field_id" => 45,
        "value" => "К названию бренда добавлено название серии",
        "status" => 1
    ],
    [
        "id" => 134,
        "field_id" => 45,
        "value" => "Дубли значений в рамках разных категорий",
        "status" => 1
    ],
    [
        "id" => 135,
        "field_id" => 39,
        "value" => "На сайт выведены товары запрещенного бренда",
        "status" => 1
    ],
    [
        "id" => 136,
        "field_id" => 39,
        "value" => "На сайт выведены товары из запрещенной категории",
        "status" => 1
    ],
    [
        "id" => 137,
        "field_id" => 39,
        "value" => "На сайт выведены запрещенные модели",
        "status" => 1
    ],
    [
        "id" => 138,
        "field_id" => 46,
        "value" => "Видео добавлено не к той модели товара",
        "status" => 1
    ],
    [
        "id" => 139,
        "field_id" => 46,
        "value" => "Видео добавлено не ко всем товарам из задачи",
        "status" => 1
    ],
    [
        "id" => 140,
        "field_id" => 37,
        "value" => "Товар не активирован на сайте",
        "status" => 1
    ],
    [
        "id" => 141,
        "field_id" => 36,
        "value" => "Не отправлены письма",
        "status" => 1
    ]
];