<?php
return [
    [
        //"id" => 1,
        "field_id" => 21,
        "value" => "Предоставлены продактом",
        "status" => 1,
        "order" => 2
    ],
    [
        //"id" => 2,
        "field_id" => 21,
        "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
        "status" => 1,
        "order" => 3
    ],
    [
        //"id" => 3,
        "field_id" => 21,
        "value" => "Предоставлены продактом частично. С дополнительным поиском.",
        "status" => 1,
        "order" => 4
    ],
    [
        //"id" => 4,
        "field_id" => 21,
        "value" => "Не предоставлены продактом. Выполнен поиск.",
        "status" => 1,
        "order" => 1
    ],
    [
        //"id" => 5,
        "field_id" => 21,
        "value" => "Характеристики добавлены с обновлением фото/описания",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 6,
        "field_id" => 22,
        "value" => "Предоставлены продактом",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 7,
        "field_id" => 22,
        "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 8,
        "field_id" => 22,
        "value" => "Предоставлены продактом частично. С дополнительным поиском.",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 9,
        "field_id" => 22,
        "value" => "Не предоставлены продактом. Выполнен поиск.",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 10,
        "field_id" => 22,
        "value" => "Фото предоставлены фотостудией",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 11,
        "field_id" => 23,
        "value" => "Предоставлены продактом",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 12,
        "field_id" => 23,
        "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 13,
        "field_id" => 23,
        "value" => "Предоставлены продактом частично. С дополнительным поиском.",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 14,
        "field_id" => 23,
        "value" => "Не предоставлены продактом. Выполнен поиск.",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 15,
        "field_id" => 24,
        "value" => "Без обработки (только кадрирование)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 16,
        "field_id" => 24,
        "value" => "Удаление теней/фона (простая обработка)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 17,
        "field_id" => 24,
        "value" => "Удаление теней/фона/ватермарков/цветокорекция",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 18,
        "field_id" => 25,
        "value" => "Без уточнений",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 19,
        "field_id" => 25,
        "value" => "Менее 5 уточнений",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 20,
        "field_id" => 25,
        "value" => "Более 5 уточнений",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 21,
        "field_id" => 26,
        "value" => "Русский",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 22,
        "field_id" => 26,
        "value" => "Украинский",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 23,
        "field_id" => 26,
        "value" => "Английский",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 24,
        "field_id" => 27,
        "value" => "Предоставлено продактом",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 25,
        "field_id" => 27,
        "value" => "Добавлено по собственной инициативе",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 26,
        "field_id" => 27,
        "value" => "Предоставлено продактом, в плохом качестве (производился поиск)",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 27,
        "field_id" => 28,
        "value" => "Перенос из текстовых полей/блоков в выборы из списков",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 28,
        "field_id" => 28,
        "value" => "Перенос из текстовых полей/блоков в текстовые поля",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 29,
        "field_id" => 28,
        "value" => "Перенос из названий товаров в выборы из списков",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 30,
        "field_id" => 29,
        "value" => "Новые разделы (категории верхнего уровня, второго за верхним уровня)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 31,
        "field_id" => 29,
        "value" => "Новые категории промежуточных уровней/автопорталы",
        "status" => 1,
        "order" => 1
    ],
    [
        //"id" => 32,
        "field_id" => 29,
        "value" => "Новые конечные категории",
        "status" => 1,
        "order" => 2
    ],
    [
        //"id" => 33,
        "field_id" => 29,
        "value" => "Существующие разделы (категории верхнего уровня, второго за верхним уровня)",
        "status" => 1,
        "order" => 3
    ],
    [
        //"id" => 34,
        "field_id" => 29,
        "value" => "Существующие категории промежуточных уровней/автопорталы",
        "status" => 1,
        "order" => 4
    ],
    [
        //"id" => 35,
        "field_id" => 29,
        "value" => "Существующие конечные категории",
        "status" => 1,
        "order" => 5
    ],
    [
        //"id" => 36,
        "field_id" => 29,
        "value" => "Существующие разделы (категории верхнего уровня, второго за верхним уровня) + перенос информации",
        "status" => 1,
        "order" => 6
    ],
    [
        //"id" => 37,
        "field_id" => 29,
        "value" => "Существующие категории промежуточных уровней/автопорталы + перенос информации",
        "status" => 1,
        "order" => 7
    ],
    [
        //"id" => 38,
        "field_id" => 29,
        "value" => "Существующие конечные категории + перенос информации",
        "status" => 0,
        "order" => 8
    ],
    [
        //"id" => 39,
        "field_id" => 30,
        "value" => "Простые (физические характеристики)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 40,
        "field_id" => 30,
        "value" => "Простые (физические характеристики) 1 вид товара",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 41,
        "field_id" => 30,
        "value" => "Простые (физические характеристики) несколько видов товара",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 42,
        "field_id" => 30,
        "value" => "Средней сложности (физические + функциональные характеристики)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 43,
        "field_id" => 30,
        "value" => "Средней сложности (физические + функциональные характеристики) 1 вид товара",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 44,
        "field_id" => 30,
        "value" => "Средней сложности (физические + функциональные характеристики) несколько видов товара",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 45,
        "field_id" => 30,
        "value" => "Сложные (физические + функциональные + технологические характеристики)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 46,
        "field_id" => 30,
        "value" => "Сложные (физические + функциональные + технологические характеристики) 1 вид товара",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 47,
        "field_id" => 30,
        "value" => "Сложные (физические + функциональные + технологические характеристики) несколько видов товара",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 48,
        "field_id" => 31,
        "value" => "Без варьируемого параметра",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 49,
        "field_id" => 31,
        "value" => "Один варьируемый параметр",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 50,
        "field_id" => 31,
        "value" => "Два варьируемых параметра",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 51,
        "field_id" => 31,
        "value" => "Три варьируемых параметра",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 52,
        "field_id" => 32,
        "value" => "Определено какие товары попадают в группу (до 3 категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 53,
        "field_id" => 32,
        "value" => "Определено какие товары попадают в группу (3 и больше категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 54,
        "field_id" => 32,
        "value" => "Есть артикул или модель в больше, чем 50% товаров (до 3 категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 55,
        "field_id" => 32,
        "value" => "Есть артикул или модель в больше, чем 50% товаров (3 и больше категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 56,
        "field_id" => 32,
        "value" => "Товаров с артикулом или моделью столько же, сколько без них (1:1) (до 3 категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 57,
        "field_id" => 32,
        "value" => "Товаров с артикулом или моделью столько же, сколько без них (1:1) (3 и больше категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 58,
        "field_id" => 32,
        "value" => "Есть артикул или модель в меньше, чем 50% товаров (до 3 категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 59,
        "field_id" => 32,
        "value" => "Есть артикул или модель в меньше, чем 50% товаров (3 и больше категорий)",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 60,
        "field_id" => 32,
        "value" => "Отдельный список категорий (до 2-х категорий)",
        "status" => 0,
        "order" => 0
    ],
    [
        //"id" => 61,
        "field_id" => 20,
        "value" => "1",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 62,
        "field_id" => 20,
        "value" => "2",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 63,
        "field_id" => 20,
        "value" => "3",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 64,
        "field_id" => 20,
        "value" => "4",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 65,
        "field_id" => 20,
        "value" => "5",
        "status" => 1,
        "order" => 0
    ],
    [
        //"id" => 66,
        "field_id" => 20,
        "value" => "6",
        "status" => 1,
        "order" => 0
    ],
];