<?php
return [
    [
        //"id" => 1,
        "user_id" => 4,
//        "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
        "notification" => "",
        "status" => 0,
        "created_at" => "2020-01-01 00:00:01",
        "request_id" => 1,
        "priority" => 2,
        //"recipients" => "Константин Куцан, Супервайзер Начальникович 1",
        "amount_to_work" => 10,
        "request_subject" => "!@#$%^&*()_+`-]'/[;.,}\"?{:>\\№ Тема",
        "fields_for_complete" => '[]',
        "triggered_by" => "Менеджер Продактович 1",
        "event" => "create",
        "changed_fields" => '{"newValue": 1, "oldValue": null}'
    ],
];