<?php

use lisa\Constants;

$priorities = [
    0 => [
        'id' => 1,
        'name' => 'Информация необходима для склада',
        'status' => 1,
    ],
    1 => [
        'id' => 2,
        'name' => 'Товар-новинка/эксклюзив (трафикообразующий)',
        'status' => 1,
    ],
];
$categories = [
    0 => [
        'id' => 1,
        'name' => 'Авиабилеты',
    ],
    1 => [
        'id' => 2,
        'name' => 'Видео к товару',
    ],
    2 => [
        'id' => 474,
        'name' => 'Распределить категорию в Lisa',
    ],
];
$users = [
    0 => [
        'id' => 4,
        'name' => 'Константин Куцан',
    ],
    1 => [
        'id' => 11,
        'name' => 'Менеджер Контентович 1А',
    ],
    2 => [
        'id' => 12,
        'name' => 'Менеджер Контентович 1Б',
    ],
    3 => [
        'id' => 13,
        'name' => 'Менеджер Контентович 2А',
    ],
    4 => [
        'id' => 14,
        'name' => 'Менеджер Контентович 2Б',
    ],
    5 => [
        'id' => 39,
        'name' => 'Менеджер Модерашкин',
    ],
    6 => [
        'id' => 17,
        'name' => 'Менеджер Продактович 1',
    ],
    7 => [
        'id' => 18,
        'name' => 'Менеджер Продактович 2',
    ],
    8 => [
        'id' => 21,
        'name' => 'Менеджер Фоткович 1',
    ],
    9 => [
        'id' => 22,
        'name' => 'Менеджер Фоткович 2',
    ],
    10 => [
        'id' => 19,
        'name' => 'Сео Сеошевич 1',
    ],
    11 => [
        'id' => 20,
        'name' => 'Сео Сеошевич 2',
    ],
    12 => [
        'id' => 33,
        'name' => 'Супервайзер Групповушкин 13',
    ],
    13 => [
        'id' => 36,
        'name' => 'Супервайзер Групповушкин 16',
    ],
    14 => [
        'id' => 35,
        'name' => 'Супервайзер Категоркин 15',
    ],
    15 => [
        'id' => 38,
        'name' => 'Супервайзер Категоркин 18',
    ],
    16 => [
        'id' => 6,
        'name' => 'Супервайзер Начальникович 1',
    ],
    17 => [
        'id' => 30,
        'name' => 'Супервайзер Начальникович 10',
    ],
    18 => [
        'id' => 31,
        'name' => 'Супервайзер Начальникович 11',
    ],
    19 => [
        'id' => 32,
        'name' => 'Супервайзер Начальникович 12',
    ],
    20 => [
        'id' => 10,
        'name' => 'Супервайзер Начальникович 2',
    ],
    21 => [
        'id' => 23,
        'name' => 'Супервайзер Начальникович 3',
    ],
    22 => [
        'id' => 24,
        'name' => 'Супервайзер Начальникович 4',
    ],
    23 => [
        'id' => 25,
        'name' => 'Супервайзер Начальникович 5',
    ],
    24 => [
        'id' => 26,
        'name' => 'Супервайзер Начальникович 6',
    ],
    25 => [
        'id' => 27,
        'name' => 'Супервайзер Начальникович 7',
    ],
    26 => [
        'id' => 28,
        'name' => 'Супервайзер Начальникович 8',
    ],
    27 => [
        'id' => 29,
        'name' => 'Супервайзер Начальникович 9',
    ],
    28 => [
        'id' => 34,
        'name' => 'Супервайзер Проектенко 14',
    ],
    29 => [
        'id' => 37,
        'name' => 'Супервайзер Проектенко 17',
    ],
    30 => [
        'id' => 5,
        'name' => 'Супервайзер Руководько 1',
    ],
    31 => [
        'id' => 16,
        'name' => 'Тим Лидович 2',
    ],
];
$rzCategories = [
//    [
//        'title' => 'Алкогольные напитки и продукты питания',
//        'id' => 4626923,
//    ],
    [
        'title' => 'Бытовая техника, интерьер',
        'id' => 80025,
    ],
    [
        'title' => 'Дача, сад, огород',
        'id' => 2394297,
    ],
    [
        'title' => 'Компьютеры и ноутбуки',
        'id' => 80253,
    ],
    [
        'title' => 'Красота и здоровье',
        'id' => 4629305,
    ],
    [
        'title' => 'Одежда, обувь и аксессуары',
        'id' => 1162030,
    ],
    [
        'title' => 'Оружие',
        'id' => 84625,
    ],
//    [
//        'title' => 'Офис, школа, книги',
//        'id' => 4625734,
//    ],
    [
        'title' => 'Подарки и товары для праздников',
        'id' => 80260,
    ],
    [
        'title' => 'Сантехника и ремонт',
        'id' => 4628418,
    ],
    [
        'title' => 'Сельское хозяйство',
        'id' => 4655216,
    ],
    [
        'title' => 'Скрытые категории',
        'id' => 80262,
    ],
    [
        'title' => 'Смартфоны, ТВ и электроника',
        'id' => 4627949,
    ],
    [
        'title' => 'Спорт и увлечения',
        'id' => 4627893,
    ],
    [
        'title' => 'Товары для бизнеса',
        'id' => 4627851,
    ],
    [
        'title' => 'Товары для детей',
        'id' => 88468,
    ],
    [
        'title' => 'Товары для дома',
        'id' => 2394287,
    ],
    [
        'title' => 'Услуги и сервисы',
        'id' => 4630262,
    ],
    [
        'title' => 'Уцененные товары',
        'id' => 83850,
    ],
//    [
//        'title' => 'Аксессуары для алкоголя',
//        'id' => 753399,
//    ],
    [
        'title' => 'Мини-бары',
        'id' => 4652996,
    ],
    [
        'title' => 'Фляги',
        'id' => 4653010,
    ],
    [
        'title' => 'Упаковки для алкогольных напитков',
        'id' => 4653017,
    ],
    [
        'title' => 'Фото и видео',
        'id' => 4628124,
    ],
    [
        'title' => 'Файлы',
        'id' => 2514857,
    ],
    [
        'title' => 'Визитницы',
        'id' => 2514867,
    ],
    [
        'title' => 'Бейджи, брелоки-идентификаторы, настольные таблички',
        'id' => 2514872,
    ],
    [
        'title' => 'Банковские принадлежности',
        'id' => 2560747,
    ],
//    [
//        'title' => 'Папки, регистраторы',
//        'id' => 2581722,
//    ],
    [
        'title' => 'Папки пластиковые',
        'id' => 2514862,
    ],
    [
        'title' => 'Папки-портфели, папки-боксы',
        'id' => 2581727,
    ],
    [
        'title' => 'Папки-регистраторы',
        'id' => 2581732,
    ],
    [
        'title' => 'Папки-планшеты',
        'id' => 2581737,
    ],
    [
        'title' => 'Папки и файлы подвесные',
        'id' => 2581742,
    ],
    [
        'title' => 'Папки с файлами',
        'id' => 2595767,
    ],
    [
        'title' => 'Архивные короба и боксы',
        'id' => 2666302,
    ],
    [
        'title' => 'Папки специальные',
        'id' => 4626584,
    ],
    [
        'title' => 'Разделители и закладки',
        'id' => 2660622,
    ],
    [
        'title' => 'Новая категория',
        'id' => 2973057,
    ],
    [
        'title' => 'Новая категория',
        'id' => 3167120,
    ],
    [
        'title' => 'Шило, нити и шпагаты',
        'id' => 4630034,
    ],
    [
        'title' => 'Настольные картотеки',
        'id' => 4641568,
    ],
    [
        'title' => 'Пломбы и пломбираторы',
        'id' => 4655242,
    ],
    [
        'title' => 'Сургуч',
        'id' => 4655266,
    ],
    [
        'title' => 'Досточки для оттиска',
        'id' => 4655272,
    ],
//    [
//        'title' => 'Канцелярия',
//        'id' => 2460392,
//    ],
//    [
//        'title' => 'Архивирование и делопроизводство',
//        'id' => 2460402,
//    ],
//    [
//        'title' => 'Штемпельная продукция',
//        'id' => 2514877,
//    ],
    [
        'title' => 'Самонаборные штампы, кассы букв',
        'id' => 2898382,
    ],
    [
        'title' => 'Штемпельные краски и подушки',
        'id' => 2898387,
    ],
    [
        'title' => 'Датеры',
        'id' => 4628926,
    ],
    [
        'title' => 'Оснастки, штампы стандартные',
        'id' => 4629073,
    ],
];

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить модель полей по id шаблона (только обязательные поля)',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'responseBody' => [
                'model' => [
                    'id' => 2,
                    'parent_id' => NULL,
                    'name' => 'Добавление',
                    'type_id' => 1,
                    'direction' => 2,
                    'fields' => [
                        'type_id' => '1',
                        'direction' => 2,
                        'priority' => NULL,
                        'amount_to_work' => 10,
                        'subject' => 'Добавление новых товаров (Работа с товарами Розетки)',
                        'description' => 'description',
                        'category_id' => NULL,
                        'seller_id' => 0,
                        'planned_finish_date' => NULL,
                        'rz_category_id' => NULL,
                    ],
                    'user_id' => 4,
                    'seller_id' => 0,
                    'category_id' => NULL,
                    'amount_to_work' => 10,
                    'observers' => [
                    ],
                    'rz_category_id' => NULL,
                ],
                'initialValues' => [
                    'seller' => [
                        'owox_id' => 0,
                        'title' => 'Маркетплейс (общий)',
                    ],
                    'checkBoxes' => [
                        0 => [
                            'id' => 127,
                            'name' => 'Автомодерация',
                            'checked' => false,
                        ],
                        1 => [
                            'id' => 17,
                            'name' => 'БУ, REF',
                            'checked' => false,
                        ],
                        2 => [
                            'id' => 13,
                            'name' => 'Жалоба на товар продавца маркета',
                            'checked' => false,
                        ],
                        3 => [
                            'id' => 15,
                            'name' => 'С видео',
                            'checked' => false,
                        ],
                        4 => [
                            'id' => 19,
                            'name' => 'С палитрой',
                            'checked' => false,
                        ],
                        5 => [
                            'id' => 8,
                            'name' => 'С размерной сеткой',
                            'checked' => false,
                        ],
                        6 => [
                            'id' => 5,
                            'name' => 'Стоп-бренды',
                            'checked' => false,
                        ],
                        7 => [
                            'id' => 160,
                            'name' => 'Укр. поля',
                            'checked' => false,
                        ],
                    ],
                    'checked' => [
                        8 => false,
                        15 => false,
                        19 => false,
                        127 => false,
                        5 => false,
                        17 => false,
                        160 => false,
                        13 => false,
                    ],
                    'parentTemplates' => [
                        0 => [
                            'id' => 1,
                            'name' => 'Группировка товаров (Определяется типом задачи) =~}!@#$%^&*()_+`-]\'/[;.,}"?{:>|<1001234567890>',
                        ],
                    ],
                    'priorities' => $priorities,
                    'excludedFields' => Constants::EXCLUDED_FIELDS,
                    'rz_categories' => $rzCategories,
                    'templateChildren' => 0,
                    'hadBlockedObservers' => false,
                    'hadBlockedPriority' => false,
                    'hadBlockedCategory' => false,
                    'title' => 'Обновление шаблона для заявки типа "Добавление новых товаров" (направление: "Работа с товарами Маркетплейса" )',
                    'isParent' => false,
                    'userId' => 4,
                ],
            ],
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Получить модель полей по id шаблона (все поля)',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case2.php',
        'provider_data' => [
            'responseBody' => [
                'model' => [
                    'id' => 2,
                    'parent_id' => 1,
                    'name' => 'Добавление/изменение информации',
                    'type_id' => 2,
                    'direction' => 1,
                    'fields' => [
                        'type_id' => '2',
                        'direction' => 1,
                        'priority' => '2',
                        'amount_to_work' => 10,
                        'subject' => '!@#$%^&*()_+`-]\'/[;.,}"?{:>|а Добавление/изменение информации',
                        'description' => '!@#$%^&*()_+`-]\'/[;.,}"?{:>|а',
                        'category_id' => 1,
                        'seller_id' => -2,
                        'planned_finish_date' => '2021-01-01 00:00:05',
                        'rz_category_id' => NULL,
                    ],
                    'user_id' => 4,
                    'seller_id' => -2,
                    'category_id' => 1,
                    'amount_to_work' => 10,
                    'observers' => [
                        0 => 16,
                    ],
                    'rz_category_id' => NULL,
                ],
                'initialValues' => [
                    'seller' => [
                        0 => [
                            'owox_id' => 9423,
                            'title' => 'anytech',
                        ],
                        1 => [
                            'owox_id' => 67757,
                            'title' => 'iTook',
                        ],
                        2 => [
                            'owox_id' => 83,
                            'title' => 'Euromart',
                        ],
                        3 => [
                            'owox_id' => 5,
                            'title' => 'Rozetka',
                        ],
                        4 => [
                            'owox_id' => 72141,
                            'title' => 'Rozetka.md',
                        ],
                        5 => [
                            'owox_id' => 124276,
                            'title' => 'Rozetka.uz',
                        ],
                        6 => [
                            'owox_id' => 128603,
                            'title' => 'RozetkaEU',
                        ],
                        7 => [
                            'owox_id' => -2,
                            'title' => 'Все продавцы',
                        ],
                    ],
                    'checkBoxes' => [
                        0 => [
                            'id' => 126,
                            'name' => 'Добавление/обновление инструкций',
                            'checked' => false,
                        ],
                        1 => [
                            'id' => 12,
                            'name' => 'На основе отзыва клиента на сайте',
                            'checked' => false,
                        ],
                        2 => [
                            'id' => 124,
                            'name' => 'Обновление описания',
                            'checked' => false,
                        ],
                        3 => [
                            'id' => 123,
                            'name' => 'Обновление фото',
                            'checked' => false,
                        ],
                        4 => [
                            'id' => 125,
                            'name' => 'Обновление характеристик',
                            'checked' => false,
                        ],
                        5 => [
                            'id' => 2,
                            'name' => 'Пакетная загрузка',
                            'checked' => false,
                        ],
                        6 => [
                            'id' => 159,
                            'name' => 'По заявке с MobileCourier',
                            'checked' => '1',
                        ],
                        7 => [
                            'id' => 14,
                            'name' => 'Промо-описание',
                            'checked' => '1',
                        ],
                        8 => [
                            'id' => 1,
                            'name' => 'Ручная загрузка',
                            'checked' => true,
                        ],
                        9 => [
                            'id' => 15,
                            'name' => 'С видео',
                            'checked' => false,
                        ],
                        10 => [
                            'id' => 8,
                            'name' => 'С размерной сеткой',
                            'checked' => false,
                        ],
                        11 => [
                            'id' => 9,
                            'name' => 'С тегами к товарам',
                            'checked' => false,
                        ],
                        12 => [
                            'id' => 4,
                            'name' => 'С фотосъемкой',
                            'checked' => false,
                        ],
                        13 => [
                            'id' => 10,
                            'name' => 'Уценка',
                            'checked' => false,
                        ],
                        14 => [
                            'id' => 11,
                            'name' => 'Уценка 2',
                            'checked' => false,
                        ],
                    ],
                    'checked' => [
                        1 => true,
                        2 => false,
                        4 => false,
                        8 => false,
                        9 => false,
                        15 => false,
                        12 => false,
                        14 => '1',
                        10 => false,
                        11 => false,
                        123 => false,
                        124 => false,
                        125 => false,
                        126 => false,
                        159 => '1',
                    ],
                    'parentTemplates' => [
                        0 => [
                            'id' => 1,
                            'name' => 'Группировка товаров (Определяется типом задачи) =~}!@#$%^&*()_+`-]\'/[;.,}"?{:>|<1001234567890>',
                        ],
                    ],
                    'priorities' => $priorities,
                    'excludedFields' => Constants::EXCLUDED_FIELDS,
                    'rz_categories' => $rzCategories,
                    'templateChildren' => 0,
                    'hadBlockedObservers' => true,
                    'hadBlockedPriority' => false,
                    'hadBlockedCategory' => false,
                    'title' => 'Обновление шаблона для заявки типа "Добавление/изменение информации в существующих товарах" (направление: "Работа с товарами Розетки" )',
                    'isParent' => false,
                    'userId' => 4,
                ],
            ],
        ]
    ],

];