<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить список категорий стора',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'responseBody' => [
                [
                    'id' => 753399,
                    'label' => 'Аксессуары для алкоголя (753399) <span>&#10230;</span>  <b>(Авиабилеты) </b>',
                    'parent_id' => 4626923,
                ],
                [
                    'id' => 4626923,
                    'label' => 'Алкогольные напитки и продукты питания (4626923) <span>&#10230;</span>  <b>(Авиабилеты) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 2460402,
                    'label' => 'Архивирование и делопроизводство (2460402) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 2460392,
                ],
                [
                    'id' => 2666302,
                    'label' => 'Архивные короба и боксы (2666302) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 2560747,
                    'label' => 'Банковские принадлежности (2560747) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 2514872,
                    'label' => 'Бейджи, брелоки-идентификаторы, настольные таблички (2514872) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 80025,
                    'label' => 'Бытовая техника, интерьер (80025) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 2514867,
                    'label' => 'Визитницы (2514867) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 4628926,
                    'label' => 'Датеры (4628926) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 2514877,
                ],
                [
                    'id' => 2394297,
                    'label' => 'Дача, сад, огород (2394297) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4655272,
                    'label' => 'Досточки для оттиска (4655272) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 2460392,
                    'label' => 'Канцелярия (2460392) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 4625734,
                ],
                [
                    'id' => 80253,
                    'label' => 'Компьютеры и ноутбуки (80253) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4629305,
                    'label' => 'Красота и здоровье (4629305) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4652996,
                    'label' => 'Мини-бары (4652996) <span>&#10230;</span>  <b>(Авиабилеты) </b>',
                    'parent_id' => 753399,
                ],
                [
                    'id' => 4641568,
                    'label' => 'Настольные картотеки (4641568) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 2973057,
                    'label' => 'Новая категория (2973057) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 3167120,
                    'label' => 'Новая категория (3167120) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 1162030,
                    'label' => 'Одежда, обувь и аксессуары (1162030) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 84625,
                    'label' => 'Оружие (84625) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4629073,
                    'label' => 'Оснастки, штампы стандартные (4629073) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 2514877,
                ],
                [
                    'id' => 4625734,
                    'label' => 'Офис, школа, книги (4625734) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 2581742,
                    'label' => 'Папки и файлы подвесные (2581742) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 2581737,
                    'label' => 'Папки-планшеты (2581737) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 2514862,
                    'label' => 'Папки пластиковые (2514862) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 2581727,
                    'label' => 'Папки-портфели, папки-боксы (2581727) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 2581722,
                    'label' => 'Папки, регистраторы (2581722) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 2581732,
                    'label' => 'Папки-регистраторы (2581732) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 4626584,
                    'label' => 'Папки специальные (4626584) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 2595767,
                    'label' => 'Папки с файлами (2595767) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2581722,
                ],
                [
                    'id' => 4655242,
                    'label' => 'Пломбы и пломбираторы (4655242) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 80260,
                    'label' => 'Подарки и товары для праздников (80260) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 2660622,
                    'label' => 'Разделители и закладки (2660622) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 2898382,
                    'label' => 'Самонаборные штампы, кассы букв (2898382) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 2514877,
                ],
                [
                    'id' => 4628418,
                    'label' => 'Сантехника и ремонт (4628418) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4655216,
                    'label' => 'Сельское хозяйство (4655216) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 80262,
                    'label' => 'Скрытые категории (80262) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4627949,
                    'label' => 'Смартфоны, ТВ и электроника (4627949) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4627893,
                    'label' => 'Спорт и увлечения (4627893) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4655266,
                    'label' => 'Сургуч (4655266) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 4627851,
                    'label' => 'Товары для бизнеса (4627851) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 88468,
                    'label' => 'Товары для детей (88468) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 2394287,
                    'label' => 'Товары для дома (2394287) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 4653017,
                    'label' => 'Упаковки для алкогольных напитков (4653017) <span>&#10230;</span>  <b>(Авиабилеты) </b>',
                    'parent_id' => 753399,
                ],
                [
                    'id' => 4630262,
                    'label' => 'Услуги и сервисы (4630262) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 83850,
                    'label' => 'Уцененные товары (83850) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 0,
                ],
                [
                    'id' => 2514857,
                    'label' => 'Файлы (2514857) <span>&#10230;</span>  <b>(Видео к товару) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 4653010,
                    'label' => 'Фляги (4653010) <span>&#10230;</span>  <b>(Авиабилеты) </b>',
                    'parent_id' => 753399,
                ],
                [
                    'id' => 4628124,
                    'label' => 'Фото и видео (4628124) <span>&#10230;</span>  <b>(Авиабилеты) </b>',
                    'parent_id' => 80258,
                ],
                [
                    'id' => 4630034,
                    'label' => 'Шило, нити и шпагаты (4630034) <span>&#10230;</span>  <b>(Распределить категорию в Lisa) </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 2514877,
                    'label' => 'Штемпельная продукция (2514877) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 2460402,
                ],
                [
                    'id' => 2898387,
                    'label' => 'Штемпельные краски и подушки (2898387) <span>&#10230;</span>  <b>() </b>',
                    'parent_id' => 2514877,
                ],
            ]
        ]
    ],

];
