<?php

return [
    "lisa_fixtures" => [
        "priorities" => [
            [
                //"id" => 1,
                "name" => "Информация необходима для склада",
                "status" => 1
            ],
            [
                //"id" => 2,
                "name" => "Товар-новинка/эксклюзив (трафикообразующий)",
                "status" => 1
            ],
            [
                //"id" => 3,
                "name" => "Значение (не использовать) в фильтре на сайте (и в карточках товаров)",
                "status" => 1
            ],
            [
                //"id" => 4,
                "name" => "Группировка топовых позиций",
                "status" => 1
            ],
            [
                //"id" => 5,
                "name" => "Жалоба клиента (в соц сети, в КЦ, в магазине, руководству)",
                "status" => 1
            ],
            [
                //"id" => 6,
                "name" => "Сезонные товары",
                "status" => 1
            ],
            [
                //"id" => 7,
                "name" => "Приоритетный продавец (ТОП)",
                "status" => 1
            ],
            [
                //"id" => 8,
                "name" => "Неправильные/Битые ссылки (порталы и фат-меню)",
                "status" => 0
            ],
        ],
    ],
];