<?php

return [
    'lisa_fixtures' => [
        'field_values' => [
            [
                //"id" => 1,
                'field_id' => 21,
                'value' => 'Предоставлены продактом',
                'status' => 1,
                'order' => 2
            ],
            [
                //"id" => 5,
                'field_id' => 21,
                'value' => 'Характеристики добавлены с обновлением фото/описания',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 6,
                'field_id' => 22,
                'value' => 'Предоставлены продактом',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 10,
                'field_id' => 22,
                'value' => 'Фото предоставлены фотостудией',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 11,
                'field_id' => 23,
                'value' => 'Предоставлены продактом',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 14,
                'field_id' => 23,
                'value' => 'Не предоставлены продактом. Выполнен поиск.',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 15,
                'field_id' => 24,
                'value' => 'Без обработки (только кадрирование)',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 17,
                'field_id' => 24,
                'value' => 'Удаление теней/фона/ватермарков/цветокорекция',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 18,
                'field_id' => 25,
                'value' => 'Без уточнений',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 20,
                'field_id' => 25,
                'value' => 'Более 5 уточнений',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 21,
                'field_id' => 26,
                'value' => 'Украинский',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 23,
                'field_id' => 26,
                'value' => 'Английский',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 24,
                'field_id' => 27,
                'value' => 'Предоставлено продактом',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 26,
                'field_id' => 27,
                'value' => 'Предоставлено продактом, в плохом качестве (производился поиск)',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 27,
                'field_id' => 28,
                'value' => 'Перенос из текстовых полей/блоков в выборы из списков',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 29,
                'field_id' => 28,
                'value' => 'Перенос из названий товаров в выборы из списков',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 30,
                'field_id' => 29,
                'value' => 'Новые разделы (категории верхнего уровня, второго за верхним уровня)',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 38,
                'field_id' => 29,
                'value' => 'Существующие конечные категории + перенос информации',
                'status' => 0,
                'order' => 8
            ],
            [
                //"id" => 39,
                'field_id' => 30,
                'value' => 'Простые (физические характеристики)',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 47,
                'field_id' => 30,
                'value' => 'Сложные (физические + функциональные + технологические характеристики) несколько видов товара',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 48,
                'field_id' => 31,
                'value' => 'Без варьируемого параметра',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 51,
                'field_id' => 31,
                'value' => 'Три варьируемых параметра',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 52,
                'field_id' => 32,
                'value' => 'Определено какие товары попадают в группу (до 3 категорий)',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 60,
                'field_id' => 32,
                'value' => 'Отдельный список категорий (до 2-х категорий)',
                'status' => 0,
                'order' => 0
            ],
            [
                //"id" => 61,
                'field_id' => 20,
                'value' => '1',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 62,
                'field_id' => 20,
                'value' => '2',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 63,
                'field_id' => 20,
                'value' => '3',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 64,
                'field_id' => 20,
                'value' => '4',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 65,
                'field_id' => 20,
                'value' => '5',
                'status' => 1,
                'order' => 0
            ],
            [
                //"id" => 66,
                'field_id' => 20,
                'value' => '6',
                'status' => 1,
                'order' => 0
            ],
        ],
    ],
];