<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить модель для создания фильтра',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'responseBody' => [
                'model' => [
                    'id' => NULL,
                    'user_id' => NULL,
                    'name' => NULL,
                    'conditions' => [
                        'fields' => [
                        ],
                    ],
                    'order' => NULL,
                    'selectedOtherFields' => [
                    ],
                ],
                'initialValues' => [
                    'fieldInfo' => [
                        'id' => [
                            'label' => 'Номер задачи',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'author_id' => [
                            'label' => 'Автор',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'type_id' => [
                            'label' => 'Тип',
                            'type' => 'select',
                            'value' => [
                                1 => 'Добавление новых товаров',
                                2 => 'Добавление/изменение информации в существующих товарах',
                                3 => 'Перенос товаров',
                                4 => 'Группировка товаров',
                                5 => 'Заливка фото с фотостудии',
                                6 => 'Проверка скрытых товаров',
                                7 => 'Добавление нового портала/раздела фат-меню/категории товаров',
                                8 => 'Добавление/изменение информации в существующих порталах/фат-меню/категориях товаров',
                                9 => 'Добавление параметров/значений',
                                10 => 'Изменение существующих параметров/значений',
                                11 => 'Проектирование структуры',
                                12 => 'Добавление новых СЦ/изменение существующих СЦ',
                                13 => 'Добавление/изменение видео',
                                14 => 'Добавление/изменение размерной сетки',
                                15 => 'Добавление/изменение тегов',
                            ],
                        ],
                        'supervisor_id' => [
                            'label' => 'Супервайзер',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'manager_id' => [
                            'label' => 'Контент-менеджер',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'status' => [
                            'label' => 'Статус',
                            'type' => 'select',
                            'value' => [
                                1 => 'Новая',
                                2 => 'Готова для распределения',
                                3 => 'На доработке',
                                4 => 'Отменена',
                                5 => 'Ожидает взятия в работу',
                                6 => 'В работе',
                                7 => 'Ожидает',
                                8 => 'Частично выполнена',
                                9 => 'Выполнена',
                                11 => 'Закрыта',
                            ],
                        ],
                        'previous_status' => [
                            'label' => 'Предыдущий статус',
                            'type' => 'select',
                            'value' => [
                                1 => 'Новая',
                                2 => 'Готова для распределения',
                                3 => 'На доработке',
                                4 => 'Отменена',
                                5 => 'Ожидает взятия в работу',
                                6 => 'В работе',
                                7 => 'Ожидает',
                                8 => 'Частично выполнена',
                                9 => 'Выполнена',
                                11 => 'Закрыта',
                            ],
                        ],
                        'awaiting_correction' => [
                            'label' => 'На исправление',
                            'type' => 'select',
                            'value' => [
                                0 => 'Нет',
                                1 => 'Да',
                            ],
                        ],
                        'created_at' => [
                            'label' => 'Дата регистрации задачи в системе',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'subject' => [
                            'label' => 'Заголовок',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'description' => [
                            'label' => 'Описание',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'direction' => [
                            'label' => 'Направление задачи',
                            'type' => 'select',
                            'value' => [
                                0 => 'Определяется типом задачи',
                                1 => 'Работа с товарами Розетки',
                                2 => 'Работа с товарами Маркетплейса',
                            ],
                        ],
                        'category_id' => [
                            'label' => 'Категория товаров',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'rz_category_id' => [
                            'label' => 'Категория Rozetka',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'seller_id' => [
                            'label' => 'Продавец',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'amount_to_work' => [
                            'label' => 'Количество в работу',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'recommendations' => [
                            'label' => 'Рекомендации',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'reason' => [
                            'label' => 'Причина отмены/доработки',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'parent_id' => [
                            'label' => 'ID связанной задачи',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'planned_start_date' => [
                            'label' => 'Плановая дата начала работ',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'planned_finish_date' => [
                            'label' => 'Плановая дата завершения',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'actual_start_date' => [
                            'label' => 'Фактическая дата начала работ',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'actual_finish_date' => [
                            'label' => 'Фактическая дата завершения',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'supervisor_process_date' => [
                            'label' => 'Дата обработки задачи супервайзером',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'supervisor_check_date' => [
                            'label' => 'Дата проверки задачи супервайзером',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'result_comment' => [
                            'label' => 'Комментарий к результату задачи',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'supervisor_comment' => [
                            'label' => 'Комментарий супервайзера',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'last_change_status_date' => [
                            'label' => 'Дата последнего изменения статуса',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'report_period_id' => [
                            'label' => 'Отчетный период КМ',
                            'type' => 'select',
                            'value' => [
                                1 => '2020-01-01 - 2020-06-30',
                                2 => '2020-07-01 - 2020-12-31',
                            ],
                        ],
                        'team_direction' => [
                            'label' => 'Направление команды',
                            'type' => 'select',
                            'value' => [
                                1 => 'Управление отделом',
                                2 => 'Работа с товарами Маркетплейса',
                                3 => 'Работа с товарами Rozetka',
                                4 => 'Работа с группами',
                                5 => 'Работа с проектированием структур + фильтрами',
                                6 => 'Работа с порталами, фат-меню, категориями',
                            ],
                        ],
                        'correction_comment' => [
                            'label' => 'Комментарий на исправление',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'priority' => [
                            'label' => 'Приоритет',
                            'type' => 'select',
                            'value' => [
                                1 => 'Информация необходима для склада',
                                3 => 'Исправление критичной ошибки',
                                2 => 'Товар-новинка/эксклюзив (трафикообразующий)',
                            ],
                        ],
                        'sv_report_periods' => [
                            'label' => 'Отчетные периоды СВ',
                            'type' => 'select',
                            'value' => [
                                1 => '2020-01-01 - 2020-06-30',
                                2 => '2020-07-01 - 2020-12-31',
                            ],
                        ],
                        'cross_check_manager_id' => [
                            'label' => 'Кросс-чек менеджер',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'cross_check_status' => [
                            'label' => 'Кросс-чек статус',
                            'type' => 'select',
                            'value' => [
                                0 => 'Не прошла кросс-чек',
                                1 => 'На кросс-чеке',
                                2 => 'Кросс-чек пройден',
                            ],
                        ],
                        'employee_code_1c' => [
                            'label' => 'Код работника 1С',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'child_count' => [
                            'label' => 'Количество созданных подзадач',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'photo_load_status' => [
                            'label' => 'Статус загрузки фото',
                            'type' => 'select',
                            'value' => [
                                0 => 'Нет',
                                1 => 'Да',
                            ],
                        ],
                    ],
                    'dateFields' => [
                        0 => 'created_at',
                        1 => 'planned_start_date',
                        2 => 'planned_finish_date',
                        3 => 'actual_start_date',
                        4 => 'actual_finish_date',
                        5 => 'supervisor_process_date',
                        6 => 'last_change_status_date',
                        7 => 'supervisor_check_date',
                    ],
                    'userFields' => [
                        0 => 'author_id',
                        1 => 'manager_id',
                        2 => 'cross_check_manager_id',
                        3 => 'supervisor_id',
                    ],
                    'specialFields' => [
                        0 => 'seller_id',
                        1 => 'category_id',
                        2 => 'type_id',
                        3 => 'rz_category_id',
                    ],
                    'checkBoxes' => [
                        0 => [
                            1 => 'Ручная загрузка',
                            2 => 'Пакетная загрузка',
                            3 => 'Виза супервайзера',
                        ],
                        1 => [
                            4 => 'С фотосъемкой',
                            6 => 'Точки входа',
                            7 => 'Добавление графики',
                        ],
                        2 => [
                            8 => 'С размерной сеткой',
                            9 => 'С тегами к товарам',
                            10 => 'Уценка',
                        ],
                        3 => [
                            11 => 'Уценка 2',
                            12 => 'На основе отзыва клиента на сайте',
                            13 => 'Жалоба на товар продавца маркета',
                        ],
                        4 => [
                            14 => 'Промо-описание',
                            15 => 'С видео',
                            16 => 'Лоты',
                        ],
                        5 => [
                            17 => 'БУ, REF',
                            18 => 'Добавление товаров в новую категорию',
                            19 => 'С палитрой',
                        ],
                        6 => [
                            123 => 'Обновление фото',
                            124 => 'Обновление описания',
                            125 => 'Обновление характеристик',
                        ],
                        7 => [
                            126 => 'Добавление/обновление инструкций',
                            5 => 'Стоп-бренды',
                            127 => 'Автомодерация',
                        ],
                        8 => [
                            159 => 'По заявке с MobileCourier',
                            160 => 'Укр. поля',
                            169 => 'Алгоритм',
                        ],
                    ],
                    'otherFields' => [
                        0 => 'id',
                        1 => 'status',
                        2 => 'previous_status',
                        3 => 'awaiting_correction',
                        4 => 'subject',
                        5 => 'description',
                        6 => 'direction',
                        7 => 'amount_to_work',
                        8 => 'recommendations',
                        9 => 'parent_id',
                        10 => 'result_comment',
                        11 => 'supervisor_comment',
                        12 => 'report_period_id',
                        13 => 'team_direction',
                        14 => 'correction_comment',
                        15 => 'priority',
                        16 => 'sv_report_periods',
                        17 => 'cross_check_status',
                        18 => 'employee_code_1c',
                        19 => 'child_count',
                        20 => 'photo_load_status',
                    ],
                    'sellers' => [
                    ],
                    'categories' => [
                    ],
                    'rz_categories' => [
//                        [
//                            'title' => 'Алкогольные напитки и продукты питания',
//                            'id' => 4626923,
//                        ],
                        [
                            'title' => 'Бытовая техника, интерьер',
                            'id' => 80025,
                        ],
                        [
                            'title' => 'Дача, сад, огород',
                            'id' => 2394297,
                        ],
                        [
                            'title' => 'Компьютеры и ноутбуки',
                            'id' => 80253,
                        ],
                        [
                            'title' => 'Красота и здоровье',
                            'id' => 4629305,
                        ],
                        [
                            'title' => 'Одежда, обувь и аксессуары',
                            'id' => 1162030,
                        ],
                        [
                            'title' => 'Оружие',
                            'id' => 84625,
                        ],
//                        [
//                            'title' => 'Офис, школа, книги',
//                            'id' => 4625734,
//                        ],
                        [
                            'title' => 'Подарки и товары для праздников',
                            'id' => 80260,
                        ],
                        [
                            'title' => 'Сантехника и ремонт',
                            'id' => 4628418,
                        ],
                        [
                            'title' => 'Сельское хозяйство',
                            'id' => 4655216,
                        ],
                        [
                            'title' => 'Скрытые категории',
                            'id' => 80262,
                        ],
                        [
                            'title' => 'Смартфоны, ТВ и электроника',
                            'id' => 4627949,
                        ],
                        [
                            'title' => 'Спорт и увлечения',
                            'id' => 4627893,
                        ],
                        [
                            'title' => 'Товары для бизнеса',
                            'id' => 4627851,
                        ],
                        [
                            'title' => 'Товары для детей',
                            'id' => 88468,
                        ],
                        [
                            'title' => 'Товары для дома',
                            'id' => 2394287,
                        ],
                        [
                            'title' => 'Услуги и сервисы',
                            'id' => 4630262,
                        ],
                        [
                            'title' => 'Уцененные товары',
                            'id' => 83850,
                        ],
//                        [
//                            'title' => 'Аксессуары для алкоголя',
//                            'id' => 753399,
//                        ],
                        [
                            'title' => 'Мини-бары',
                            'id' => 4652996,
                        ],
                        [
                            'title' => 'Фляги',
                            'id' => 4653010,
                        ],
                        [
                            'title' => 'Упаковки для алкогольных напитков',
                            'id' => 4653017,
                        ],
                        [
                            'title' => 'Фото и видео',
                            'id' => 4628124,
                        ],
                        [
                            'title' => 'Файлы',
                            'id' => 2514857,
                        ],
                        [
                            'title' => 'Визитницы',
                            'id' => 2514867,
                        ],
                        [
                            'title' => 'Бейджи, брелоки-идентификаторы, настольные таблички',
                            'id' => 2514872,
                        ],
                        [
                            'title' => 'Банковские принадлежности',
                            'id' => 2560747,
                        ],
//                        [
//                            'title' => 'Папки, регистраторы',
//                            'id' => 2581722,
//                        ],
                        [
                            'title' => 'Папки пластиковые',
                            'id' => 2514862,
                        ],
                        [
                            'title' => 'Папки-портфели, папки-боксы',
                            'id' => 2581727,
                        ],
                        [
                            'title' => 'Папки-регистраторы',
                            'id' => 2581732,
                        ],
                        [
                            'title' => 'Папки-планшеты',
                            'id' => 2581737,
                        ],
                        [
                            'title' => 'Папки и файлы подвесные',
                            'id' => 2581742,
                        ],
                        [
                            'title' => 'Папки с файлами',
                            'id' => 2595767,
                        ],
                        [
                            'title' => 'Архивные короба и боксы',
                            'id' => 2666302,
                        ],
                        [
                            'title' => 'Папки специальные',
                            'id' => 4626584,
                        ],
                        [
                            'title' => 'Разделители и закладки',
                            'id' => 2660622,
                        ],
                        [
                            'title' => 'Новая категория',
                            'id' => 2973057,
                        ],
                        [
                            'title' => 'Новая категория',
                            'id' => 3167120,
                        ],
                        [
                            'title' => 'Шило, нити и шпагаты',
                            'id' => 4630034,
                        ],
                        [
                            'title' => 'Настольные картотеки',
                            'id' => 4641568,
                        ],
                        [
                            'title' => 'Пломбы и пломбираторы',
                            'id' => 4655242,
                        ],
                        [
                            'title' => 'Сургуч',
                            'id' => 4655266,
                        ],
                        [
                            'title' => 'Досточки для оттиска',
                            'id' => 4655272,
                        ],
//                        [
//                            'title' => 'Канцелярия',
//                            'id' => 2460392,
//                        ],
//                        [
//                            'title' => 'Архивирование и делопроизводство',
//                            'id' => 2460402,
//                        ],
//                        [
//                            'title' => 'Штемпельная продукция',
//                            'id' => 2514877,
//                        ],
                        [
                            'title' => 'Самонаборные штампы, кассы букв',
                            'id' => 2898382,
                        ],
                        [
                            'title' => 'Штемпельные краски и подушки',
                            'id' => 2898387,
                        ],
                        [
                            'title' => 'Датеры',
                            'id' => 4628926,
                        ],
                        [
                            'title' => 'Оснастки, штампы стандартные',
                            'id' => 4629073,
                        ],
                    ],
                ],
            ],
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Получить модель для редактирования фильтра',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'id' => 2,
            'responseBody' => [
                'model' => [
                    'id' => 2,
                    'user_id' => 4,
                    'name' => 'Фильтр2',
                    'conditions' => [
                        'fields' => [
                            0 => 10,
                            1 => 11,
                            2 => 126,
                            3 => 127,
                            4 => 12,
                            5 => 8,
                            6 => '169',
                            7 => '160',
                            8 => '159',
                        ],
                        'author_id' => [
                            0 => '15',
                            1 => '19',
                            2 => '17',
                        ],
                        'manager_id' => [
                            0 => '11',
                            1 => '13',
                        ],
                        'supervisor_id' => [
                            0 => '33',
                            1 => '35',
                            2 => '6',
                        ],
                        'rz_category_id' => [
                            0 => 2394297,
                            1 => 4626923,
                            2 => 4629073,
                            3 => 4629305,
                        ],
                        'report_period_id' => [
                            0 => '1',
                            1 => '2',
                        ],
                        'photo_load_status' => [
                            0 => '1',
                            1 => '0',
                        ],
                        'sv_report_periods' => [
                            0 => '1',
                            1 => '2',
                        ],
                        'actual_finish_date' => '2020-05-25 00:00to2020-05-31 23:59',
                        'correction_comment' => '250~!@#$%^&*()_+`=-]\'/[;.,}"?{:><|1234567890абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄҐЇІ',
                        'cross_check_status' => [
                            0 => '2',
                        ],
                        'supervisor_comment' => '250~!@#$%^&*()_+`=-]\'/[;.,}"?{:><|1234567890абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄҐЇІ',
                        'awaiting_correction' => '1',
                        'supervisor_check_date' => '2021-08-01 00:00:00to2021-08-31 23:59:59',
                        'last_change_status_date' => '2020-06-08 00:00to2020-06-14 23:59',
                        'supervisor_process_date' => '2020-06-01 00:00to2020-06-07 23:59',
                    ],
                    'order' => 1,
                    'selectedOtherFields' => [
                        0 => 'report_period_id',
                        1 => 'photo_load_status',
                        2 => 'sv_report_periods',
                        3 => 'correction_comment',
                        4 => 'cross_check_status',
                        5 => 'supervisor_comment',
                        6 => 'awaiting_correction',
                    ],
                ],
                'initialValues' => [
                    'fieldInfo' => [
                        'id' => [
                            'label' => 'Номер задачи',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'author_id' => [
                            'label' => 'Автор',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'type_id' => [
                            'label' => 'Тип',
                            'type' => 'select',
                            'value' => [
                                1 => 'Добавление новых товаров',
                                2 => 'Добавление/изменение информации в существующих товарах',
                                3 => 'Перенос товаров',
                                4 => 'Группировка товаров',
                                5 => 'Заливка фото с фотостудии',
                                6 => 'Проверка скрытых товаров',
                                7 => 'Добавление нового портала/раздела фат-меню/категории товаров',
                                8 => 'Добавление/изменение информации в существующих порталах/фат-меню/категориях товаров',
                                9 => 'Добавление параметров/значений',
                                10 => 'Изменение существующих параметров/значений',
                                11 => 'Проектирование структуры',
                                12 => 'Добавление новых СЦ/изменение существующих СЦ',
                                13 => 'Добавление/изменение видео',
                                14 => 'Добавление/изменение размерной сетки',
                                15 => 'Добавление/изменение тегов',
                            ],
                        ],
                        'supervisor_id' => [
                            'label' => 'Супервайзер',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'manager_id' => [
                            'label' => 'Контент-менеджер',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'status' => [
                            'label' => 'Статус',
                            'type' => 'select',
                            'value' => [
                                1 => 'Новая',
                                2 => 'Готова для распределения',
                                3 => 'На доработке',
                                4 => 'Отменена',
                                5 => 'Ожидает взятия в работу',
                                6 => 'В работе',
                                7 => 'Ожидает',
                                8 => 'Частично выполнена',
                                9 => 'Выполнена',
                                11 => 'Закрыта',
                            ],
                        ],
                        'previous_status' => [
                            'label' => 'Предыдущий статус',
                            'type' => 'select',
                            'value' => [
                                1 => 'Новая',
                                2 => 'Готова для распределения',
                                3 => 'На доработке',
                                4 => 'Отменена',
                                5 => 'Ожидает взятия в работу',
                                6 => 'В работе',
                                7 => 'Ожидает',
                                8 => 'Частично выполнена',
                                9 => 'Выполнена',
                                11 => 'Закрыта',
                            ],
                        ],
                        'awaiting_correction' => [
                            'label' => 'На исправление',
                            'type' => 'select',
                            'value' => [
                                0 => 'Нет',
                                1 => 'Да',
                            ],
                        ],
                        'created_at' => [
                            'label' => 'Дата регистрации задачи в системе',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'subject' => [
                            'label' => 'Заголовок',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'description' => [
                            'label' => 'Описание',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'direction' => [
                            'label' => 'Направление задачи',
                            'type' => 'select',
                            'value' => [
                                0 => 'Определяется типом задачи',
                                1 => 'Работа с товарами Розетки',
                                2 => 'Работа с товарами Маркетплейса',
                            ],
                        ],
                        'category_id' => [
                            'label' => 'Категория товаров',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'rz_category_id' => [
                            'label' => 'Категория Rozetka',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'seller_id' => [
                            'label' => 'Продавец',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'amount_to_work' => [
                            'label' => 'Количество в работу',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'recommendations' => [
                            'label' => 'Рекомендации',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'reason' => [
                            'label' => 'Причина отмены/доработки',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'parent_id' => [
                            'label' => 'ID связанной задачи',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'planned_start_date' => [
                            'label' => 'Плановая дата начала работ',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'planned_finish_date' => [
                            'label' => 'Плановая дата завершения',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'actual_start_date' => [
                            'label' => 'Фактическая дата начала работ',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'actual_finish_date' => [
                            'label' => 'Фактическая дата завершения',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'supervisor_process_date' => [
                            'label' => 'Дата обработки задачи супервайзером',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'supervisor_check_date' => [
                            'label' => 'Дата проверки задачи супервайзером',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'result_comment' => [
                            'label' => 'Комментарий к результату задачи',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'supervisor_comment' => [
                            'label' => 'Комментарий супервайзера',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'last_change_status_date' => [
                            'label' => 'Дата последнего изменения статуса',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'report_period_id' => [
                            'label' => 'Отчетный период КМ',
                            'type' => 'select',
                            'value' => [
                                1 => '2020-01-01 - 2020-06-30',
                                2 => '2020-07-01 - 2020-12-31',
                            ],
                        ],
                        'team_direction' => [
                            'label' => 'Направление команды',
                            'type' => 'select',
                            'value' => [
                                1 => 'Управление отделом',
                                2 => 'Работа с товарами Маркетплейса',
                                3 => 'Работа с товарами Rozetka',
                                4 => 'Работа с группами',
                                5 => 'Работа с проектированием структур + фильтрами',
                                6 => 'Работа с порталами, фат-меню, категориями',
                            ],
                        ],
                        'correction_comment' => [
                            'label' => 'Комментарий на исправление',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'priority' => [
                            'label' => 'Приоритет',
                            'type' => 'select',
                            'value' => [
                                1 => 'Информация необходима для склада',
                                3 => 'Исправление критичной ошибки',
                                2 => 'Товар-новинка/эксклюзив (трафикообразующий)',
                            ],
                        ],
                        'sv_report_periods' => [
                            'label' => 'Отчетные периоды СВ',
                            'type' => 'select',
                            'value' => [
                                1 => '2020-01-01 - 2020-06-30',
                                2 => '2020-07-01 - 2020-12-31',
                            ],
                        ],
                        'cross_check_manager_id' => [
                            'label' => 'Кросс-чек менеджер',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'cross_check_status' => [
                            'label' => 'Кросс-чек статус',
                            'type' => 'select',
                            'value' => [
                                0 => 'Не прошла кросс-чек',
                                1 => 'На кросс-чеке',
                                2 => 'Кросс-чек пройден',
                            ],
                        ],
                        'employee_code_1c' => [
                            'label' => 'Код работника 1С',
                            'type' => 'string',
                            'value' => '',
                        ],
                        'child_count' => [
                            'label' => 'Количество созданных подзадач',
                            'type' => 'int',
                            'value' => '',
                        ],
                        'photo_load_status' => [
                            'label' => 'Статус загрузки фото',
                            'type' => 'select',
                            'value' => [
                                0 => 'Нет',
                                1 => 'Да',
                            ],
                        ],
                    ],
                    'dateFields' => [
                        0 => 'created_at',
                        1 => 'planned_start_date',
                        2 => 'planned_finish_date',
                        3 => 'actual_start_date',
                        4 => 'actual_finish_date',
                        5 => 'supervisor_process_date',
                        6 => 'last_change_status_date',
                        7 => 'supervisor_check_date',
                    ],
                    'userFields' => [
                        0 => 'author_id',
                        1 => 'manager_id',
                        2 => 'cross_check_manager_id',
                        3 => 'supervisor_id',
                    ],
                    'specialFields' => [
                        0 => 'seller_id',
                        1 => 'category_id',
                        2 => 'type_id',
                        3 => 'rz_category_id',
                    ],
                    'checkBoxes' => [
                        0 => [
                            1 => 'Ручная загрузка',
                            2 => 'Пакетная загрузка',
                            3 => 'Виза супервайзера',
                        ],
                        1 => [
                            4 => 'С фотосъемкой',
                            6 => 'Точки входа',
                            7 => 'Добавление графики',
                        ],
                        2 => [
                            8 => 'С размерной сеткой',
                            9 => 'С тегами к товарам',
                            10 => 'Уценка',
                        ],
                        3 => [
                            11 => 'Уценка 2',
                            12 => 'На основе отзыва клиента на сайте',
                            13 => 'Жалоба на товар продавца маркета',
                        ],
                        4 => [
                            14 => 'Промо-описание',
                            15 => 'С видео',
                            16 => 'Лоты',
                        ],
                        5 => [
                            17 => 'БУ, REF',
                            18 => 'Добавление товаров в новую категорию',
                            19 => 'С палитрой',
                        ],
                        6 => [
                            123 => 'Обновление фото',
                            124 => 'Обновление описания',
                            125 => 'Обновление характеристик',
                        ],
                        7 => [
                            126 => 'Добавление/обновление инструкций',
                            5 => 'Стоп-бренды',
                            127 => 'Автомодерация',
                        ],
                        8 => [
                            159 => 'По заявке с MobileCourier',
                            160 => 'Укр. поля',
                            169 => 'Алгоритм',
                        ],
                    ],
                    'otherFields' => [
                        0 => 'id',
                        1 => 'status',
                        2 => 'previous_status',
                        3 => 'awaiting_correction',
                        4 => 'subject',
                        5 => 'description',
                        6 => 'direction',
                        7 => 'amount_to_work',
                        8 => 'recommendations',
                        9 => 'parent_id',
                        10 => 'result_comment',
                        11 => 'supervisor_comment',
                        12 => 'report_period_id',
                        13 => 'team_direction',
                        14 => 'correction_comment',
                        15 => 'priority',
                        16 => 'sv_report_periods',
                        17 => 'cross_check_status',
                        18 => 'employee_code_1c',
                        19 => 'child_count',
                        20 => 'photo_load_status',
                    ],
                    'sellers' => [
                    ],
                    'categories' => [
                    ],
                    'rz_categories' => [
//                        0 => [
//                            'title' => 'Алкогольные напитки и продукты питания',
//                            'id' => 4626923,
//                        ],
                        [
                            'title' => 'Дача, сад, огород',
                            'id' => 2394297,
                        ],
                        [
                            'title' => 'Красота и здоровье',
                            'id' => 4629305,
                        ],
                        [
                            'title' => 'Оснастки, штампы стандартные',
                            'id' => 4629073,
                        ],
                    ],
                ],
            ],
        ]
    ],

];
