<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Удаление нотификаций старше 1 месяца',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'db' => [
                'lisa_fixtures' => [
                    'user_notifications' => [
                        [
                            "id" => 1,
                            "user_id" => 4,
                            "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                            "status" => 1,
                            "created_at" => date("Y-m-d H:i:s"),
                            "request_id" => 1,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "id" => 2,
                            "user_id" => 6,
                            "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                            "status" => 0,
                            "created_at" => date("Y-m-d H:i:s", strtotime('-1 day')),
                            "request_id" => 1,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "id" => 3,
                            "user_id" => 15,
                            "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                            "status" => 0,
                            "created_at" => date("Y-m-d H:i:s", strtotime('-1 week')),
                            "request_id" => 1,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "id" => 4,
                            "user_id" => 17,
                            "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                            "status" => 0,
                            "created_at" => date("Y-m-d H:i:s", strtotime('-2 week')),
                            "request_id" => 1,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "id" => 5,
                            "user_id" => 4,
                            "notification" => "Заявка <b>№1</b> <b>\"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Новая\"</b> на <b>\"Взята на проверку\"</b> пользователем <b>Супервайзер Начальникович 1</b>",
                            "status" => 0,
                            "created_at" => date("Y-m-d H:i:s", strtotime('-3 week')),
                            "request_id" => 1,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "id" => 6,
                            "user_id" => 6,
                            "notification" => "Заявка <b>№1</b> <b>\"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Новая\"</b> на <b>\"Взята на проверку\"</b> пользователем <b>Супервайзер Начальникович 1</b>",
                            "status" => 0,
                            "created_at" => date("Y-m-d H:i:s", strtotime('-1 month')),
                            "request_id" => 1,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "id" => 7,
                            "user_id" => 15,
                            "notification" => "Заявка <b>№1</b> <b>\"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Новая\"</b> на <b>\"Взята на проверку\"</b> пользователем <b>Супервайзер Начальникович 1</b>",
                            "status" => 0,
                            "created_at" => date("Y-m-d H:i:s", strtotime('-1 month 1 day')),
                            "request_id" => 1,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "id" => 12,
                            "user_id" => 34,
                            "notification" => "Заявка <b>№2</b> <b>\"Добавление параметров/значений (Определяется типом задачи)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Новая\"</b> на <b>\"На доработке\"</b> пользователем <b>Супервайзер Проектенко 14</b> по причине <b>Затребовать изменения </b>абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО",
                            "status" => 0,
                            "created_at" => date("Y-m-d H:i:s", strtotime('-1 minute')),
                            "request_id" => 2,
                            "priority" => 2,
                            "recipients" => "Константин Куцан, Супервайзер Проектенко 14"
                        ]
                    ],
                ]
            ],
        ]
    ],
];
