<?php

return [
    "lisa_fixtures" => [
        "field_values" => [
            [
                //"id" => 1,
                "field_id" => 21,
                "value" => "!@#$%^&*()_+`=-]'/[;.,}\"?{:><\|1234567890абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄҐЇІ",
                "status" => 1
            ],
            [
                //"id" => 2,
                "field_id" => 22,
                "value" => "!@#$%^&*()_+`=-]'/[;.,}\"?{:><\|1234567890абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄҐЇІ",
                "status" => 0
            ],
        ],
    ],
];