<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить список значений полей без порядка',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'id' => 21,
            'responseBody' => [
                0 => [
                    'id' => 5,
                    'field_id' => 21,
                    'value' => 'Характеристики добавлены с обновлением фото/описания',
                    'status' => 0,
                    'order' => 0,
                ],
                1 => [
                    'id' => 4,
                    'field_id' => 21,
                    'value' => 'Не предоставлены продактом. Выполнен поиск.',
                    'status' => 1,
                    'order' => 1,
                ],
                2 => [
                    'id' => 1,
                    'field_id' => 21,
                    'value' => 'Предоставлены продактом',
                    'status' => 1,
                    'order' => 2,
                ],
                3 => [
                    'id' => 2,
                    'field_id' => 21,
                    'value' => 'Предоставлены продактом частично. Без дополнительного поиска.',
                    'status' => 1,
                    'order' => 3,
                ],
                4 => [
                    'id' => 3,
                    'field_id' => 21,
                    'value' => 'Предоставлены продактом частично. С дополнительным поиском.',
                    'status' => 1,
                    'order' => 4,
                ],
            ]
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Получить список значений полей без порядка',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'id' => 30,
            'responseBody' => [
                0 => [
                    'id' => 39,
                    'field_id' => 30,
                    'value' => 'Простые (физические характеристики)',
                    'status' => 1,
                    'order' => 0,
                ],
                1 => [
                    'id' => 40,
                    'field_id' => 30,
                    'value' => 'Простые (физические характеристики) 1 вид товара',
                    'status' => 1,
                    'order' => 0,
                ],
                2 => [
                    'id' => 41,
                    'field_id' => 30,
                    'value' => 'Простые (физические характеристики) несколько видов товара',
                    'status' => 1,
                    'order' => 0,
                ],
                3 => [
                    'id' => 42,
                    'field_id' => 30,
                    'value' => 'Средней сложности (физические + функциональные характеристики)',
                    'status' => 1,
                    'order' => 0,
                ],
                4 => [
                    'id' => 43,
                    'field_id' => 30,
                    'value' => 'Средней сложности (физические + функциональные характеристики) 1 вид товара',
                    'status' => 1,
                    'order' => 0,
                ],
                5 => [
                    'id' => 44,
                    'field_id' => 30,
                    'value' => 'Средней сложности (физические + функциональные характеристики) несколько видов товара',
                    'status' => 1,
                    'order' => 0,
                ],
                6 => [
                    'id' => 45,
                    'field_id' => 30,
                    'value' => 'Сложные (физические + функциональные + технологические характеристики)',
                    'status' => 1,
                    'order' => 0,
                ],
                7 => [
                    'id' => 46,
                    'field_id' => 30,
                    'value' => 'Сложные (физические + функциональные + технологические характеристики) 1 вид товара',
                    'status' => 1,
                    'order' => 0,
                ],
                8 => [
                    'id' => 47,
                    'field_id' => 30,
                    'value' => 'Сложные (физические + функциональные + технологические характеристики) несколько видов товара',
                    'status' => 0,
                    'order' => 0,
                ],
            ]
        ]
    ],

];
