<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Значения выпадающих списков полей результатов задачи в настроенном/алфавитном порядке + показываются заблоченные',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'url' => '/request/view/2',
            'jsonPath' => '$.fieldsData.requestResult.selects',
            'responseBody' => [
                0 => [
                    'id' => 21,
                    'name' => 'Наличие характеристик к товарам',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 5,
                            'text' => 'Характеристики добавлены с обновлением фото/описания',
                            'disabled' => true,
                        ],
                        1 => [
                            'value' => 4,
                            'text' => 'Не предоставлены продактом. Выполнен поиск.',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 1,
                            'text' => 'Предоставлены продактом',
                            'disabled' => false,
                        ],
                        3 => [
                            'value' => 2,
                            'text' => 'Предоставлены продактом частично. Без дополнительного поиска.',
                            'disabled' => false,
                        ],
                        4 => [
                            'value' => 3,
                            'text' => 'Предоставлены продактом частично. С дополнительным поиском.',
                            'disabled' => false,
                        ],
                    ],
                ],
                1 => [
                    'id' => 23,
                    'name' => 'Наличие описаний к товарам',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 14,
                            'text' => 'Не предоставлены продактом. Выполнен поиск.',
                            'disabled' => true,
                        ],
                        1 => [
                            'value' => 11,
                            'text' => 'Предоставлены продактом',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 12,
                            'text' => 'Предоставлены продактом частично. Без дополнительного поиска.',
                            'disabled' => false,
                        ],
                        3 => [
                            'value' => 13,
                            'text' => 'Предоставлены продактом частично. С дополнительным поиском.',
                            'disabled' => false,
                        ],
                    ],
                ],
                2 => [
                    'id' => 22,
                    'name' => 'Наличие фото к товарам',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 9,
                            'text' => 'Не предоставлены продактом. Выполнен поиск.',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 6,
                            'text' => 'Предоставлены продактом',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 7,
                            'text' => 'Предоставлены продактом частично. Без дополнительного поиска.',
                            'disabled' => false,
                        ],
                        3 => [
                            'value' => 8,
                            'text' => 'Предоставлены продактом частично. С дополнительным поиском.',
                            'disabled' => false,
                        ],
                        4 => [
                            'value' => 10,
                            'text' => 'Фото предоставлены фотостудией',
                            'disabled' => true,
                        ],
                    ],
                ],
                3 => [
                    'id' => 24,
                    'name' => 'Обработка фото',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 15,
                            'text' => 'Без обработки (только кадрирование)',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 17,
                            'text' => 'Удаление теней/фона/ватермарков/цветокорекция',
                            'disabled' => true,
                        ],
                        2 => [
                            'value' => 16,
                            'text' => 'Удаление теней/фона (простая обработка)',
                            'disabled' => false,
                        ],
                    ],
                ],
                4 => [
                    'id' => 27,
                    'name' => 'Видео к товарам',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 25,
                            'text' => 'Добавлено по собственной инициативе',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 24,
                            'text' => 'Предоставлено продактом',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 26,
                            'text' => 'Предоставлено продактом, в плохом качестве (производился поиск)',
                            'disabled' => true,
                        ],
                    ],
                ],
                5 => [
                    'id' => 31,
                    'name' => 'Группировка товаров (наличие варьируемых параметров)',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 48,
                            'text' => 'Без варьируемого параметра',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 50,
                            'text' => 'Два варьируемых параметра',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 49,
                            'text' => 'Один варьируемый параметр',
                            'disabled' => false,
                        ],
                        3 => [
                            'value' => 51,
                            'text' => 'Три варьируемых параметра',
                            'disabled' => true,
                        ],
                    ],
                ],
                6 => [
                    'id' => 25,
                    'name' => 'Уточнения. Количество уточнений у автора.',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 18,
                            'text' => 'Без уточнений',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 20,
                            'text' => 'Более 5 уточнений',
                            'disabled' => true,
                        ],
                        2 => [
                            'value' => 19,
                            'text' => 'Менее 5 уточнений',
                            'disabled' => false,
                        ],
                    ],
                ],
                7 => [
                    'id' => 26,
                    'name' => 'Язык информации',
                    'type' => 'select',
                    'status' => 1,
                    'disabled' => false,
                    'values' => [
                        0 => [
                            'value' => 23,
                            'text' => 'Английский',
                            'disabled' => true,
                        ],
                        1 => [
                            'value' => 21,
                            'text' => 'Русский',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 22,
                            'text' => 'Украинский',
                            'disabled' => false,
                        ],
                    ],
                ],
            ]
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Значения выпадающих списков полей структуры и сложности в настроенном/алфавитном порядке + показываются заблоченные',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'url' => '/request/view/1',
            'jsonPath' => '$.fieldsData.additionalFields',
            'responseBody' => [
                0 => [
                    'id' => 20,
                    'name' => 'Уровень сложности задачи',
                    'type' => 'select',
                    'value' => 0,
                    'disabled' => false,
                    'items' => [
                        0 => [
                            'value' => 61,
                            'text' => '1',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 62,
                            'text' => '2',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 63,
                            'text' => '3',
                            'disabled' => false,
                        ],
                        3 => [
                            'value' => 64,
                            'text' => '4',
                            'disabled' => false,
                        ],
                        4 => [
                            'value' => 65,
                            'text' => '5',
                            'disabled' => false,
                        ],
                        5 => [
                            'value' => 66,
                            'text' => '6',
                            'disabled' => false,
                        ],
                    ],
                ],
                1 => [
                    'id' => 30,
                    'name' => 'Сложность структуры',
                    'type' => 'select',
                    'value' => 0,
                    'disabled' => false,
                    'items' => [
                        0 => [
                            'value' => 39,
                            'text' => 'Простые (физические характеристики)',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 40,
                            'text' => 'Простые (физические характеристики) 1 вид товара',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 41,
                            'text' => 'Простые (физические характеристики) несколько видов товара',
                            'disabled' => false,
                        ],
                        3 => [
                            'value' => 45,
                            'text' => 'Сложные (физические + функциональные + технологические характеристики)',
                            'disabled' => false,
                        ],
                        4 => [
                            'value' => 46,
                            'text' => 'Сложные (физические + функциональные + технологические характеристики) 1 вид товара',
                            'disabled' => false,
                        ],
                        5 => [
                            'value' => 47,
                            'text' => 'Сложные (физические + функциональные + технологические характеристики) несколько видов товара',
                            'disabled' => true,
                        ],
                        6 => [
                            'value' => 42,
                            'text' => 'Средней сложности (физические + функциональные характеристики)',
                            'disabled' => false,
                        ],
                        7 => [
                            'value' => 43,
                            'text' => 'Средней сложности (физические + функциональные характеристики) 1 вид товара',
                            'disabled' => false,
                        ],
                        8 => [
                            'value' => 44,
                            'text' => 'Средней сложности (физические + функциональные характеристики) несколько видов товара',
                            'disabled' => false,
                        ],
                    ],
                ],
                2 => [
                    'id' => 29,
                    'name' => 'Вид структуры',
                    'type' => 'select',
                    'value' => 0,
                    'disabled' => false,
                    'items' => [
                        0 => [
                            'value' => 30,
                            'text' => 'Новые разделы (категории верхнего уровня, второго за верхним уровня)',
                            'disabled' => false,
                        ],
                        1 => [
                            'value' => 31,
                            'text' => 'Новые категории промежуточных уровней/автопорталы',
                            'disabled' => false,
                        ],
                        2 => [
                            'value' => 32,
                            'text' => 'Новые конечные категории',
                            'disabled' => false,
                        ],
                        3 => [
                            'value' => 33,
                            'text' => 'Существующие разделы (категории верхнего уровня, второго за верхним уровня)',
                            'disabled' => false,
                        ],
                        4 => [
                            'value' => 34,
                            'text' => 'Существующие категории промежуточных уровней/автопорталы',
                            'disabled' => false,
                        ],
                        5 => [
                            'value' => 35,
                            'text' => 'Существующие конечные категории',
                            'disabled' => false,
                        ],
                        6 => [
                            'value' => 36,
                            'text' => 'Существующие разделы (категории верхнего уровня, второго за верхним уровня) + перенос информации',
                            'disabled' => false,
                        ],
                        7 => [
                            'value' => 37,
                            'text' => 'Существующие категории промежуточных уровней/автопорталы + перенос информации',
                            'disabled' => false,
                        ],
                        8 => [
                            'value' => 38,
                            'text' => 'Существующие конечные категории + перенос информации',
                            'disabled' => true,
                        ],
                    ],
                ],
            ]
        ]
    ],

    'case3' => [
        'setting' => [
            'description' => 'Значения выпадающих списков пакетного редактирования в настроенном/алфавитном порядке + НЕ показываются заблоченные',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'url' => '/request/mass-editing?tab=all',
            'jsonPath' => '$',
            'responseBody' => [
                'fields' => [
                    0 => [
                        'id' => 20,
                        'name' => 'Уровень сложности задачи',
                        'values' => [
                            0 => [
                                'value' => '1',
                                'id' => 61,
                                'field_id' => 20,
                            ],
                            1 => [
                                'value' => '2',
                                'id' => 62,
                                'field_id' => 20,
                            ],
                            2 => [
                                'value' => '3',
                                'id' => 63,
                                'field_id' => 20,
                            ],
                            3 => [
                                'value' => '4',
                                'id' => 64,
                                'field_id' => 20,
                            ],
                            4 => [
                                'value' => '5',
                                'id' => 65,
                                'field_id' => 20,
                            ],
                            5 => [
                                'value' => '6',
                                'id' => 66,
                                'field_id' => 20,
                            ],
                        ],
                    ],
                    1 => [
                        'id' => 29,
                        'name' => 'Вид структуры',
                        'values' => [
                            0 => [
                                'value' => 'Новые разделы (категории верхнего уровня, второго за верхним уровня)',
                                'id' => 30,
                                'field_id' => 29,
                            ],
                            1 => [
                                'value' => 'Новые категории промежуточных уровней/автопорталы',
                                'id' => 31,
                                'field_id' => 29,
                            ],
                            2 => [
                                'value' => 'Новые конечные категории',
                                'id' => 32,
                                'field_id' => 29,
                            ],
                            3 => [
                                'value' => 'Существующие разделы (категории верхнего уровня, второго за верхним уровня)',
                                'id' => 33,
                                'field_id' => 29,
                            ],
                            4 => [
                                'value' => 'Существующие категории промежуточных уровней/автопорталы',
                                'id' => 34,
                                'field_id' => 29,
                            ],
                            5 => [
                                'value' => 'Существующие конечные категории',
                                'id' => 35,
                                'field_id' => 29,
                            ],
                            6 => [
                                'value' => 'Существующие разделы (категории верхнего уровня, второго за верхним уровня) + перенос информации',
                                'id' => 36,
                                'field_id' => 29,
                            ],
                            7 => [
                                'value' => 'Существующие категории промежуточных уровней/автопорталы + перенос информации',
                                'id' => 37,
                                'field_id' => 29,
                            ],
                        ],
                    ],
                    2 => [
                        'id' => 30,
                        'name' => 'Сложность структуры',
                        'values' => [
                            0 => [
                                'value' => 'Простые (физические характеристики)',
                                'id' => 39,
                                'field_id' => 30,
                            ],
                            1 => [
                                'value' => 'Простые (физические характеристики) 1 вид товара',
                                'id' => 40,
                                'field_id' => 30,
                            ],
                            2 => [
                                'value' => 'Простые (физические характеристики) несколько видов товара',
                                'id' => 41,
                                'field_id' => 30,
                            ],
                            3 => [
                                'value' => 'Сложные (физические + функциональные + технологические характеристики)',
                                'id' => 45,
                                'field_id' => 30,
                            ],
                            4 => [
                                'value' => 'Сложные (физические + функциональные + технологические характеристики) 1 вид товара',
                                'id' => 46,
                                'field_id' => 30,
                            ],
                            5 => [
                                'value' => 'Средней сложности (физические + функциональные характеристики)',
                                'id' => 42,
                                'field_id' => 30,
                            ],
                            6 => [
                                'value' => 'Средней сложности (физические + функциональные характеристики) 1 вид товара',
                                'id' => 43,
                                'field_id' => 30,
                            ],
                            7 => [
                                'value' => 'Средней сложности (физические + функциональные характеристики) несколько видов товара',
                                'id' => 44,
                                'field_id' => 30,
                            ],
                        ],
                    ],
                    3 => [
                        'id' => 32,
                        'name' => 'Сложность группировки в заявках',
                        'values' => [
                            0 => [
                                'value' => 'Есть артикул или модель в больше, чем 50% товаров (3 и больше категорий)',
                                'id' => 55,
                                'field_id' => 32,
                            ],
                            1 => [
                                'value' => 'Есть артикул или модель в больше, чем 50% товаров (до 3 категорий)',
                                'id' => 54,
                                'field_id' => 32,
                            ],
                            2 => [
                                'value' => 'Есть артикул или модель в меньше, чем 50% товаров (3 и больше категорий)',
                                'id' => 59,
                                'field_id' => 32,
                            ],
                            3 => [
                                'value' => 'Есть артикул или модель в меньше, чем 50% товаров (до 3 категорий)',
                                'id' => 58,
                                'field_id' => 32,
                            ],
                            4 => [
                                'value' => 'Определено какие товары попадают в группу (3 и больше категорий)',
                                'id' => 53,
                                'field_id' => 32,
                            ],
                            5 => [
                                'value' => 'Определено какие товары попадают в группу (до 3 категорий)',
                                'id' => 52,
                                'field_id' => 32,
                            ],
                            6 => [
                                'value' => 'Товаров с артикулом или моделью столько же, сколько без них (1:1) (3 и больше категорий)',
                                'id' => 57,
                                'field_id' => 32,
                            ],
                            7 => [
                                'value' => 'Товаров с артикулом или моделью столько же, сколько без них (1:1) (до 3 категорий)',
                                'id' => 56,
                                'field_id' => 32,
                            ],
                        ],
                    ],
                    4 => [
                        'id' => 3,
                        'name' => 'Виза супервайзера',
                        'values' => [
                            0 => [
                                'id' => '1',
                                'value' => 'Да',
                            ],
                            1 => [
                                'id' => '0',
                                'value' => 'Нет',
                            ],
                        ],
                    ],
                    5 => [
                        'id' => 'report_period_id',
                        'name' => 'Отчетный период КМ',
                        'values' => [
                            0 => [
                                'id' => 1,
                                'value' => '2020-01-01 - 2020-03-31',
                            ],
                            1 => [
                                'id' => 2,
                                'value' => '2020-04-01 - 2020-06-30',
                            ],
                            2 => [
                                'id' => 3,
                                'value' => '2020-07-01 - 2020-09-30',
                            ],
                            3 => [
                                'id' => 4,
                                'value' => '2020-10-01 - 2020-12-31',
                            ],
                        ],
                    ],
                    6 => [
                        'id' => 160,
                        'name' => 'Укр. поля',
                        'values' => [
                            0 => [
                                'id' => '0',
                                'value' => 'Нет',
                            ],
                            1 => [
                                'id' => '1',
                                'value' => 'Да',
                            ],
                        ],
                    ],
                    7 => [
                        'id' => 'sv_report_periods',
                        'name' => 'Отчетный период СВ',
                        'multiple' => true,
                        'values' => [
                            0 => [
                                'id' => 1,
                                'value' => '2020-01-01 - 2020-03-31',
                            ],
                            1 => [
                                'id' => 2,
                                'value' => '2020-04-01 - 2020-06-30',
                            ],
                            2 => [
                                'id' => 3,
                                'value' => '2020-07-01 - 2020-09-30',
                            ],
                            3 => [
                                'id' => 4,
                                'value' => '2020-10-01 - 2020-12-31',
                            ],
                        ],
                    ],
                ],
                'disabledFields' => [
                ],
            ]
        ]
    ],

];