<?php

use lisa\Constants;

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить модель активного правила автораспределения направления 0',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'id' => 4,
            'responseBody' => [
                'model' => [
                    'id' => 4,
                    'request_direction' => 0,
                    'request_type_ids' => [
                        0 => '7',
                        1 => '8',
                        2 => '13',
                        3 => '14',
                        4 => '15',
                    ],
                    'field_ids' => [
                    ],
                    'seller_ids' => [
                    ],
                    'user_positions' => [
                        0 => 'supervisor',
                    ],
                    'added_users' => [
                    ],
                    'removed_users' => [
                    ],
                    'lisa_category_ids' => [
                    ],
                    'rz_category_ids' => [
                    ],
                    'author_id' => NULL,
                    'team_ids' => [
                        0 => '16',
                    ],
                    'status' => 1,
                    'is_system_rule' => true,
                    'distribute_by' => 4,
                    'weight' => 1,
                    'select_order' => 0,
                    'statuses_for_order' => [
                        0 => '2',
                        1 => '7',
                        2 => '1',
                        3 => '9',
                        4 => '8',
                    ],
                    'observers' => [
                    ],
                ],
                'initialValues' => [
                    'directions' => [
                        0 => 'Определяется типом задачи',
                        1 => 'Работа с товарами Розетки',
                        2 => 'Работа с товарами Маркетплейса',
                    ],
                    'typesByDirection' => [
                        1 => [
                            1 => 'Добавление новых товаров',
                            2 => 'Добавление/изменение информации в существующих товарах',
                            3 => 'Перенос товаров',
                            5 => 'Заливка фото с фотостудии',
                            12 => 'Добавление новых СЦ/изменение существующих СЦ',
                        ],
                        2 => [
                            1 => 'Добавление новых товаров',
                            2 => 'Добавление/изменение информации в существующих товарах',
                            3 => 'Перенос товаров',
                            6 => 'Проверка скрытых товаров',
                        ],
                        0 => [
                            4 => 'Группировка товаров',
                            7 => 'Добавление нового портала/раздела фат-меню/категории товаров',
                            8 => 'Добавление/изменение информации в существующих порталах/фат-меню/категориях товаров',
                            9 => 'Добавление параметров/значений',
                            10 => 'Изменение существующих параметров/значений',
                            11 => 'Проектирование структуры',
                            13 => 'Добавление/изменение видео',
                            14 => 'Добавление/изменение размерной сетки',
                            15 => 'Добавление/изменение тегов',
                        ],
                    ],
                    'checkBoxes' => [
                        1 => [
                            1 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                            2 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                7 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                8 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                9 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                10 => [
                                    'value' => 123,
                                    'text' => 'Обновление фото',
                                ],
                                11 => [
                                    'value' => 124,
                                    'text' => 'Обновление описания',
                                ],
                                12 => [
                                    'value' => 125,
                                    'text' => 'Обновление характеристик',
                                ],
                                13 => [
                                    'value' => 126,
                                    'text' => 'Добавление/обновление инструкций',
                                ],
                                14 => [
                                    'value' => 159,
                                    'text' => 'По заявке с MobileCourier',
                                ],
                            ],
                            3 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                            5 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                            12 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                        ],
                        2 => [
                            1 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                            ],
                            2 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                                8 => [
                                    'value' => 159,
                                    'text' => 'По заявке с MobileCourier',
                                ],
                            ],
                            3 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                            ],
                            6 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                            ],
                        ],
                        0 => [
                            4 => [
                                0 => [
                                    'value' => 169,
                                    'text' => 'Алгоритм',
                                ],
                            ],
                            7 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 6,
                                    'text' => 'Точки входа',
                                ],
                                3 => [
                                    'value' => 7,
                                    'text' => 'Добавление графики',
                                ],
                            ],
                            8 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 6,
                                    'text' => 'Точки входа',
                                ],
                                3 => [
                                    'value' => 7,
                                    'text' => 'Добавление графики',
                                ],
                            ],
                            9 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            10 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            11 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            13 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            14 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            15 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                        ],
                    ],
                    'distributeBy' => [
                        1 => 'справочнику продавцов',
                        2 => 'справочнику категорий Lisa',
                        3 => 'справочнику категорий Rozetka',
                        4 => 'пользователям',
                    ],
                    'teams' => [
                        0 => [
                            'value' => 1,
                            'text' => 'Маркетплейс 1 (Контент)',
                        ],
                        1 => [
                            'value' => 2,
                            'text' => 'Маркетплейс 2 (Контент)',
                        ],
                        2 => [
                            'value' => 3,
                            'text' => 'Маркетплейс 3 (Контент)',
                        ],
                        3 => [
                            'value' => 4,
                            'text' => 'Маркетплейс 4 (Контент)',
                        ],
                        4 => [
                            'value' => 5,
                            'text' => 'Маркетплейс 5 (Контент)',
                        ],
                        5 => [
                            'value' => 7,
                            'text' => 'Маркетплейс Freelance (Контент)',
                        ],
                        6 => [
                            'value' => 8,
                            'text' => 'Fashion (Контент)',
                        ],
                        7 => [
                            'value' => 9,
                            'text' => 'FMCG, Косметика и парфюмерия (Контент)',
                        ],
                        8 => [
                            'value' => 10,
                            'text' => 'IT, Аксесуари, Уценка (Контент)',
                        ],
                        9 => [
                            'value' => 11,
                            'text' => 'Бытовая техника, сантехника (Контент)',
                        ],
                        10 => [
                            'value' => 13,
                            'text' => 'Rozetka Freelance (Контент)',
                        ],
                        11 => [
                            'value' => 14,
                            'text' => 'Группировка товаров (Контент)',
                        ],
                        12 => [
                            'value' => 15,
                            'text' => 'Проектирование структур категорий + фильтры (Контент)',
                        ],
                        13 => [
                            'value' => 16,
                            'text' => 'Изменения в категориях (Контент)',
                        ],
                        14 => [
                            'value' => 17,
                            'text' => 'Административная команда (Все)',
                        ],
                        15 => [
                            'value' => 18,
                            'text' => 'Маркетплейс (инициаторы) (Контент)',
                        ],
                        16 => [
                            'value' => 19,
                            'text' => 'SEO-отдел (Контент)',
                        ],
                        17 => [
                            'value' => 20,
                            'text' => 'Фотостудия (Контент)',
                        ],
                        18 => [
                            'value' => 21,
                            'text' => 'Маркетинг (Маркетинг)',
                        ],
                    ],
                    'sellers' => [
                        0 => [
                            'owox_id' => 9423,
                            'title' => 'anytech',
                        ],
                        1 => [
                            'owox_id' => 67757,
                            'title' => 'iTook',
                        ],
                        2 => [
                            'owox_id' => 83,
                            'title' => 'Euromart',
                        ],
                        3 => [
                            'owox_id' => 5,
                            'title' => 'Rozetka',
                        ],
                        4 => [
                            'owox_id' => 72141,
                            'title' => 'Rozetka.md',
                        ],
                        5 => [
                            'owox_id' => 128603,
                            'title' => 'RozetkaEU',
                        ],
                        6 => [
                            'owox_id' => 124276,
                            'title' => 'Rozetka.uz',
                        ],
                        7 => [
                            'owox_id' => -2,
                            'title' => 'Все продавцы',
                        ],
                    ],
                    'statuses' => [
                        1 => 'Новая',
                        2 => 'Готова для распределения',
                        3 => 'На доработке',
                        4 => 'Отменена',
                        5 => 'Ожидает взятия в работу',
                        6 => 'В работе',
                        7 => 'Ожидает',
                        8 => 'Частично выполнена',
                        9 => 'Выполнена',
                        11 => 'Закрыта',
                    ],
                    'roles' => [
                        'admin' => 'Администратор (Все)',
                        'contentManager' => 'Контент-менеджер (Контент)',
                        'headSupervisor' => 'Руководитель супервайзеров (Все)',
                        'moderator' => 'Сотрудник отдела модерации (Контент)',
                        'photoManager' => 'Сотрудник фотостудии (Контент)',
                        'productManager' => 'Продакт-менеджер (Контент)',
                        'seo' => 'Сотрудник seo-отдела (Контент)',
                        'supervisor' => 'Супервайзер (Контент)',
                        'system' => 'Система (Все)',
                        'teamLead' => 'Руководитель направления (тимлид) (Все)',
                        'marketolog' => 'Маркетолог (Маркетинг)',
                    ],
                ],
            ],
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Получить модель полей для создания правила автораспределения',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'responseBody' => [
                'model' => [
                    'id' => NULL,
                    'request_direction' => NULL,
                    'request_type_ids' => [
                    ],
                    'field_ids' => [
                    ],
                    'seller_ids' => [
                    ],
                    'user_positions' => [
                    ],
                    'added_users' => [
                    ],
                    'removed_users' => [
                    ],
                    'lisa_category_ids' => [
                    ],
                    'rz_category_ids' => [
                    ],
                    'author_id' => NULL,
                    'team_ids' => [
                    ],
                    'status' => 1,
                    'is_system_rule' => NULL,
                    'distribute_by' => NULL,
                    'weight' => NULL,
                    'select_order' => NULL,
                    'statuses_for_order' => [
                    ],
                    'observers' => [
                    ],
                ],
                'initialValues' => [
                    'directions' => [
                        0 => 'Определяется типом задачи',
                        1 => 'Работа с товарами Розетки',
                        2 => 'Работа с товарами Маркетплейса',
                    ],
                    'typesByDirection' => [
                        1 => [
                            1 => 'Добавление новых товаров',
                            2 => 'Добавление/изменение информации в существующих товарах',
                            3 => 'Перенос товаров',
                            5 => 'Заливка фото с фотостудии',
                            12 => 'Добавление новых СЦ/изменение существующих СЦ',
                        ],
                        2 => [
                            1 => 'Добавление новых товаров',
                            2 => 'Добавление/изменение информации в существующих товарах',
                            3 => 'Перенос товаров',
                            6 => 'Проверка скрытых товаров',
                        ],
                        0 => [
                            4 => 'Группировка товаров',
                            7 => 'Добавление нового портала/раздела фат-меню/категории товаров',
                            8 => 'Добавление/изменение информации в существующих порталах/фат-меню/категориях товаров',
                            9 => 'Добавление параметров/значений',
                            10 => 'Изменение существующих параметров/значений',
                            11 => 'Проектирование структуры',
                            13 => 'Добавление/изменение видео',
                            14 => 'Добавление/изменение размерной сетки',
                            15 => 'Добавление/изменение тегов',
                        ],
                    ],
                    'checkBoxes' => [
                        1 => [
                            1 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                            2 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                7 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                8 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                9 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                10 => [
                                    'value' => 123,
                                    'text' => 'Обновление фото',
                                ],
                                11 => [
                                    'value' => 124,
                                    'text' => 'Обновление описания',
                                ],
                                12 => [
                                    'value' => 125,
                                    'text' => 'Обновление характеристик',
                                ],
                                13 => [
                                    'value' => 126,
                                    'text' => 'Добавление/обновление инструкций',
                                ],
                                14 => [
                                    'value' => 159,
                                    'text' => 'По заявке с MobileCourier',
                                ],
                            ],
                            3 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                            5 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                            12 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 4,
                                    'text' => 'С фотосъемкой',
                                ],
                                3 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                4 => [
                                    'value' => 9,
                                    'text' => 'С тегами к товарам',
                                ],
                                5 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                6 => [
                                    'value' => 18,
                                    'text' => 'Добавление товаров в новую категорию',
                                ],
                                7 => [
                                    'value' => 12,
                                    'text' => 'На основе отзыва клиента на сайте',
                                ],
                                8 => [
                                    'value' => 14,
                                    'text' => 'Промо-описание',
                                ],
                                9 => [
                                    'value' => 10,
                                    'text' => 'Уценка',
                                ],
                                10 => [
                                    'value' => 11,
                                    'text' => 'Уценка 2',
                                ],
                                11 => [
                                    'value' => 16,
                                    'text' => 'Лоты',
                                ],
                            ],
                        ],
                        2 => [
                            1 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                            ],
                            2 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                                8 => [
                                    'value' => 159,
                                    'text' => 'По заявке с MobileCourier',
                                ],
                            ],
                            3 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                            ],
                            6 => [
                                0 => [
                                    'value' => 8,
                                    'text' => 'С размерной сеткой',
                                ],
                                1 => [
                                    'value' => 15,
                                    'text' => 'С видео',
                                ],
                                2 => [
                                    'value' => 19,
                                    'text' => 'С палитрой',
                                ],
                                3 => [
                                    'value' => 127,
                                    'text' => 'Автомодерация',
                                ],
                                4 => [
                                    'value' => 5,
                                    'text' => 'Стоп-бренды',
                                ],
                                5 => [
                                    'value' => 17,
                                    'text' => 'БУ, REF',
                                ],
                                6 => [
                                    'value' => 160,
                                    'text' => 'Укр. поля',
                                ],
                                7 => [
                                    'value' => 13,
                                    'text' => 'Жалоба на товар продавца маркета',
                                ],
                            ],
                        ],
                        0 => [
                            4 => [
                                0 => [
                                    'value' => 169,
                                    'text' => 'Алгоритм',
                                ],
                            ],
                            7 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 6,
                                    'text' => 'Точки входа',
                                ],
                                3 => [
                                    'value' => 7,
                                    'text' => 'Добавление графики',
                                ],
                            ],
                            8 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                                2 => [
                                    'value' => 6,
                                    'text' => 'Точки входа',
                                ],
                                3 => [
                                    'value' => 7,
                                    'text' => 'Добавление графики',
                                ],
                            ],
                            9 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            10 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            11 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            13 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            14 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                            15 => [
                                0 => [
                                    'value' => 1,
                                    'text' => 'Ручная загрузка',
                                ],
                                1 => [
                                    'value' => 2,
                                    'text' => 'Пакетная загрузка',
                                ],
                            ],
                        ],
                    ],
                    'distributeBy' => [
                        1 => 'справочнику продавцов',
                        2 => 'справочнику категорий Lisa',
                        3 => 'справочнику категорий Rozetka',
                        4 => 'пользователям',
                    ],
                    'teams' => [
                        0 => [
                            'value' => 1,
                            'text' => 'Маркетплейс 1 (Контент)',
                        ],
                        1 => [
                            'value' => 2,
                            'text' => 'Маркетплейс 2 (Контент)',
                        ],
                        2 => [
                            'value' => 3,
                            'text' => 'Маркетплейс 3 (Контент)',
                        ],
                        3 => [
                            'value' => 4,
                            'text' => 'Маркетплейс 4 (Контент)',
                        ],
                        4 => [
                            'value' => 5,
                            'text' => 'Маркетплейс 5 (Контент)',
                        ],
                        5 => [
                            'value' => 7,
                            'text' => 'Маркетплейс Freelance (Контент)',
                        ],
                        6 => [
                            'value' => 8,
                            'text' => 'Fashion (Контент)',
                        ],
                        7 => [
                            'value' => 9,
                            'text' => 'FMCG, Косметика и парфюмерия (Контент)',
                        ],
                        8 => [
                            'value' => 10,
                            'text' => 'IT, Аксесуари, Уценка (Контент)',
                        ],
                        9 => [
                            'value' => 11,
                            'text' => 'Бытовая техника, сантехника (Контент)',
                        ],
                        10 => [
                            'value' => 13,
                            'text' => 'Rozetka Freelance (Контент)',
                        ],
                        11 => [
                            'value' => 14,
                            'text' => 'Группировка товаров (Контент)',
                        ],
                        12 => [
                            'value' => 15,
                            'text' => 'Проектирование структур категорий + фильтры (Контент)',
                        ],
                        13 => [
                            'value' => 16,
                            'text' => 'Изменения в категориях (Контент)',
                        ],
                        14 => [
                            'value' => 17,
                            'text' => 'Административная команда (Все)',
                        ],
                        15 => [
                            'value' => 18,
                            'text' => 'Маркетплейс (инициаторы) (Контент)',
                        ],
                        16 => [
                            'value' => 19,
                            'text' => 'SEO-отдел (Контент)',
                        ],
                        17 => [
                            'value' => 20,
                            'text' => 'Фотостудия (Контент)',
                        ],
                        18 => [
                            'value' => 21,
                            'text' => 'Маркетинг (Маркетинг)',
                        ],
                    ],
                    'sellers' => [
                        0 => [
                            'owox_id' => 9423,
                            'title' => 'anytech',
                        ],
                        1 => [
                            'owox_id' => 67757,
                            'title' => 'iTook',
                        ],
                        2 => [
                            'owox_id' => 83,
                            'title' => 'Euromart',
                        ],
                        3 => [
                            'owox_id' => 5,
                            'title' => 'Rozetka',
                        ],
                        4 => [
                            'owox_id' => 72141,
                            'title' => 'Rozetka.md',
                        ],
                        5 => [
                            'owox_id' => 128603,
                            'title' => 'RozetkaEU',
                        ],
                        6 => [
                            'owox_id' => 124276,
                            'title' => 'Rozetka.uz',
                        ],
                        7 => [
                            'owox_id' => -2,
                            'title' => 'Все продавцы',
                        ],
                    ],
                    'statuses' => [
                        1 => 'Новая',
                        2 => 'Готова для распределения',
                        3 => 'На доработке',
                        4 => 'Отменена',
                        5 => 'Ожидает взятия в работу',
                        6 => 'В работе',
                        7 => 'Ожидает',
                        8 => 'Частично выполнена',
                        9 => 'Выполнена',
                        11 => 'Закрыта',
                    ],
                    'roles' => [
                        'admin' => 'Администратор (Все)',
                        'contentManager' => 'Контент-менеджер (Контент)',
                        'headSupervisor' => 'Руководитель супервайзеров (Все)',
                        'moderator' => 'Сотрудник отдела модерации (Контент)',
                        'photoManager' => 'Сотрудник фотостудии (Контент)',
                        'productManager' => 'Продакт-менеджер (Контент)',
                        'seo' => 'Сотрудник seo-отдела (Контент)',
                        'supervisor' => 'Супервайзер (Контент)',
                        'system' => 'Система (Все)',
                        'teamLead' => 'Руководитель направления (тимлид) (Все)',
                        'marketolog' => 'Маркетолог (Маркетинг)',
                    ],
                ],
            ]
        ]
    ]
];
