<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить модель поля для редактирования магазина',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'responseBody' => [
                'model' => [
                    'owox_id' => -2,
                    'supervisor_id' => 5,
                    'title' => 'Все продавцы',
                    'status' => NULL,
                ],
                'initialValues' => [
                    'supervisors' => [
                        0 => [
                            'id' => 4,
                            'name' => 'Константин Куцан',
                        ],
                        1 => [
                            'id' => 33,
                            'name' => 'Супервайзер Групповушкин 13',
                        ],
                        2 => [
                            'id' => 36,
                            'name' => 'Супервайзер Групповушкин 16',
                        ],
                        3 => [
                            'id' => 35,
                            'name' => 'Супервайзер Категоркин 15',
                        ],
                        4 => [
                            'id' => 38,
                            'name' => 'Супервайзер Категоркин 18',
                        ],
                        5 => [
                            'id' => 6,
                            'name' => 'Супервайзер Начальникович 1',
                        ],
                        6 => [
                            'id' => 30,
                            'name' => 'Супервайзер Начальникович 10',
                        ],
                        7 => [
                            'id' => 31,
                            'name' => 'Супервайзер Начальникович 11',
                        ],
                        8 => [
                            'id' => 32,
                            'name' => 'Супервайзер Начальникович 12',
                        ],
                        9 => [
                            'id' => 10,
                            'name' => 'Супервайзер Начальникович 2',
                        ],
                        10 => [
                            'id' => 23,
                            'name' => 'Супервайзер Начальникович 3',
                        ],
                        11 => [
                            'id' => 24,
                            'name' => 'Супервайзер Начальникович 4',
                        ],
                        12 => [
                            'id' => 25,
                            'name' => 'Супервайзер Начальникович 5',
                        ],
                        13 => [
                            'id' => 26,
                            'name' => 'Супервайзер Начальникович 6',
                        ],
                        14 => [
                            'id' => 27,
                            'name' => 'Супервайзер Начальникович 7',
                        ],
                        15 => [
                            'id' => 28,
                            'name' => 'Супервайзер Начальникович 8',
                        ],
                        16 => [
                            'id' => 29,
                            'name' => 'Супервайзер Начальникович 9',
                        ],
                        17 => [
                            'id' => 34,
                            'name' => 'Супервайзер Проектенко 14',
                        ],
                        18 => [
                            'id' => 37,
                            'name' => 'Супервайзер Проектенко 17',
                        ],
                        19 => [
                            'id' => 5,
                            'name' => 'Супервайзер Руководько 1',
                        ],
                    ],
                ],
            ]
        ]
    ],

];
