<?php

use lisa\Constants;

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить модель активного юзера СВ проект Контент',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'id' => 6,
            'responseBody' => [
                'model' => [
                    'id' => 6,
                    'name' => 'Супервайзер Начальникович 1',
                    'login' => 'bpm_supervisor_1',
                    'email' => 'bpm_supervisor_1@rozetka.com.ua',
                    'team' => 1,
                    'parent_id' => 5,
                    'position' => 'supervisor',
                    'status' => 1,
                    'create_ts' => '2020-05-19 13:36:22',
                    'created_by' => 1,
                    'change_date' => '2020-05-19 16:36:22',
                    'drfo' => '\'000000006',
                    'positions' => [
                        1 => 'supervisor',
                    ],
                    'permissions' => [
                    ],
                    'disabledProjects' => [
                        0 => true,
                    ],
                ],
                'initialValues' => [
                    'userTeam' => Constants::ACTIVE_TEAMS,
                    'parentUser' => [
                        0 => [
                            'name' => 'Константин Куцан',
                            'id' => 4,
                        ],
                        1 => [
                            'name' => 'Супервайзер Руководько 1',
                            'id' => 5,
                        ],
                        2 => [
                            'name' => 'Супервайзер Начальникович 1',
                            'id' => 6,
                        ],
                        3 => [
                            'name' => 'Супервайзер Начальникович 2',
                            'id' => 10,
                        ],
                        4 => [
                            'name' => 'Менеджер Контентович 1А',
                            'id' => 11,
                        ],
                        5 => [
                            'name' => 'Менеджер Контентович 1Б',
                            'id' => 12,
                        ],
                        6 => [
                            'name' => 'Менеджер Контентович 2А',
                            'id' => 13,
                        ],
                        7 => [
                            'name' => 'Менеджер Контентович 2Б',
                            'id' => 14,
                        ],
                        8 => [
                            'name' => 'Тим Лидович 1',
                            'id' => 15,
                        ],
                        9 => [
                            'name' => 'Тим Лидович 2',
                            'id' => 16,
                        ],
                        10 => [
                            'name' => 'Менеджер Продактович 1',
                            'id' => 17,
                        ],
                        11 => [
                            'name' => 'Менеджер Продактович 2',
                            'id' => 18,
                        ],
                        12 => [
                            'name' => 'Сео Сеошевич 1',
                            'id' => 19,
                        ],
                        13 => [
                            'name' => 'Сео Сеошевич 2',
                            'id' => 20,
                        ],
                        14 => [
                            'name' => 'Менеджер Фоткович 1',
                            'id' => 21,
                        ],
                        15 => [
                            'name' => 'Менеджер Фоткович 2',
                            'id' => 22,
                        ],
                        16 => [
                            'name' => 'Супервайзер Начальникович 3',
                            'id' => 23,
                        ],
                        17 => [
                            'name' => 'Супервайзер Начальникович 4',
                            'id' => 24,
                        ],
                        18 => [
                            'name' => 'Супервайзер Начальникович 5',
                            'id' => 25,
                        ],
                        19 => [
                            'name' => 'Супервайзер Начальникович 6',
                            'id' => 26,
                        ],
                        20 => [
                            'name' => 'Супервайзер Начальникович 7',
                            'id' => 27,
                        ],
                        21 => [
                            'name' => 'Супервайзер Начальникович 8',
                            'id' => 28,
                        ],
                        22 => [
                            'name' => 'Супервайзер Начальникович 9',
                            'id' => 29,
                        ],
                        23 => [
                            'name' => 'Супервайзер Начальникович 10',
                            'id' => 30,
                        ],
                        24 => [
                            'name' => 'Супервайзер Начальникович 11',
                            'id' => 31,
                        ],
                        25 => [
                            'name' => 'Супервайзер Начальникович 12',
                            'id' => 32,
                        ],
                        26 => [
                            'name' => 'Супервайзер Групповушкин 13',
                            'id' => 33,
                        ],
                        27 => [
                            'name' => 'Супервайзер Проектенко 14',
                            'id' => 34,
                        ],
                        28 => [
                            'name' => 'Супервайзер Категоркин 15',
                            'id' => 35,
                        ],
                        29 => [
                            'name' => 'Супервайзер Групповушкин 16',
                            'id' => 36,
                        ],
                        30 => [
                            'name' => 'Супервайзер Проектенко 17',
                            'id' => 37,
                        ],
                        31 => [
                            'name' => 'Супервайзер Категоркин 18',
                            'id' => 38,
                        ],
                        32 => [
                            'name' => 'Менеджер Модерашкин',
                            'id' => 39,
                        ],
                    ],
                    'normalizedPermissions' => Constants::PROJECT_PERMISSIONS,
                    'projectPositions' => Constants::PROJECT_POSITIONS,
                    'projects' => [
                        0 => 'Все',
                        1 => 'Контент',
                        2 => 'Маркетинг',
                    ],
                    'subordinates' => [
                        11 => 'Менеджер Контентович 1А',
                        12 => 'Менеджер Контентович 1Б',
                    ],
                    'samePositionUsers' => [
                        10 => 'Супервайзер Начальникович 2',
                        23 => 'Супервайзер Начальникович 3',
                        24 => 'Супервайзер Начальникович 4',
                        25 => 'Супервайзер Начальникович 5',
                        26 => 'Супервайзер Начальникович 6',
                        27 => 'Супервайзер Начальникович 7',
                        28 => 'Супервайзер Начальникович 8',
                        29 => 'Супервайзер Начальникович 9',
                        30 => 'Супервайзер Начальникович 10',
                        31 => 'Супервайзер Начальникович 11',
                        32 => 'Супервайзер Начальникович 12',
                        33 => 'Супервайзер Групповушкин 13',
                        34 => 'Супервайзер Проектенко 14',
                        35 => 'Супервайзер Категоркин 15',
                        36 => 'Супервайзер Групповушкин 16',
                        37 => 'Супервайзер Проектенко 17',
                        38 => 'Супервайзер Категоркин 18',
                    ],
                    'hasUnfinishedRequests' => false,
                    'boundCategories' => true,
                ],
            ],
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Получить модель заблокированного юзера ТимЛид проект Все',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'id' => 15,
            'responseBody' => [
                'model' => [
                    'id' => 15,
                    'name' => 'Тим Лидович 1',
                    'login' => 'bpm_teamLead_1',
                    'email' => 'bpm_teamLead_1@rozetka.com.ua',
                    'team' => 19,
                    'parent_id' => 4,
                    'position' => 'teamLead',
                    'status' => 0,
                    'create_ts' => '2020-04-13 13:15:35',
                    'created_by' => 1,
                    'change_date' => '2020-06-28 13:19:51',
                    'drfo' => '\'000000015',
                    'positions' => [
                        0 => 'teamLead',
                    ],
                    'permissions' => [
                    ],
                    'disabledProjects' => [
                        1 => true,
                        2 => true,
                    ],
                ],
                'initialValues' => [
                    'userTeam' => Constants::ACTIVE_TEAMS,
                    'parentUser' => [
                        0 => [
                            'name' => 'Константин Куцан',
                            'id' => 4,
                        ],
                        1 => [
                            'name' => 'Супервайзер Руководько 1',
                            'id' => 5,
                        ],
                        2 => [
                            'name' => 'Супервайзер Начальникович 1',
                            'id' => 6,
                        ],
                        3 => [
                            'name' => 'Супервайзер Начальникович 2',
                            'id' => 10,
                        ],
                        4 => [
                            'name' => 'Менеджер Контентович 1А',
                            'id' => 11,
                        ],
                        5 => [
                            'name' => 'Менеджер Контентович 1Б',
                            'id' => 12,
                        ],
                        6 => [
                            'name' => 'Менеджер Контентович 2А',
                            'id' => 13,
                        ],
                        7 => [
                            'name' => 'Менеджер Контентович 2Б',
                            'id' => 14,
                        ],
                        8 => [
                            'name' => 'Тим Лидович 1',
                            'id' => 15,
                        ],
                        9 => [
                            'name' => 'Тим Лидович 2',
                            'id' => 16,
                        ],
                        10 => [
                            'name' => 'Менеджер Продактович 1',
                            'id' => 17,
                        ],
                        11 => [
                            'name' => 'Менеджер Продактович 2',
                            'id' => 18,
                        ],
                        12 => [
                            'name' => 'Сео Сеошевич 1',
                            'id' => 19,
                        ],
                        13 => [
                            'name' => 'Сео Сеошевич 2',
                            'id' => 20,
                        ],
                        14 => [
                            'name' => 'Менеджер Фоткович 1',
                            'id' => 21,
                        ],
                        15 => [
                            'name' => 'Менеджер Фоткович 2',
                            'id' => 22,
                        ],
                        16 => [
                            'name' => 'Супервайзер Начальникович 3',
                            'id' => 23,
                        ],
                        17 => [
                            'name' => 'Супервайзер Начальникович 4',
                            'id' => 24,
                        ],
                        18 => [
                            'name' => 'Супервайзер Начальникович 5',
                            'id' => 25,
                        ],
                        19 => [
                            'name' => 'Супервайзер Начальникович 6',
                            'id' => 26,
                        ],
                        20 => [
                            'name' => 'Супервайзер Начальникович 7',
                            'id' => 27,
                        ],
                        21 => [
                            'name' => 'Супервайзер Начальникович 8',
                            'id' => 28,
                        ],
                        22 => [
                            'name' => 'Супервайзер Начальникович 9',
                            'id' => 29,
                        ],
                        23 => [
                            'name' => 'Супервайзер Начальникович 10',
                            'id' => 30,
                        ],
                        24 => [
                            'name' => 'Супервайзер Начальникович 11',
                            'id' => 31,
                        ],
                        25 => [
                            'name' => 'Супервайзер Начальникович 12',
                            'id' => 32,
                        ],
                        26 => [
                            'name' => 'Супервайзер Групповушкин 13',
                            'id' => 33,
                        ],
                        27 => [
                            'name' => 'Супервайзер Проектенко 14',
                            'id' => 34,
                        ],
                        28 => [
                            'name' => 'Супервайзер Категоркин 15',
                            'id' => 35,
                        ],
                        29 => [
                            'name' => 'Супервайзер Групповушкин 16',
                            'id' => 36,
                        ],
                        30 => [
                            'name' => 'Супервайзер Проектенко 17',
                            'id' => 37,
                        ],
                        31 => [
                            'name' => 'Супервайзер Категоркин 18',
                            'id' => 38,
                        ],
                        32 => [
                            'name' => 'Менеджер Модерашкин',
                            'id' => 39,
                        ],
                    ],
                    'normalizedPermissions' => Constants::PROJECT_PERMISSIONS,
                    'projectPositions' => Constants::PROJECT_POSITIONS,
                    'projects' => [
                        0 => 'Все',
                        1 => 'Контент',
                        2 => 'Маркетинг',
                    ],
                    'subordinates' => [
                    ],
                    'samePositionUsers' => [
                        16 => 'Тим Лидович 2',
                    ],
                    'hasUnfinishedRequests' => false,
                    'boundCategories' => false,
                ],
            ],
        ]
    ],

];
