<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Cтраница нотификаций',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с сортировкой по номеру заявки',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?sort=request_id',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case3' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с сортировкой по тексту',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?sort=notification',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case4' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с сортировкой по статусу',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?sort=status',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case5' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с обратной сортировкой по дате',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?sort=-created_at',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case6' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с обратной сортировкой по приоритету',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?sort=-priority',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case7' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с обратной сортировкой по получателям',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?sort=-recipients',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case8' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по номеру заявки',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=1&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                ],
                "cantSee" => [
                    "3" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                ]
            ]
        ]
    ],

    'case9' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по тексту',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=Проектенко&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                ],
                "cantSee" => [
                    "2" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                ]
            ]
        ]
    ],

    'case10' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по статусу',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=1&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                    "2" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                ]
            ]
        ]
    ],

    'case11' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по дате',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=2020-06-03+14%3A00%3A00to2020-06-03+14%3A10%3A00&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                    "4" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                ]
            ]
        ]
    ],

    'case12' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по приоритету',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=2&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case13' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по получателям',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=прод',
            "pageObjects" => [
                "canSee" => [
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                ],
                "cantSee" => [
                    "3" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody//a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                ]
            ]
        ]
    ],

    'case14' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по номеру заявки > 999 999 999',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=9999999999&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//thead//td[@class='has-error']//div",
                            "value" => "Значение «Номер заявки» не должно превышать 999999999."
                        ],
                    ],
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case15' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с нечисловым фильтром по номеру заявки',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=%3D~%7D%21%40%23%24%25%5E%26*%28%29_%2B%60-%5D%27%2F%5B%3B.%2C%7D"%3F%7B%3A>%5C%7C&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//thead//td[@class='has-error']//div",
                            "value" => "Значение «Номер заявки» должно быть целым числом."
                        ],
                    ],
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case16' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с несуществующим фильтром по номеру заявки',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=999&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//div[@class='empty']",
                            "value" => "Ничего не найдено."
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case17' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с несуществующим фильтром по тексту',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=%3D~%7D%21%40%23%24%25%5E%26*%28%29_%2B%60-%5D%27%2F%5B%3B.%2C%7D"%3F%7B%3A>%5C%7C&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//div[@class='empty']",
                            "value" => "Ничего не найдено."
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case18' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с несуществующим фильтром по дате',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=2020-06-04+00%3A00%3A00to2020-06-04+23%3A59%3A00&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//div[@class='empty']",
                            "value" => "Ничего не найдено."
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case19' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с несуществующим фильтром по приоритету',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=0&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//div[@class='empty']",
                            "value" => "Ничего не найдено."
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case20' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с несуществующим фильтром по получателям',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=%3D~%7D%21%40%23%24%25%5E%26*%28%29_%2B%60-%5D%27%2F%5B%3B.%2C%7D"%3F%7B%3A>%5C%7C',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//div[@class='empty']",
                            "value" => "Ничего не найдено."
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case21' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по тексту > 100',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=%3D~%7D%21%40%23%24%25%5E%26*%28%29_%2B%60-%5D%27%2F%5B%3B.%2C%7D"%3F%7B%3A>%5C%7C<1001234567890>абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОП&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//thead//td[@class='has-error']//div",
                            "value" => "Значение «Текст нотификации» должно содержать максимум 100 символов."
                        ],
                    ],
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],

    'case22' => [
        'setting' => [
            'description' => 'Cтраница нотификаций с фильтром по получателю > 100',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            "url" => '?NotificationSearch%5Brequest_id%5D=&NotificationSearch%5Bnotification%5D=&NotificationSearch%5Bstatus%5D=&created_at=&NotificationSearch%5Bpriority%5D=&NotificationSearch%5Brecipients%5D=%3D~%7D%21%40%23%24%25%5E%26*%28%29_%2B%60-%5D%27%2F%5B%3B.%2C%7D"%3F%7B%3A>%5C%7C<1001234567890>абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОП',
            "pageObjects" => [
                "canSee" => [
                    "Ошибка" => [
                        [
                            "selector" => "//thead//td[@class='has-error']//div",
                            "value" => "Значение «Получатели» должно содержать максимум 100 символов."
                        ],
                    ],
                    "Заголовки" => [
                        [
                            "selector" => "//thead/tr/th[1]",
                            "value" => "Номер заявки"
                        ],
                        [
                            "selector" => "//thead/tr/th[2]",
                            "value" => "Текст нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[3]",
                            "value" => "Статус нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[4]",
                            "value" => "Дата нотификации"
                        ],
                        [
                            "selector" => "//thead/tr/th[5]",
                            "value" => "Приоритет"
                        ],
                        [
                            "selector" => "//thead/tr/th[6]",
                            "value" => "Получатели"
                        ],
                        [
                            "selector" => "//thead/tr/th[@class='action-column']",
                        ],
                    ],
                    "4" => [
                        [
                            "selector" => "//tbody/tr[1]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[2]",
                            "value" => 'Заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Требует изменений" пользователем Супервайзер Проектенко 14 по причине Затребовать изменения абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО'
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[4]",
                            "value" => "2020-06-03 14:14:37"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14	"
                        ],
                        [
                            "selector" => "//tbody/tr[1]/td[7]/a[@href='/bpm/notification/toggle-status?id=11']",
                        ],
                    ],
                    "3" => [
                        [
                            "selector" => "//tbody/tr[2]/td[1]",
                            "value" => "2"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[2]",
                            "value" => 'Создана новая заявка №2 "Добавление параметров/значений (Определяется типом задачи)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[4]",
                            "value" => "2020-06-03 14:11:08"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Проектенко 14"
                        ],
                        [
                            "selector" => "//tbody/tr[2]/td[7]/a[@href='/bpm/notification/toggle-status?id=9']",
                        ],
                    ],
                    "2" => [
                        [
                            "selector" => "//tbody/tr[3]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[2]",
                            "value" => 'Заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 с приоритетом Товар-новинка/эксклюзив (трафикообразующий) изменен статус с "Ожидает проверки условий" на "Взята на проверку" пользователем Супервайзер Начальникович 1'
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[3]",
                            "value" => "Не прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[4]",
                            "value" => "2020-06-03 14:09:53"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[3]/td[7]/a[@href='/bpm/notification/toggle-status?id=5']",
                        ],
                    ],
                    "1" => [
                        [
                            "selector" => "//tbody/tr[4]/td[1]",
                            "value" => "1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[2]",
                            "value" => 'Создана новая заявка №1 "Добавление новых товаров (Работа с товарами Розетки)", количество в работу: 10 пользователем Константин Куцан с приоритетом: Товар-новинка/эксклюзив (трафикообразующий)'
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[3]",
                            "value" => "Прочитано"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[4]",
                            "value" => "2020-06-03 14:07:22"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[5]",
                            "value" => "Товар-новинка/эксклюзив (трафикообразующий)"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[6]",
                            "value" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
                        ],
                        [
                            "selector" => "//tbody/tr[4]/td[7]/a[@href='/bpm/notification/toggle-status?id=1']",
                        ],
                    ],
                ],
                "cantSee" => [
                ]
            ]
        ]
    ],
];
