<?php

return [
    "lisa_fixtures" => [
        "field_values" => [
            [
                //"id" => 1,
                "field_id" => 21,
                "value" => "Предоставлены продактом",
                "status" => 1
            ],
            [
                //"id" => 2,
                "field_id" => 21,
                "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
                "status" => 1
            ],
            [
                //"id" => 3,
                "field_id" => 21,
                "value" => "Предоставлены продактом частично. С дополнительным поиском.",
                "status" => 1
            ],
            [
                //"id" => 15,
                "field_id" => 24,
                "value" => "Без обработки (только кадрирование)",
                "status" => 1
            ],
            [
                //"id" => 16,
                "field_id" => 24,
                "value" => "Удаление теней/фона (простая обработка)",
                "status" => 1
            ],
            [
                //"id" => 17,
                "field_id" => 24,
                "value" => "Удаление теней/фона/ватермарков/цветокорекция",
                "status" => 0
            ],
        ],
    ],
];