<?php

return [
    [
        "id" => 123,
        "hash" => "GorjvUr72k5aoS2-QP0-V4kMJRfLXF7u0eQbMk2hLv6WJhWd7Q",
        "type_price" => 0,
        "log_from" => 0,
        "type_source" => 0,
        "file_name" => null,
        "status" => 4,
        "email" => "zbuniak@blabla.com",
        "xml_type" => "Auto",
        "report" => "[\"2020-02-07 20:43:32 : Количество валют: 1\", \"2020-02-07 20:43:32 : Количество валют с ошибками: 0\", \"2020-02-07 20:43:32 : Количество конечных категорий: 2\", \"2020-02-07 20:43:32 : Количество конечных категорий с ошибками: 0\", \"2020-02-07 20:43:32 : Количество производителей: 2\", \"2020-02-07 20:43:32 : Количество производителей с ошибками: 0\", \"2020-02-07 20:43:32 : Количество товаров: 2\", \"2020-02-07 20:43:32 : Количество валидных товаров: 2\", \"2020-02-07 20:43:32 : Количество валидных товаров в наличии: 2\", \"2020-02-07 20:43:32 : Количество товаров с ошибками: 0\", \"2020-02-07 20:43:32 : Количество товаров с предупреждениями: 0\", \"2020-02-07 20:43:32 : Файл валидный\"]",
        "logs" => "[]",
        "place_address" => "https://drive.google.com/uc?export=download&id=111_hJiGlvP7q_mMUddLppqgdoW55ZKB4",
        "admin_id" => 1,
        "file_size" => 0,
        "seller_id" => null,
        "created_at" => "2020-02-07 18:43:21",
        "process_download_at" => "2020-02-07 20:43:20",
        "process_start_at" => "2020-02-07 20:43:26",
        "process_duration" => 4,
        "archive" => 0
    ]

];