<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить модель полей для создания значения',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'responseBody' => [
                'model' => [
                    'id' => NULL,
                    'field_id' => NULL,
                    'value' => NULL,
                    'status' => 1,
                    'order' => NULL,
                ],
                'initialValues' => [
                    'fieldNames' => [
                        20 => 'Уровень сложности задачи',
                        21 => 'Наличие характеристик к товарам',
                        22 => 'Наличие фото к товарам',
                        23 => 'Наличие описаний к товарам',
                        24 => 'Обработка фото',
                        25 => 'Уточнения. Количество уточнений у автора.',
                        26 => 'Язык информации',
                        27 => 'Видео к товарам',
                        28 => 'Перенос информации при изменении структуры категории',
                        29 => 'Вид структуры',
                        30 => 'Сложность структуры',
                        31 => 'Группировка товаров (наличие варьируемых параметров)',
                        32 => 'Сложность группировки в заявках',
                    ],
                ],
            ]
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Получить модель поля для редактирования последнего активного значения',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case2.php',
        'provider_data' => [
            'id' => 1,
            'responseBody' => [
                'model' => [
                    'id' => 1,
                    'field_id' => 21,
                    'value' => '!@#$%^&*()_+`=-]\'/[;.,}"?{:><\\|1234567890абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄҐЇІ',
                    'status' => 1,
                    'order' => 1,
                ],
                'initialValues' => [
                    'fieldNames' => [
                        20 => 'Уровень сложности задачи',
                        21 => 'Наличие характеристик к товарам',
                        22 => 'Наличие фото к товарам',
                        23 => 'Наличие описаний к товарам',
                        24 => 'Обработка фото',
                        25 => 'Уточнения. Количество уточнений у автора.',
                        26 => 'Язык информации',
                        27 => 'Видео к товарам',
                        28 => 'Перенос информации при изменении структуры категории',
                        29 => 'Вид структуры',
                        30 => 'Сложность структуры',
                        31 => 'Группировка товаров (наличие варьируемых параметров)',
                        32 => 'Сложность группировки в заявках',
                    ],
                ],
            ]
        ]
    ],

];
