<?php

return [
    "lisa_fixtures" => [
        "notification_settings" => [],
        "user_notifications" => [
            [
                //"id" => 1,
                "user_id" => 4,
                "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                "status" => 1,
                "created_at" => "2020-06-03 14:07:22",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 2,
                "user_id" => 6,
                "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:07:22",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 3,
                "user_id" => 15,
                "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:07:22",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 4,
                "user_id" => 17,
                "notification" => "Создана новая заявка <b>№1 \"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:07:22",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 5,
                "user_id" => 4,
                "notification" => "Заявка <b>№1</b> <b>\"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Ожидает проверки условий\"</b> на <b>\"Взята на проверку\"</b> пользователем <b>Супервайзер Начальникович 1</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:09:53",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 6,
                "user_id" => 6,
                "notification" => "Заявка <b>№1</b> <b>\"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Ожидает проверки условий\"</b> на <b>\"Взята на проверку\"</b> пользователем <b>Супервайзер Начальникович 1</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:09:53",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 7,
                "user_id" => 15,
                "notification" => "Заявка <b>№1</b> <b>\"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Ожидает проверки условий\"</b> на <b>\"Взята на проверку\"</b> пользователем <b>Супервайзер Начальникович 1</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:09:53",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 8,
                "user_id" => 17,
                "notification" => "Заявка <b>№1</b> <b>\"Добавление новых товаров (Работа с товарами Розетки)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Ожидает проверки условий\"</b> на <b>\"Взята на проверку\"</b> пользователем <b>Супервайзер Начальникович 1</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:09:53",
                "request_id" => 1,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Начальникович 1, Тим Лидович 1, Менеджер Продактович 1"
            ],
            [
                //"id" => 9,
                "user_id" => 4,
                "notification" => "Создана новая заявка <b>№2 \"Добавление параметров/значений (Определяется типом задачи)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:11:08",
                "request_id" => 2,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Проектенко 14"
            ],
            [
                //"id" => 10,
                "user_id" => 34,
                "notification" => "Создана новая заявка <b>№2 \"Добавление параметров/значений (Определяется типом задачи)\"</b>, количество в работу: <b>10</b> пользователем <b>Константин Куцан</b> с приоритетом: <b>Товар-новинка/эксклюзив (трафикообразующий)</b>",
                "status" => 0,
                "created_at" => "2020-06-03 14:11:08",
                "request_id" => 2,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Проектенко 14"
            ],
            [
                //"id" => 11,
                "user_id" => 4,
                "notification" => "Заявка <b>№2</b> <b>\"Добавление параметров/значений (Определяется типом задачи)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Ожидает проверки условий\"</b> на <b>\"Требует изменений\"</b> пользователем <b>Супервайзер Проектенко 14</b> по причине <b>Затребовать изменения </b>абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО",
                "status" => 0,
                "created_at" => "2020-06-03 14:14:37",
                "request_id" => 2,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Проектенко 14"
            ],
            [
                //"id" => 12,
                "user_id" => 34,
                "notification" => "Заявка <b>№2</b> <b>\"Добавление параметров/значений (Определяется типом задачи)\"</b>, количество в работу: <b>10</b> с приоритетом <b>Товар-новинка/эксклюзив (трафикообразующий)</b> изменен статус с <b>\"Ожидает проверки условий\"</b> на <b>\"Требует изменений\"</b> пользователем <b>Супервайзер Проектенко 14</b> по причине <b>Затребовать изменения </b>абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНО",
                "status" => 0,
                "created_at" => "2020-06-03 14:14:37",
                "request_id" => 2,
                "priority" => 2,
                "recipients" => "Константин Куцан, Супервайзер Проектенко 14"
            ]
        ],
        "priorities" => include \rzk\FixtureController::getFixtureDir() . 'lisa_fixtures/priorities.php'
    ],
];