<?php
return [
    "lisa_fixtures" => [
        "field_values" => [
            [
                //"id" => 1,
                "field_id" => 21,
                "value" => "Предоставлены продактом",
                "status" => 1,
                "order" => 0,
            ],
            [
                //"id" => 2,
                "field_id" => 21,
                "value" => "Предоставлены продактом частично. Без дополнительного поиска.",
                "status" => 1,
                "order" => 0,
            ],
            [
                //"id" => 3,
                "field_id" => 21,
                "value" => "Предоставлены продактом частично. С дополнительным поиском.",
                "status" => 1,
                "order" => 0,
            ],
            [
                //"id" => 4,
                "field_id" => 21,
                "value" => "Не предоставлены продактом. Выполнен поиск.",
                "status" => 1,
                "order" => 0,
            ],
            [
                //"id" => 5,
                "field_id" => 21,
                "value" => "Характеристики добавлены с обновлением фото/описания",
                "status" => 0,
                "order" => 0,
            ],
            [
                //"id" => 6,
                "field_id" => 22,
                "value" => "Предоставлены продактом",
                "status" => 1,
                "order" => 0,
            ],
        ],
    ],
];