<?php

return [
    "lisa_fixtures" => [
        "reasons" => [
            [
                //"id" => 1,
                "parent_status" => 1,
                "child_status" => 3,
                "reason" => "~!@#$%^&*()_+`=-]'/[;.,}\"?{:><\\|1234567890абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄҐЇІ ",
                "status" => 0
            ],
            [
                //"id" => 2,
                "parent_status" => 1,
                "child_status" => 4,
                "reason" => "~!@#$%^&*()_+`=-]'/[;.,}\"?{:><\\|1234567890абвгдеёжзийклмнопрстуфхцчшщъыьэюяєґїіАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯЄҐЇІ ",
                "status" => 0
            ],
        ],
    ],
];