<?php

return [
    'case1' => [
        'setting' => [
            'description' => 'Получить список категорий стора в форме заявки',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'urlPart' => 'all',
            'requestParameters' => [
                'name' => 'name',
            ],
            'responseBody' => [
                0 => [
                    'name' => 'Бытовая техника, интерьер',
                    'id' => 80025,
                ],
                1 => [
                    'name' => 'Дача, сад, огород',
                    'id' => 2394297,
                ],
                2 => [
                    'name' => 'Компьютеры и ноутбуки',
                    'id' => 80253,
                ],
                3 => [
                    'name' => 'Красота и здоровье',
                    'id' => 4629305,
                ],
                4 => [
                    'name' => 'Одежда, обувь и аксессуары',
                    'id' => 1162030,
                ],
                5 => [
                    'name' => 'Оружие',
                    'id' => 84625,
                ],
                6 => [
                    'name' => 'Подарки и товары для праздников',
                    'id' => 80260,
                ],
                7 => [
                    'name' => 'Сантехника и ремонт',
                    'id' => 4628418,
                ],
                8 => [
                    'name' => 'Сельское хозяйство',
                    'id' => 4655216,
                ],
                9 => [
                    'name' => 'Скрытые категории',
                    'id' => 80262,
                ],
                10 => [
                    'name' => 'Смартфоны, ТВ и электроника',
                    'id' => 4627949,
                ],
                11 => [
                    'name' => 'Спорт и увлечения',
                    'id' => 4627893,
                ],
                12 => [
                    'name' => 'Товары для бизнеса',
                    'id' => 4627851,
                ],
                13 => [
                    'name' => 'Товары для детей',
                    'id' => 88468,
                ],
                14 => [
                    'name' => 'Товары для дома',
                    'id' => 2394287,
                ],
                15 => [
                    'name' => 'Услуги и сервисы',
                    'id' => 4630262,
                ],
                16 => [
                    'name' => 'Уцененные товары',
                    'id' => 83850,
                ],
                17 => [
                    'name' => 'Мини-бары',
                    'id' => 4652996,
                ],
                18 => [
                    'name' => 'Фляги',
                    'id' => 4653010,
                ],
                19 => [
                    'name' => 'Упаковки для алкогольных напитков',
                    'id' => 4653017,
                ],
                20 => [
                    'name' => 'Фото и видео',
                    'id' => 4628124,
                ],
                21 => [
                    'name' => 'Файлы',
                    'id' => 2514857,
                ],
                22 => [
                    'name' => 'Визитницы',
                    'id' => 2514867,
                ],
                23 => [
                    'name' => 'Бейджи, брелоки-идентификаторы, настольные таблички',
                    'id' => 2514872,
                ],
                24 => [
                    'name' => 'Банковские принадлежности',
                    'id' => 2560747,
                ],
                25 => [
                    'name' => 'Папки пластиковые',
                    'id' => 2514862,
                ],
                26 => [
                    'name' => 'Папки-портфели, папки-боксы',
                    'id' => 2581727,
                ],
                27 => [
                    'name' => 'Папки-регистраторы',
                    'id' => 2581732,
                ],
                28 => [
                    'name' => 'Папки-планшеты',
                    'id' => 2581737,
                ],
                29 => [
                    'name' => 'Папки и файлы подвесные',
                    'id' => 2581742,
                ],
                30 => [
                    'name' => 'Папки с файлами',
                    'id' => 2595767,
                ],
                31 => [
                    'name' => 'Архивные короба и боксы',
                    'id' => 2666302,
                ],
                32 => [
                    'name' => 'Папки специальные',
                    'id' => 4626584,
                ],
                33 => [
                    'name' => 'Разделители и закладки',
                    'id' => 2660622,
                ],
                34 => [
                    'name' => 'Новая категория',
                    'id' => 2973057,
                ],
                35 => [
                    'name' => 'Новая категория',
                    'id' => 3167120,
                ],
                36 => [
                    'name' => 'Шило, нити и шпагаты',
                    'id' => 4630034,
                ],
                37 => [
                    'name' => 'Настольные картотеки',
                    'id' => 4641568,
                ],
                38 => [
                    'name' => 'Пломбы и пломбираторы',
                    'id' => 4655242,
                ],
                39 => [
                    'name' => 'Сургуч',
                    'id' => 4655266,
                ],
                40 => [
                    'name' => 'Досточки для оттиска',
                    'id' => 4655272,
                ],
                41 => [
                    'name' => 'Самонаборные штампы, кассы букв',
                    'id' => 2898382,
                ],
                42 => [
                    'name' => 'Штемпельные краски и подушки',
                    'id' => 2898387,
                ],
                43 => [
                    'name' => 'Датеры',
                    'id' => 4628926,
                ],
                44 => [
                    'name' => 'Оснастки, штампы стандартные',
                    'id' => 4629073,
                ],
            ]
        ]
    ],

    'case2' => [
        'setting' => [
            'description' => 'Получить список категорий стора в форме изменения типа или создания заявки/подзаявки',
        ],
        'fixture_data' => include __DIR__ . '/fixture/case1.php',
        'provider_data' => [
            'urlPart' => 'list',
            'requestParameters' => [
                'per-page' => 100,
                'sort' => 'title',
                'filter[title]' => 'папки',
            ],
            'responseBody' => [
                'data' => [
                    'models' => [
                        0 => [
                            'id' => 2581742,
                            'title' => 'Папки и файлы подвесные',
                            'mpath' => '.4625734.2460392.2460402.2581722.',
                            'status' => 'active',
                            'deleted' => NULL,
                            'parent_id' => 2581722,
                            'lisa_category_id' => 2,
                            'children' => 0,
                        ],
                        1 => [
                            'id' => 2581737,
                            'title' => 'Папки-планшеты',
                            'mpath' => '.4625734.2460392.2460402.2581722.',
                            'status' => 'active',
                            'deleted' => NULL,
                            'parent_id' => 2581722,
                            'lisa_category_id' => 2,
                            'children' => 0,
                        ],
                        2 => [
                            'id' => 2514862,
                            'title' => 'Папки пластиковые',
                            'mpath' => '.4625734.2460392.2460402.2581722.',
                            'status' => 'active',
                            'deleted' => NULL,
                            'parent_id' => 2581722,
                            'lisa_category_id' => 2,
                            'children' => 0,
                        ],
                        3 => [
                            'id' => 2581727,
                            'title' => 'Папки-портфели, папки-боксы',
                            'mpath' => '.4625734.2460392.2460402.2581722.',
                            'status' => 'active',
                            'deleted' => NULL,
                            'parent_id' => 2581722,
                            'lisa_category_id' => 2,
                            'children' => 0,
                        ],
                        4 => [
                            'id' => 2581732,
                            'title' => 'Папки-регистраторы',
                            'mpath' => '.4625734.2460392.2460402.2581722.',
                            'status' => 'active',
                            'deleted' => NULL,
                            'parent_id' => 2581722,
                            'lisa_category_id' => 2,
                            'children' => 0,
                        ],
                        5 => [
                            'id' => 4626584,
                            'title' => 'Папки специальные',
                            'mpath' => '.4625734.2460392.2460402.2581722.',
                            'status' => 'active',
                            'deleted' => NULL,
                            'parent_id' => 2581722,
                            'lisa_category_id' => 2,
                            'children' => 0,
                        ],
                        6 => [
                            'id' => 2595767,
                            'title' => 'Папки с файлами',
                            'mpath' => '.4625734.2460392.2460402.2581722.',
                            'status' => 'active',
                            'deleted' => NULL,
                            'parent_id' => 2581722,
                            'lisa_category_id' => 2,
                            'children' => 0,
                        ],
                    ],
                    '_links' => [
                        'self' => [
                            'href' => 'http://lisa-api.docker/rozetka-category/list?per-page=50&sort=title&filter%5Btitle%5D=%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8&page=1',
                        ],
                        'first' => [
                            'href' => 'http://lisa-api.docker/rozetka-category/list?per-page=50&sort=title&filter%5Btitle%5D=%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8&page=1',
                        ],
                        'last' => [
                            'href' => 'http://lisa-api.docker/rozetka-category/list?per-page=50&sort=title&filter%5Btitle%5D=%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8&page=1',
                        ],
                    ],
                    '_meta' => [
                        'totalCount' => 7,
                        'pageCount' => 1,
                        'currentPage' => 1,
                        'perPage' => 50,
                    ],
                ],
                'filters' => [
                    'title' => 'папки',
                ],
            ]
        ]
    ],

];
